Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: When an update is made to the stable release, care must be taken to avoid changing system behavior or introducing new bugs. In order to do this, make as few changes as possible to fix the bug. Users and administrators rely on the exact behavior of a release once it is made, so any change that is made might break someone's system. This is especially true of libraries: make sure you never change the API or ABI, no matter how small the change.
it: Nel momento in cui viene eseguito un aggiornamento alla versione stable, deve essere adottata molta cura per evitare di modificare il comportamento del sistema o di introdurre nuovi bug. Per fare questo, si faccia il minor numero di modifiche possibili per risolvere il bug. Gli utenti e gli amministratori si affidano all'esatto comportamento di un rilascio una volta che viene fatto, quindi qualsiasi modifica apportata potrebbe rompere il sistema di qualcuno. Questo è particolarmente vero per le biblioteche: assicurarsi di non modificare l'API o ABI, non importa quanto piccolo sia la modifica.

source: This means that moving to a new upstream version is not a good solution. Instead, the relevant changes should be back-ported to the version present in the current stable Debian release. Generally, upstream maintainers are willing to help if needed. If not, the Debian security team may be able to help.
it: Ciò significa che il passaggio a una nuova versione originale non è una buona soluzione. Invece, le rilevanti modifiche devono essere adattate alla versione presente nella attuale rilascio stabile di Debian. In generale, i maintainer originali sono disposti ad aiutare se necessario. In caso contrario, il team di sicurezza di Debian può essere in grado di aiutare.

source: In some cases, it is not possible to back-port a security fix, for example when large amounts of source code need to be modified or rewritten. If this happens, it may be necessary to move to a new upstream version. However, this is only done in extreme situations, and you must always coordinate that with the security team beforehand.
it: In alcuni casi, non è possibile adattare una correzione di sicurezza, per esempio quando grandi quantità di codice sorgente dovrebbero essere modificate o riscritte. Se questo accade, può essere necessario passare ad una nuova versione. Tuttavia, questo è fatto solo in situazioni estreme, e ci si deve sempre coordinare che con il team della sicurezza.

source: Related to this is another important guideline: always test your changes. If you have an exploit available, try it and see if it indeed succeeds on the unpatched package and fails on the fixed package. Test other, normal actions as well, as sometimes a security fix can break seemingly unrelated features in subtle ways.
it: A questo si collega un'altra importante linea guida: verificare sempre le modifiche. Se si dispone di un exploit, provare e vedere se davvero ha avuto successo sul pacchetto senza patch e fallisce sul pacchetto corretto. Provare altre, anche normali azioni, dato che a volte una correzione di sicurezza può rompere in modi sottili caratteristiche apparentemente non correlate.

source: Do <emphasis role="strong">NOT</emphasis> include any changes in your package which are not directly related to fixing the vulnerability. These will only need to be reverted, and this wastes time. If there are other bugs in your package that you would like to fix, make an upload to proposed-updates in the usual way, after the security advisory is issued. The security update mechanism is not a means for introducing changes to your package which would otherwise be rejected from the stable release, so please do not attempt to do this.
it: <emphasis role="strong">NON</emphasis> includere eventuali modifiche nel proprio pacchetto che non sono direttamente collegate alla correzione della vulnerabilità. Queste avranno bisogno solo di essere annullate, e questo richiede tempo. Se ci sono altri bug nel pacchetto che si desidera correggere, si faccia un caricamento su proposed-updates nel solito modo, dopo che l'avviso di sicurezza viene pubblicato. Il meccanismo di aggiornamento della sicurezza non è un mezzo per introdurre modifiche al pacchetto che altrimenti verrebbero respinte per il rilascio stabile, quindi per favore non si tenti di farlo.

source: Review and test your changes as much as possible. Check the differences from the previous version repeatedly (<command>interdiff</command> from the <systemitem role="package">patchutils</systemitem> package and <command>debdiff</command> from <systemitem role="package">devscripts</systemitem> are useful tools for this, see <xref linkend="debdiff"/>).
it: Si verifichino e testino le modifiche per quanto possibile. Si controllino ripetutamente le differenze rispetto alla versione precedente (<command>interdiff</command> dal pacchetto <systemitem role="package">patchutils</systemitem> e <command>debdiff</command> da <systemitem role="package">devscripts</systemitem> sono strumenti utili per questo, si consulti <xref linkend="debdiff"/>).

source: Be sure to verify the following items:
it: Assicurarsi di verificare i seguenti elementi:

source: <emphasis role="strong">Target the right distribution</emphasis> in your <filename>debian/changelog</filename>: <replaceable>codename</replaceable><literal>-security</literal> (e.g. <literal>&codename-stable;-security</literal>). Do not target <replaceable>distribution</replaceable><literal>-proposed-updates</literal> or <literal>stable</literal>!
it: <emphasis role="strong">Individuare la giusta distribuzione </emphasis> nel proprio <filename>debian/changelog</filename>. Per <literal>stable</literal> questa è <literal>stable-security</literal> e per <literal>testing</literal> questa è <literal>testing-security</literal>, e per la precedente versione stable, questa è <literal>oldstable-security</literal>. Non si punti a <replaceable>distribution</replaceable><literal>-proposed-updates </literal> o <literal>stable</literal>!

source: The upload should have <emphasis role="strong">urgency=high</emphasis>.
it: Il caricamento deve avere <emphasis role="strong">urgency=high</emphasis>.

source: Make descriptive, meaningful changelog entries. Others will rely on them to determine whether a particular bug was fixed. Add <literal>closes:</literal> statements for any <emphasis role="strong">Debian bugs</emphasis> filed. Always include an external reference, preferably a <emphasis role="strong">CVE identifier</emphasis>, so that it can be cross-referenced. However, if a CVE identifier has not yet been assigned, do not wait for it but continue the process. The identifier can be cross-referenced later.
it: Si creino voci descrittive e significative nel changelog. Altri faranno affidamento su di loro per determinare se un particolare bug è stato risolto. Si aggiungano istruzioni <literal>closes:</literal> per eventuali <emphasis role="strong">bug di Debian </emphasis> pubblicati. Sempre includete un riferimento esterno, preferibilmente un <emphasis role="strong">identificatore CVE </emphasis>, in modo che ci possa essere un riferimento incrociato. Tuttavia, se un identificatore CVE non è ancora stato assegnato, non attenderlo ma continuare il processo. L'identificatore può essere referenziato più tardi.

source: Make sure the <emphasis role="strong">version number</emphasis> is proper. It must be greater than the current package, but less than package versions in later distributions. If in doubt, test it with <literal>dpkg --compare-versions</literal>. Be careful not to re-use a version number that you have already used for a previous upload, or one that conflicts with a binNMU. The convention is to append <literal>+deb</literal><replaceable>X</replaceable><literal>u1</literal> (where <replaceable>X</replaceable> is the major release number), e.g. <literal>1:2.4.3-4+deb&version-stable;u1</literal>, of course increasing 1 for any subsequent uploads.
it: Assicurarsi che il <emphasis role="strong">version number</emphasis> sia corretto. Esso deve essere maggiore del pacchetto corrente, ma minore delle versioni del pacchetto in distribuzioni successive. In caso di dubbio, provare con <literal>dpkg - compare-versions</literal>. Fare attenzione a non riutilizzare un numero di versione che è già stato utilizzato per un caricamento precedente, o uno che è in conflitto con un binNMU. La convenzione è quella di aggiungere <literal>+</literal><replaceable>codename</replaceable> <literal>1</literal>, ad esempio, <literal> 1:2.4.3-4+lenny1</literal>, ovviamente aumentando di 1 ad ogni aggiornamento successivo.

source: Unless the upstream source has been uploaded to <literal>security.debian.org</literal> before (by a previous security update), build the upload <emphasis role="strong">with full upstream source</emphasis> (<literal>dpkg-buildpackage -sa</literal>). If there has been a previous upload to <literal>security.debian.org</literal> with the same upstream version, you may upload without upstream source (<literal>dpkg-buildpackage -sd</literal>).
it: A meno che il sorgente originale sia stato prima caricato su <literal>security.debian.org</literal> (grazie ad un aggiornamento di sicurezza precedente), costruite il file da caricare <emphasis role="strong">con tutto il codice originale</emphasis> (<literal>dpkg-buildpackage -sa</literal>). Se vi è stato un precedente caricamento su <literal>security.debian.org</literal> con la stessa versione dell'originale, si può caricare senza sorgenti originali (<literal>dpkg-buildpackage -sd</literal>).

source: Be sure to use the <emphasis role="strong">exact same <filename>*.orig.tar.{gz,bz2,xz}</filename></emphasis> as used in the normal archive, otherwise it is not possible to move the security fix into the main archives later.
it: Assicurarsi di utilizzare <emphasis role="strong">esattamente lo stesso<filename>*.orig.tar.{gz,bz2,xz}</filename></emphasis> come usato nell'archivio normale, altrimenti non è possibile spostare la correzione di sicurezza negli archivi principali dopo.

source: Build the package on a <emphasis role="strong">clean system</emphasis> which only has packages installed from the distribution you are building for. If you do not have such a system yourself, you can use a debian.org machine (see <xref linkend="server-machines"/>) or setup a chroot (see <xref linkend="pbuilder"/> and <xref linkend="debootstrap"/>).
it: Si compili il pacchetto su un <emphasis role="strong">sistema pulito</emphasis>, che ha installati solo i pacchetti della distribuzione per la quale si sta costruendo. Se non si dispone di un tale sistema, è possibile utilizzare una macchina di debian.org (si consulti <xref linkend="server-machines"/>) oppure si configuri un chroot (si consulti <xref linkend="pbuilder"/> e <xref linkend="debootstrap"/>).

source: Uploading the fixed package
it: Caricamento del pacchetto corretto

source: Do <emphasis role="strong">NOT</emphasis> upload a package to the security upload queue (on <literal>security-master.debian.org</literal>) without prior authorization from the security team. If the package does not exactly meet the team's requirements, it will cause many problems and delays in dealing with the unwanted upload.
it: <emphasis role="strong">NON</emphasis> caricare un pacchetto nella coda di caricamento di sicurezza (<literal>oldstable-security</literal>, <literal>stable-security</literal>, etc.) senza la preventiva autorizzazione da parte del team di sicurezza. Se il pacchetto non soddisfa le esigenze del team, causerà molti problemi e ritardi nel trattare con il caricamento indesiderato.

source: Do <emphasis role="strong">NOT</emphasis> upload your fix to <literal>proposed-updates</literal> without coordinating with the security team. Packages from <literal>security.debian.org</literal> will be copied into the <literal>proposed-updates</literal> directory automatically. If a package with the same or a higher version number is already installed into the archive, the security update will be rejected by the archive system. That way, the stable distribution will end up without a security update for this package instead.
it: <emphasis role="strong">NON</emphasis> caricare la correzione su <literal>proposed-updates</literal>, senza coordinarsi con il team di sicurezza. I pacchetti da <literal>security.debian.org</literal> saranno copiati nella cartella <literal>proposed-updates</literal> automaticamente. Se un pacchetto con lo stesso numero di versione o uno più alto è già installato nell'archivio, l'aggiornamento per la sicurezza sarà rifiutato dal sistema di archiviazione. In questo modo, la distribuzione stabile non avrà un aggiornamento di sicurezza per questo pacchetto.

source: Once you have created and tested the new package and it has been approved by the security team, it needs to be uploaded so that it can be installed in the archives. For security uploads, the place to upload to is <literal>ftp://security-master.debian.org/pub/SecurityUploadQueue/</literal>.
it: Dopo aver creato e testato il nuovo pacchetto ed è stato approvato dal team di sicurezza, occorre caricarlo in modo che possa essere installato negli archivi. Per aggiornamenti di sicurezza, il posto giusto per farlo è <literal>ftp://security-master.debian.org/pub/SecurityUploadQueue/</literal>.

source: Once an upload to the security queue has been accepted, the package will automatically be built for all architectures and stored for verification by the security team.
it: Una volta che un caricamento nella coda di sicurezza è stato accettato, il pacchetto viene automaticamente compilato per tutte le architetture e conservato per la verifica da parte del team di sicurezza.

source: Uploads which are waiting for acceptance or verification are only accessible by the security team. This is necessary since there might be fixes for security problems that cannot be disclosed yet.
it: I caricamenti che sono in attesa di accettazione o di verifica sono accessibili solo da parte del team di sicurezza. Ciò è necessario in quanto ci potrebbero essere correzioni per i problemi di sicurezza che non possono essere ancora rivelati.

source: If a member of the security team accepts a package, it will be installed on <literal>security.debian.org</literal> as well as proposed for the proper <replaceable>distribution</replaceable><literal>-proposed-updates</literal> on <literal>&ftp-master-host;</literal>.
it: Se un membro del team di sicurezza accetta un pacchetto, verrà installato su <literal>security.debian.org</literal>, così come proposto per la corretta <replaceable>distribution</replaceable><literal>-proposed-updates </literal> in <literal>&ftp-master-host;</literal>.

source: Moving, removing, renaming, orphaning, adopting, and reintroducing packages
it: Lo spostamento, la rimozione, la ridenominazione, l'adozione, e rendere orfani i pacchetti

source: Some archive manipulation operations are not automated in the Debian upload process. These procedures should be manually followed by maintainers. This chapter gives guidelines on what to do in these cases.
it: Alcune operazioni di manipolazione di archivi non sono automatizzate nel processo di caricamento di Debian. Queste procedure devono essere seguite manualmente dai maintainer. Questo capitolo fornisce le linee guida su cosa fare in questi casi.

source: Moving packages
it: Spostare i pacchetti

source: See the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> for guidelines on what section a package belongs in.
it: Si consulti il <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> per le linee guida su quale sezione appartiene un pacchetto.

source: Sometimes a package will change its section. For instance, a package from the <literal>non-free</literal> section might be GPL'd in a later version, in which case the package should be moved to `main' or `contrib'.<placeholder type="footnote" id="0"/>
it: A volte un pacchetto cambierà la sua sezione. Per esempio, un pacchetto dalla sezione <literal>non-free</literal> potrebbe essere GPLizzato in una versione successiva, nel qual caso il pacchetto dovrebbe essere spostato in «main» o «contrib».<placeholder type="footnote" id="0"/>

source: If you need to change the section for one of your packages, change the package control information to place the package in the desired section, and re-upload the package (see the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> for details). You must ensure that you include the <filename>.orig.tar.{gz,bz2,xz}</filename> in your upload (even if you are not uploading a new upstream version), or it will not appear in the new section together with the rest of the package. If your new section is valid, it will be moved automatically. If it does not, then contact the ftpmasters in order to understand what happened.
it: Se è necessario modificare la sezione per uno dei propri pacchetti, si modifichino le informazioni di controllo del pacchetto per far posizionare il pacchetto nella sezione desiderata, e caricare nuovamente il pacchetto (si consulti il <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> per i dettagli). È necessario assicurarsi di includere il <filename>.orig.tar.{gz,bz2,xz}</filename> nel proprio caricamento (anche se non si sta caricando una nuova versione), oppure non comparirà nella nuova sezione insieme al resto del pacchetto. Se la nuova sezione è valida, verrà spostata automaticamente. Se non lo è, allora si contatti gli ftpmasters per capire cosa è successo.

source: If, on the other hand, you need to change the <literal>subsection</literal> of one of your packages (e.g., ``devel'', ``admin''), the procedure is slightly different. Correct the subsection as found in the control file of the package, and re-upload that. Also, you'll need to get the override file updated, as described in <xref linkend="override-file"/>.
it: Se, d'altra parte, è necessario modificare la <literal>subsection</literal> di uno dei pacchetti (per esempio, «devel», «admin»), la procedura è leggermente diversa. Correggete la subsection come si trova nel file di controllo del pacchetto, e caricatelo nuovamente. Inoltre, è necessario per avere il file di override aggiornato, come descritto in <xref linkend="override-file"/>.

source: Removing packages
it: Rimozione dei pacchetti

source: If for some reason you want to completely remove a package (say, if it is an old compatibility library which is no longer required), you need to file a bug against <systemitem role="package">&ftp-debian-org;</systemitem> asking that the package be removed; as all bugs, this bug should normally have normal severity. The bug title should be in the form <literal>RM: <replaceable>package</replaceable> <replaceable>[architecture list]</replaceable> -- <replaceable>reason</replaceable></literal>, where <replaceable>package</replaceable> is the package to be removed and <replaceable>reason</replaceable> is a short summary of the reason for the removal request. <replaceable>[architecture list]</replaceable> is optional and only needed if the removal request only applies to some architectures, not all. Note that the <command>reportbug</command> will create a title conforming to these rules when you use it to report a bug against the <systemitem role="package">&ftp-debian-org;</systemitem> pseudo-package.
it: Se per qualche motivo si desidera rimuovere completamente un pacchetto (ad esempio, se si tratta di una vecchia libreria di compatibilità che non è più richiesta), è necessario presentare un bug su <systemitem role="package">&ftp-debian-org;</systemitem> chiedendo che il pacchetto sia rimosso; come tutti i bug, questo bug dovrebbe di norma avere gravità normal. Il titolo della segnalazione del bug dovrebbe essere della forma <literal>RM: <replaceable>package</replaceable><replaceable>[architecture list]</replaceable>--<replaceable>reason</replaceable></literal>, dove <replaceable >package</replaceable> è il pacchetto da rimuovere e <replaceable>reason</replaceable> è una breve sintesi del motivo per la richiesta di rimozione. <replaceable>[architecture list]</replaceable> è facoltativo e necessario solo se la richiesta di rimozione vale solo per alcune architetture, non tutte. Si noti che il <command>reportbug</command> creerà un titolo conforme a queste regole quando lo si utilizza per segnalare un bug per lo psudo-pacchetto <systemitem role="package">&ftp-debian-org;</systemitem>.

source: If you want to remove a package you maintain, you should note this in the bug title by prepending <literal>ROM</literal> (Request Of Maintainer). There are several other standard acronyms used in the reasoning for a package removal, see <ulink url="https://&ftp-master-host;/removals.html"></ulink> for a complete list. That page also provides a convenient overview of pending removal requests.
it: Se si vuole rimuovere un pacchetto che si mantiene, lo si dovrebbe evidenziare nel titolo del bug anteponendo <literal>ROM</literal> (Request Of Maintainer). Ci sono diversi altri acronimi standard utilizzati nel motivare una rimozione di un pacchetto, si consulti <ulink url="http://&ftp-master-host;/removals.html"> </ulink> per un elenco completo. Quella pagina fornisce anche una comoda visione generale delle richieste di rimozione in sospeso.

source: Note that removals can only be done for the <literal>unstable</literal>, <literal>experimental</literal> and <literal>stable</literal> distribution. Packages are not removed from <literal>testing</literal> directly. Rather, they will be removed automatically after the package has been removed from <literal>unstable</literal> and no package in <literal>testing</literal> depends on it. (Removals from <literal>testing</literal> are possible though by filing a removal bug report against the <systemitem role="package">&release-debian-org;</systemitem> pseudo-package. See the section <xref linkend="removals"/>.)
it: Si noti che le rimozioni possono essere fatte solo per la distribuzione <literal>unstable</literal>, <literal>experimental</literal> and <literal>stable</literal>. I pacchetti non vengono rimossi da <literal>testing</literal> direttamente. Piuttosto, essi saranno rimossi automaticamente dopo che il pacchetto è stato rimosso da <literal>unstable</literal> e nessun pacchetto in <literal>testing</literal> dipenda da esso. (Rimozioni da <literal>testing</literal> sono possibili presentando una segnalazione di bug di rimozione su <systemitem role="package">&release-debian-org;</systemitem>. Si consulti la sezione <xref linkend="removals"/>.)

source: There is one exception when an explicit removal request is not necessary: If a (source or binary) package is no longer built from source, it will be removed semi-automatically. For a binary-package, this means if there is no longer any source package producing this binary package; if the binary package is just no longer produced on some architectures, a removal request is still necessary. For a source-package, this means that all binary packages it refers to have been taken over by another source package.
it: C'è una sola eccezione quando una richiesta di rimozione esplicita non è necessaria: se un pacchetto (sorgente o binario) non è più compilato dal sorgente, verrà rimosso in modo semiautomatico. Per un pacchetto binario, questo significa che se non vi è più alcun pacchetto sorgente che produce questo pacchetto binario; se il pacchetto binario non è più prodotto per alcune architetture, una richiesta di rimozione è ancora necessaria. Per un pacchetto sorgente, questo significa che tutti i pacchetti binari che a lui si riferiscono devono riferirsi ad un altro pacchetto sorgente.
