Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: Packages can also be uploaded via ssh to <literal>&ssh-upload-host;</literal>; files should be put <literal>/srv/upload.debian.org/UploadQueue</literal>. This queue does not support <link linkend="delayed-incoming">delayed uploads</link>.
it: I pacchetti possono anche essere caricati via ssh al <literal>&ssh-upload-host;</literal>; i file devono essere messi in <literal>/srv/upload.debian.org/UploadQueue</literal>. Questa coda non supporta <link linkend="delayed-incoming">caricamenti differiti</link>.

source: Notification that a new package has been installed
it: Notifica che un nuovo pacchetto è stato installato

source: The Debian archive maintainers are responsible for handling package uploads. For the most part, uploads are automatically handled on a daily basis by the archive maintenance tools, <command>dak process-upload</command>. Specifically, updates to existing packages to the <literal>unstable</literal> distribution are handled automatically. In other cases, notably new packages, placing the uploaded package into the distribution is handled manually. When uploads are handled manually, the change to the archive may take some time to occur. Please be patient.
it: I maintainer dell'archivio Debian sono responsabili per la gestione dei caricamenti dei pacchetti. Per la maggior parte, i caricamenti sono gestiti automaticamente su base giornaliera dagli strumenti di manutenzione, <command>dak process-upload</command>. In particolare, aggiornamenti di pacchetti esistenti nella distribuzione <literal>unstable</literal> sono gestiti automaticamente. In altri casi, in particolare per i nuovi pacchetti, il posizionamento del pacchetto caricato nella distribuzione viene gestita manualmente. Quando i caricamenti sono gestiti manualmente, la modifica all'archivio può richiedere un certo tempo. Si sia pazienti.

source: In any case, you will receive an email notification indicating that the package has been added to the archive, which also indicates which bugs will be closed by the upload. Please examine this notification carefully, checking if any bugs you meant to close didn't get triggered.
it: In ogni caso, si riceverà una email di notifica per indicare che il pacchetto è stato aggiunto all'archivio, inoltre indica quali bug saranno chiusi dal caricamento. Esaminare attentamente questa notifica, controllando se qualche bug che si intendeva chiudere è stato tralasciato.

source: The installation notification also includes information on what section the package was inserted into. If there is a disparity, you will receive a separate email notifying you of that. Read on below.
it: La notifica di installazione include anche informazioni sulla sezione nella quale il pacchetto è stato inserito. Se vi è una disparità, riceverai una email separata di notifica che te lo comunicherà. Si continui a leggere di seguito.

source: Note that if you upload via queues, the queue daemon software will also send you a notification by email.
it: Si noti che se si carica tramite le code, il software demone delle code invierà anche una notifica via email.

source: Specifying the package section, subsection and priority
it: Specificare la sezione del pacchetto, sottosezione e la priorità

source: The <filename>debian/control</filename> file's <literal>Section</literal> and <literal>Priority</literal> fields do not actually specify where the file will be placed in the archive, nor its priority. In order to retain the overall integrity of the archive, it is the archive maintainers who have control over these fields. The values in the <filename>debian/control</filename> file are actually just hints.
it: I campi <literal>Section</literal> e <literal>Priority</literal> del file <filename>debian/control</filename> in realtà non specificano dove il file verrà inserito nell'archivio, né la sua priorità. Al fine di mantenere l'integrità complessiva dell'archivio, sono i maintainer dell'archivio che hanno il controllo su questi campi. I valori del file <filename>debian/control</filename> sono in realtà solo suggerimenti.

source: The archive maintainers keep track of the canonical sections and priorities for packages in the <literal>override file</literal>. If there is a disparity between the <literal>override file</literal> and the package's fields as indicated in <filename>debian/control</filename>, then you will receive an email noting the divergence when the package is installed into the archive. You can either correct your <filename>debian/control</filename> file for your next upload, or else you may wish to make a change in the <literal>override file</literal>.
it: I maintainer dell'archivio mantengono traccia delle sezioni e delle priorità canoniche per i pacchetti presenti nel file <literal>override</literal>. Se c'è una disparità tra il file <literal>override</literal> e campi del pacchetto come indicato in <filename>debian/control</filename>, allora si riceverà una email che sottolinerà la divergenza nel momento in cui il pacchetto viene installato nell'archivio. È possibile correggere il file<filename>debian/control</filename> per il successivo caricamento, oppure si potrebbe desiderare di fare un cambiamento nel <literal>file di override</literal>.

source: To alter the actual section that a package is put in, you need to first make sure that the <filename>debian/control</filename> file in your package is accurate. Next, submit a bug against <systemitem role="package">ftp.debian.org</systemitem> requesting that the section or priority for your package be changed from the old section or priority to the new one. Use a Subject like <literal>override: PACKAGE1:section/priority, [...], PACKAGEX:section/priority</literal>, and include the justification for the change in the body of the bug report.
it: Per modificare la sezione attuale nella quale il pacchetto è stato inserito, è necessario prima assicurarsi che il <filename>debian/control</filename> nel pacchetto sia preciso. Successivamente, si crei un bug su <systemitem role="package">ftp.debian.org</systemitem> chiedendo che la sezione o la priorità per il pacchetto siano modificati dalla vecchia sezione o priorità a quella nuova. Si utilizzi un Subject del tipo <literal>override: Package1: sezione/priorità, [...], PACKAGEX: sezione/priorità</literal>, e includere la motivazione per la modifica nel corpo della segnalazione del bug.

source: For more information about <literal>override files</literal>, see <citerefentry> <refentrytitle>dpkg-scanpackages</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> and <ulink url="&url-bts-devel;#maintincorrect"></ulink>.
it: Per ulteriori informazioni sugli <literal>file di override</literal>, si consulti <citerefentry> <refentrytitle>dpkg-scanpackages</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> e <ulink url="&url-bts-devel;#maintincorrect"></ulink>.

source: Note that the <literal>Section</literal> field describes both the section as well as the subsection, which are described in <xref linkend="archive-sections"/>. If the section is main, it should be omitted. The list of allowable subsections can be found in <ulink url="&url-debian-policy;ch-archive.html#s-subsections"></ulink>.
it: Si noti che il campo <literal>Section</literal> descrive sia la sezione che la sottosezione, che sono descritti nella <xref linkend="archive-sections"/>. Se la sezione è la principale, dovrebbe essere omessa. L'elenco delle sottosezioni ammissibili può essere trovato in <ulink url="&url-debian-policy;ch-archive.html#s-subsections"></ulink>.

source: Handling bugs
it: Gestione dei bug

source: Every developer has to be able to work with the Debian <ulink url="&url-bts;">bug tracking system</ulink>. This includes knowing how to file bug reports properly (see <xref linkend="submit-bug"/>), how to update them and reorder them, and how to process and close them.
it: Ogni sviluppatore deve essere capace di lavorare con il Debian <ulink url="&url-bts;">bug tracking system</ulink>. Questo implica la conoscenza di come creare propriamente le segnalazioni di bug (si consulti <xref linkend="submit-bug"/>), di come modificarli e riordinarli, e di come processarli e chiuderli.

source: The bug tracking system's features are described in the <ulink url="&url-bts-devel;">BTS documentation for developers</ulink>. This includes closing bugs, sending followup messages, assigning severities and tags, marking bugs as forwarded, and other issues.
it: Le caratteristiche del sistema di tracciamento dei bug sono descritte nella documentazione <ulink url="&url-bts-devel;">BTS per gli sviluppatori</ulink>. Questo include la chiusura bug, l'invio di messaggi di riepilogo, l'assegnazione dei livelli di gravità e tag, il marcare i bug come inoltrati, e altre questioni.

source: Operations such as reassigning bugs to other packages, merging separate bug reports about the same issue, or reopening bugs when they are prematurely closed, are handled using the so-called control mail server. All of the commands available on this server are described in the <ulink url="&url-bts-control;">BTS control server documentation</ulink>.
it: Operazioni quali la riassegnazione di bug ad altri pacchetti, fondendo le segnalazioni di bug separate sullo stesso problema, o la riapertura di bug quando sono chiusi prematuramente, vengono gestite utilizzando il cosiddetto server di controllo di posta elettronica. Tutti i comandi disponibili su questo server sono descritti nella documentazione del server di controllo <ulink url="&url-bts-control;">BTS </ulink>.

source: Monitoring bugs
it: Monitoraggio dei bug

source: If you want to be a good maintainer, you should periodically check the <ulink url="&url-bts;">Debian bug tracking system (BTS)</ulink> for your packages. The BTS contains all the open bugs against your packages. You can check them by browsing this page: <literal>https://&bugs-host;/<replaceable>yourlogin</replaceable>@debian.org</literal>.
it: Se si vuole essere un buon maintainer, si dovrebbe verificare periodicamente il <ulink url="&url-bts;">Debian bug tracking system (BTS)</ulink> per i propri pacchetti. Il BTS contiene tutti i bug aperti per i propri pacchetti. È possibile controllarli sfogliando questa pagina: <literal> http://&bugs-host;/<replaceable>yourlogin</replaceable>@debian.org</literal>.

source: Maintainers interact with the BTS via email addresses at <literal>&bugs-host;</literal>. Documentation on available commands can be found at <ulink url="&url-bts;"></ulink>, or, if you have installed the <systemitem role="package">doc-debian</systemitem> package, you can look at the local files &file-bts-docs;.
it: I maintainer interagiscono con le BTS attraverso indirizzi di posta elettronica a <literal>&bugs-host;</literal>. La documentazione sui comandi disponibili può essere trovata su <ulink url="&url-bts;"> </ulink>, oppure, se è stato installato il pacchetto <systemitem role="package">doc-debian</systemitem>, è possibile guardare i file locali &file-bts-docs;.

source: Some find it useful to get periodic reports on open bugs. You can add a cron job such as the following if you want to get a weekly email outlining all the open bugs against your packages:
it: Alcuni trovano utile avere rapporti periodici sul bug aperti. È possibile aggiungere un processo di cron come segue, se si vuole ottenere una email settimanale che illustra tutti i bug aperti per i propri pacchetti:

source: Replace <replaceable>address</replaceable> with your official Debian maintainer address.
it: Sostituite <replaceable>address</replaceable> con il proprio indirizzo ufficiale di maintainer Debian.

source: Responding to bugs
it: Rispondere ai bug

source: When responding to bugs, make sure that any discussion you have about bugs is sent both to the original submitter of the bug, and to the bug itself (e.g., <email><replaceable>123</replaceable>@&bugs-host;</email>). If you're writing a new mail and you don't remember the submitter email address, you can use the <email><replaceable>123</replaceable>-submitter@&bugs-host;</email> email to contact the submitter <emphasis>and</emphasis> to record your mail within the bug log (that means you don't need to send a copy of the mail to <email><replaceable>123</replaceable>@&bugs-host;</email>).
it: Quando si risponde ad un bug, fare in modo che ogni discussione che si ha sui bug venga inviata sia al mittente originario del bug, e per il bug stesso (ad esempio, <email><replaceable>123</replaceable>@&bugs-host;</email>). Se si sta scrivendo un nuovo messaggio e non si ricorda l'indirizzo di posta elettronica del mittente, è possibile utilizzare l'email <email><replaceable>123</replaceable>-submitter@&bugs-host;</email> per contattare il mittente <emphasis>e</emphasis> per registrare la propria posta dentro il log del bug (il che significa che non è necessario inviare una copia della email a <email><replaceable>123</replaceable>@&bugs-host;</email>).

source: If you get a bug which mentions FTBFS, this means Fails to build from source. Porters frequently use this acronym.
it: Se si ottiene un bug che cita FTBFS, questo significa non si riesce a compilare dai sorgenti. Gli autori dei port utilizzano spesso questo acronimo.

source: Once you've dealt with a bug report (e.g. fixed it), mark it as <literal>done</literal> (close it) by sending an explanation message to <email><replaceable>123</replaceable>-done@&bugs-host;</email>. If you're fixing a bug by changing and uploading the package, you can automate bug closing as described in <xref linkend="upload-bugfix"/>.
it: Una volta che si è affrontata una segnalazione di bug (e.g. correggendolo), lo si contrassegni come <literal>done</literal> (lo si chiuda) con l'invio di un messaggio di spiegazione a <email><replaceable>123</replaceable>-done@&bugs-host;</email>. Se si sta correggendo un bug modificando e caricando il pacchetto, è possibile automatizzare la chiusura del bug come descritto in <xref linkend="upload-bugfix"/>.

source: You should <emphasis>never</emphasis> close bugs via the bug server <literal>close</literal> command sent to &email-bts-control;. If you do so, the original submitter will not receive any information about why the bug was closed.
it: <emphasis>Mai</emphasis> si dovrebbe chiudere un bug tramite il comando del bug server <literal>close</literal> inviato a &email-bts-control;. Se lo fate, il mittente originale non riceverà alcuna informazione sul perché il bug è stato chiuso.

source: Bug housekeeping
it: Pulizia dei bug

source: As a package maintainer, you will often find bugs in other packages or have bugs reported against your packages which are actually bugs in other packages. The bug tracking system's features are described in the <ulink url="&url-bts-devel;">BTS documentation for Debian developers</ulink>. Operations such as reassigning, merging, and tagging bug reports are described in the <ulink url="&url-bts-control;">BTS control server documentation</ulink>. This section contains some guidelines for managing your own bugs, based on the collective Debian developer experience.
it: Come maintainer del pacchetto, spesso si trovano bug in altri pacchetti o si hanno bug segnalati sui propri pacchetti ma che in realtà sono bug di altri pacchetti. Le caratteristiche del sistema di tracciamento dei bug sono descritte nella documentazione <ulink url="&url-bts-devel;">BTS per gli sviluppatori Debian</ulink>. Operazioni come la riassegnazione, l'unione e segnalazioni di bug, l'etichettatura sono descritte nella <ulink url="&url-bts-control;">BTS control server documentation</ulink>. Questa sezione contiene alcune linee guida per la gestione dei propri bug, sulla base dell'esperienza collettiva degli sviluppatori Debian.

source: Filing bugs for problems that you find in other packages is one of the civic obligations of maintainership, see <xref linkend="submit-bug"/> for details. However, handling the bugs in your own packages is even more important.
it: Segnalare bug per problemi che si trovano in altri pacchetti è uno dei doveri civici di maintainer, si consulti <xref linkend="submit-bug"/> per i dettagli. Tuttavia, la gestione dei bug nei propri pacchetti è ancora più importante.

source: Here's a list of steps that you may follow to handle a bug report:
it: Ecco un elenco di passaggi che si possono seguire per gestire una segnalazione di errore:

source: Decide whether the report corresponds to a real bug or not. Sometimes users are just calling a program in the wrong way because they haven't read the documentation. If you diagnose this, just close the bug with enough information to let the user correct their problem (give pointers to the good documentation and so on). If the same report comes up again and again you may ask yourself if the documentation is good enough or if the program shouldn't detect its misuse in order to give an informative error message. This is an issue that may need to be brought up with the upstream author.
it: Decidere se la segnalazione corrisponde ad un vero e proprio bug o meno. A volte gli utenti invocano un programma nel modo sbagliato perché non hanno letto la documentazione. Se la diagnosi è questa, basta chiudere il bug con informazioni sufficienti per consentire agli utenti di correggere il loro problema (dare indicazioni sulla buona documentazione e così via). Se la stessa segnalazione viene presentata più e più volte ci si potrebbe chiedere se la documentazione sia sufficiente o se il programma non rilevi il suo cattivo uso al fine di fornire un messaggio di errore. Questo è un problema che può aver bisogno di essere risolto con l'autore originale.

source: If the bug submitter disagrees with your decision to close the bug, they may reopen it until you find an agreement on how to handle it. If you don't find any, you may want to tag the bug <literal>wontfix</literal> to let people know that the bug exists but that it won't be corrected. If this situation is unacceptable, you (or the submitter) may want to require a decision of the technical committee by reassigning the bug to <systemitem role="package">tech-ctte</systemitem> (you may use the clone command of the BTS if you wish to keep it reported against your package). Before doing so, please read the <ulink url="&url-tech-ctte;">recommended procedure</ulink>.
it: Se il mittente del bug non è d'accordo con la vostra decisione di chiuderlo, può riaprirlo fino a quando non si trovi un accordo su come gestirlo. Se non si trova, si consiglia di contrassegnare il bug <literal>wontfix</literal>, per far sapere che il bug esiste ma che non sarà corretto. Se questa situazione è inaccettabile, il maintainer (o il mittente) può richiedere una decisione del comitato tecnico riassegnando il bug a <systemitem role="package">tech-ctte</systemitem> (si può usare il comando clone del BTS se si desidera tenerlo riportato sul pacchetto). Prima di procedere, leggere le <ulink url="&url-tech-ctte;">recommended procedure</ulink>.

source: If the bug is real but it's caused by another package, just reassign the bug to the right package. If you don't know which package it should be reassigned to, you should ask for help on <link linkend="irc-channels">IRC</link> or on &email-debian-devel;. Please inform the maintainer(s) of the package you reassign the bug to, for example by Cc:ing the message that does the reassign to <email><replaceable>packagename</replaceable>@packages.debian.org</email> and explaining your reasons in that mail. Please note that a simple reassignment is <emphasis>not</emphasis> e-mailed to the maintainers of the package being reassigned to, so they won't know about it until they look at a bug overview for their packages.
it: Se il bug è reale ma è causato da un altro pacchetto, basta riassegnare il bug al pacchetto giusto. Se non si sa a quale pacchetto dovrebbe essere riassegnato, si dovrebbe chiedere aiuto su <link linkend="irc-channels">IRC</link> o su &email-debian-devel;. Informare il maintainer del pacchetto al quale si riassegna il bug, per esempio mettendo in Cc: al messaggio che fa la riassegnazione a <email><replaceable>packagename</replaceable>@packages.debian.org</email> e spiegando le proprie motivazioni nel corpo della email. Si noti che una semplice riassegnazione <emphasis>non</emphasis> è inviata ai maintainer del pacchetto al quale viene riassegnato, quindi non avranno modo di saperlo fino a quando consulteranno la panoramica dei bug per i loro pacchetti.

source: If the bug affects the operation of your package, please consider cloning the bug and reassigning the clone to the package that really causes the behavior. Otherwise, the bug will not be shown in your package's bug list, possibly causing users to report the same bug over and over again. You should block "your" bug with the reassigned, cloned bug to document the relationship.
it: Se il bug interessa il funzionamento del proprio pacchetto, si consideri di clonare il bug e di riassegnarlo al pacchetto che realmente provoca il comportamento. In caso contrario, il bug non verrà mostrato nella lista dei bug del proprio pacchetto, inducendo gli utenti a segnalare lo stesso problema più e più volte. Si dovrebbe bloccare «il proprio» bug con il bug riassegnato, clonato per documentare la relazione.

source: Sometimes you also have to adjust the severity of the bug so that it matches our definition of the severity. That's because people tend to inflate the severity of bugs to make sure their bugs are fixed quickly. Some bugs may even be dropped to wishlist severity when the requested change is just cosmetic.
it: A volte è necessario anche per regolare la gravità del bug in modo che corrisponda alla propria definizione di gravità. Questo perché le persone tendono a gonfiare la gravità dei bug per assicurarsi che i loro bug siano risolti rapidamente. Alcuni bug possono anche essere lasciati con gravità wishlist quando il cambiamento richiesto è solo estetico.

source: If the bug is real but the same problem has already been reported by someone else, then the two relevant bug reports should be merged into one using the merge command of the BTS. In this way, when the bug is fixed, all of the submitters will be informed of this. (Note, however, that emails sent to one bug report's submitter won't automatically be sent to the other report's submitter.) For more details on the technicalities of the merge command and its relative, the unmerge command, see the BTS control server documentation.
it: Se il bug è reale, ma lo stesso problema è già stato segnalato da qualcun altro, allora le due segnalazioni di bug rilevanti dovrebbero essere fuse in una sola utilizzando il comando merge del BTS. In questo modo, quando il bug viene corretto, tutti i mittenti ne saranno informati. (Si noti, tuttavia, che i messaggi di posta elettronica inviati al mittente di un solo bug non saranno automaticamente inviati al mittente dell'altra segnalazione.) Per maggiori dettagli sui tecnicismi del comando merge e simili, il comando unmerge, si consulti la documentazione del server di controllo BTS.
