Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: Since Debian has an open development model (i.e., everyone can participate and follow the development) even the <literal>unstable</literal> and <literal> testing</literal> distributions are distributed to the Internet through the Debian FTP and HTTP server network. Thus, if we had called the directory which contains the release candidate version <literal>testing</literal>, then we would have to rename it to <literal>stable</literal> when the version is released, which would cause all FTP mirrors to re-retrieve the whole distribution (which is quite large).
it: Dal momento che Debian ha un modello di sviluppo aperto (vale a dire, tutti possono partecipare e seguire lo sviluppo) anche le distribuzioni <literal>unstable</literal> e <literal>testing</literal> sono distribuite su Internet attraverso la rete Debian dei server FTP e HTTP. Così, se avessimo chiamato la cartella che contiene la versione candidata al rilascio <literal>testing</literal>, allora avremmo dovuto rinominarla <literal>stable</literal> quando la versione viene rilasciata, che obbligherebbe tutti i mirror FTP a ri-recuperare l'intera distribuzione (che è piuttosto grande).

source: On the other hand, if we called the distribution directories <literal>Debian-x.y</literal> from the beginning, people would think that Debian release <literal>x.y</literal> is available. (This happened in the past, where a CD-ROM vendor built a Debian 1.0 CD-ROM based on a pre-1.0 development version. That's the reason why the first official Debian release was 1.1, and not 1.0.)
it: D'altra parte, se avessimo chiamato dal principio le cartelle di distribuzione <literal>Debian-x.y</literal>, la gente avrebbe potuto pensare che la versione Debian <literal>x.y</literal> fosse disponibile. (Questo è successo in passato, dove un distributore di CD-ROM Debian 1.0 creò un CD-ROM basato su una versione pre-1.0 di sviluppo. Questa è la ragione per cui il primo rilascio ufficiale di Debian è stato 1.1, e non 1.0.)

source: Thus, the names of the distribution directories in the archive are determined by their code names and not their release status (e.g., `&codename-stable;'). These names stay the same during the development period and after the release; symbolic links, which can be changed easily, indicate the currently released stable distribution. That's why the real distribution directories use the <literal>code names</literal>, while symbolic links for <literal>stable</literal>, <literal>testing</literal>, and <literal>unstable</literal> point to the appropriate release directories.
it: Così, i nomi delle cartelle delle distribuzioni presenti nell'archivio sono determinati dai loro nomi in codice e non dal loro stato di rilascio (per esempio, «squeeze»). Questi nomi rimangono invariati durante il periodo di sviluppo e dopo il rilascio; i collegamenti simbolici, che possono essere modificati facilmente, indicano la distribuzione stabile attualmente rilasciata. Ecco perché le cartelle di distribuzione reali utilizzano i <literal>nomi in codice</literal>, mentre i collegamenti simbolici per <literal>stable</literal>, <literal>testing</literal> e <literal>unstable</literal> puntano alle appropriate cartelle di rilascio.

source: Debian mirrors
it: Mirror di Debian

source: The various download archives and the web site have several mirrors available in order to relieve our canonical servers from heavy load. In fact, some of the canonical servers aren't public — a first tier of mirrors balances the load instead. That way, users always access the mirrors and get used to using them, which allows Debian to better spread its bandwidth requirements over several servers and networks, and basically makes users avoid hammering on one primary location. Note that the first tier of mirrors is as up-to-date as it can be since they update when triggered from the internal sites (we call this push mirroring).
it: I vari archivi di download e il sito web hanno diversi mirror disponibili al fine di alleviare i nostri server canonici da carico pesante. In effetti, alcuni dei server canonici non sono pubblici: un primo livello di mirror bilancia, invece, il carico. In questo modo, gli utenti accedono sempre ai mirror e si abituano al loro utilizzo, che consente a Debian di gestire meglio i suoi requisiti di larghezza di banda su più server e reti, e praticamente evita agli utenti di martellare una sola posizione primaria. Si noti che il primo strato di mirror è sempre aggiornato per quanto possibile dal momento che si aggiorna quando innescato dai siti interni (ciò viene detto «push mirroring»).

source: All the information on Debian mirrors, including a list of the available public FTP/HTTP servers, can be found at <ulink url="&url-debian-mirrors;"></ulink>. This useful page also includes information and tools which can be helpful if you are interested in setting up your own mirror, either for internal or public access.
it: Tutte le informazioni sui mirror Debian, tra cui un elenco di server pubblici FTP/HTTP disponibili, possono essere trovate su <ulink url="&url-debian-mirrors;"></ulink>. Questa utile pagina contiene anche informazioni e strumenti che possono essere utili se si è interessati a realizzare il proprio mirror, sia per l'accesso interno che pubblico.

source: Note that mirrors are generally run by third-parties who are interested in helping Debian. As such, developers generally do not have accounts on these machines.
it: Si noti che i mirror sono generalmente gestiti da terzi che sono interessati ad aiutare Debian. Pertanto, gli sviluppatori in genere non hanno account su queste macchine.

source: The Incoming system
it: Il sistema Incoming

source: The Incoming system is responsible for collecting updated packages and installing them in the Debian archive. It consists of a set of directories and scripts that are installed on <literal>&ftp-master-host;</literal>.
it: Il sistema Incoming è responsabile della raccolta dei pacchetti aggiornati e li installa nell'archivio Debian. Si compone di un insieme di cartelle e script che vengono installati su <literal>&ftp-master-host;</literal>.

source: Packages are uploaded by all the maintainers into a directory called <filename>UploadQueue</filename>. This directory is scanned every few minutes by a daemon called <command>queued</command>, <filename>*.command</filename>-files are executed, and remaining and correctly signed <filename>*.changes</filename>-files are moved together with their corresponding files to the <filename>unchecked</filename> directory. This directory is not visible for most Developers, as ftp-master is restricted; it is scanned every 15 minutes by the <command>dak process-upload</command> script, which verifies the integrity of the uploaded packages and their cryptographic signatures. If the package is considered ready to be installed, it is moved into the <filename>done</filename> directory. If this is the first upload of the package (or it has new binary packages), it is moved to the <filename>new</filename> directory, where it waits for approval by the ftpmasters. If the package contains files to be installed by hand it is moved to the <filename>byhand</filename> directory, where it waits for manual installation by the ftpmasters. Otherwise, if any error has been detected, the package is refused and is moved to the <filename>reject</filename> directory.
it: I pacchetti sono caricati da tutti i maintainer in una cartella denominata <filename>UploadQueue</filename>. Questa cartella viene analizzata ogni pochi minuti da un demone chiamato <command>queued</command>, vengono eseguiti file <filename> *.command</filename> e i file <filename> *.changes</filename> restanti e correttamente firmati vengono spostati insieme ai loro file corrispondenti nella directory <filename>unchecked</filename>. Questa cartella non è visibile alla maggior parte degli sviluppatori, dato che ftp-master è riservato; ma viene sottoposta a scansione ogni 15 minuti dallo script <command>dak process-upload</command>, che verifica l'integrità dei pacchetti caricati e le loro firme crittografiche. Se il pacchetto è considerato pronto per essere installato, viene spostato nella cartella <filename>done</filename>. Se questo è il primo caricamento del pacchetto (o ha nuovi pacchetti binari), viene spostato nella cartella <filename>new</filename>, dove attende l'approvazione da parte degli ftpmaster. Se il pacchetto contiene file da installare a mano viene spostato nella cartella <filename>byhand</filename>, dove attende l'installazione manuale degli ftpmasters. Altrimenti, se è stato rilevato qualche errore, il pacchetto viene rifiutato e viene spostato nella cartella <filename>reject</filename>.

source: Once the package is accepted, the system sends a confirmation mail to the maintainer and closes all the bugs marked as fixed by the upload, and the auto-builders may start recompiling it. The package is now publicly accessible at <ulink url="&url-incoming;"></ulink> until it is really installed in the Debian archive. This happens four times a day (and is also called the `dinstall run' for historical reasons); the package is then removed from incoming and installed in the pool along with all the other packages. Once all the other updates (generating new <filename>Packages</filename> and <filename>Sources</filename> index files for example) have been made, a special script is called to ask all the primary mirrors to update themselves.
it: Una volta che il pacchetto viene accettato, il sistema invia una email di conferma al maintainer e chiude tutti i bug marcati come corretti dal caricamento, e gli auto-builder possono iniziare a ricompilarlo. Il pacchetto è ora accessibile al pubblico presso <ulink url="&url-incoming;"></ulink> fino a quando non sarà realmente installato nell'archivio Debian. Questo accade quattro volte al giorno (ed è chiamata anche la «dinstall run» per ragioni storiche), il pacchetto viene quindi rimosso da incoming ed installato nel pool insieme a tutti gli altri pacchetti. Una volta che tutti gli altri aggiornamenti (che generano i nuovi file di indice <filename>Packages</filename> e <filename>Sources</filename> per esempio) sono stati apportati, uno speciale script è chiamato per chiedere a tutti i mirror primari di aggiornarsi.

source: The archive maintenance software will also send the OpenPGP/GnuPG signed <filename>.changes</filename> file that you uploaded to the appropriate mailing lists. If a package is released with the <literal>Distribution</literal> set to <literal>stable</literal>, the announcement is sent to &email-debian-changes;. If a package is released with <literal>Distribution</literal> set to <literal>unstable</literal> or <literal>experimental</literal>, the announcement will be posted to &email-debian-devel-changes; or &email-debian-experimental-changes; instead.
it: Il software di manutenzione dell'archivio invierà anche il file <filename>.changes</filename> firmato con OpenPGP/GnuPG che si è inviato alle mailing list appropriate. Se un pacchetto è rilasciato con il campo <literal>Distribution</literal> impostato su <literal>stable</literal>, l'annuncio viene inviato a &email-debian-changes;. Se un pacchetto è rilasciato con il campo <literal>Distribution</literal> impostato a <literal>unstable</literal> o <literal>experimental</literal>, l'annuncio verrà pubblicato invece su &email-debian-devel-changes;.

source: Though ftp-master is restricted, a copy of the installation is available to all developers on <literal>&ftp-master-mirror;</literal>.
it: Anche se ftp-master è riservato, una copia dell'installazione è disponibile per tutti gli sviluppatori su <literal>&ftp-master-mirror;</literal>.

source: Package information
it: Informazioni sul pacchetto

source: On the web
it: Sul web

source: Each package has several dedicated web pages. <literal>https://&packages-host;/<replaceable>package-name</replaceable></literal> displays each version of the package available in the various distributions. Each version links to a page which provides information, including the package description, the dependencies, and package download links.
it: Ogni pacchetto ha diverse pagine web dedicate. <literal>http://&packages-host;/<replaceable>nome-pachetto</replaceable></literal> visualizza ogni versione del pacchetto disponibile nelle varie distribuzioni. Ogni versione punta ad una pagina che fornisce informazioni, compresa la descrizione del pacchetto, le dipendenze, e i collegamenti per il suo scaricamento.

source: The bug tracking system tracks bugs for each package. You can view the bugs of a given package at the URL <literal>https://&bugs-host;/<replaceable>package-name</replaceable></literal>.
it: Il sistema di tracciamento dei bug mantiene traccia dei bug di ogni pacchetto. È possibile visualizzare i bug di un determinato pacchetto all'URL <literal>http://&bugs-host;/<replaceable>nome-pacchetto</replaceable></literal>.

source: The <command>dak ls</command> utility
it: L'utility <command>dak ls</command>

source: <command>dak ls</command> is part of the dak suite of tools, listing available package versions for all known distributions and architectures. The <command>dak</command> tool is available on <literal>&ftp-master-host;</literal>, and on the mirror on <literal>&ftp-master-mirror;</literal>. It uses a single argument corresponding to a package name. An example will explain it better:
it: <command>dak ls</command> è parte della suite di strumenti di dak, ed elenca le versioni dei pacchetti disponibili per tutte le distribuzioni e le architetture conosciute. Lo strumento <command>dak</command> è disponibile su <literal>&ftp-master-host;</literal>, e sul mirror <literal>&ftp-master-mirror;</literal>. Esso utilizza un singolo argomento corrispondente a un nome di un pacchetto. Un esempio servirà a chiarire meglio:

source: In this example, you can see that the version in <literal>unstable</literal> differs from the version in <literal>testing</literal> and that there has been a binary-only NMU of the package for all architectures. Each version of the package has been recompiled on all architectures.
it: In questo esempio, si può vedere che la versione in <literal>unstable</literal> differisce da quella in <literal>testing</literal> e che c'è stato un NMU solo binario del pacchetto per tutte le architetture. Ciascuna versione del pacchetto è stata ricompilata su tutte le architetture.

source: The Debian Package Tracker
it: L'archivio Debian

source: The Debian Package Tracker is an email and web-based tool to track the activity of a source package. You can get the same emails that the package maintainer gets, simply by subscribing to the package in the Debian Package Tracker.
it: Il Package Tracking System (PTS) è uno strumento basato sulla posta elettronica per monitorare l'attività di un pacchetto sorgente. Questo vuol dire che è possibile ottenere gli stessi messaggi di posta elettronica che riceve il maintainer del pacchetto, semplicemente iscrivendosi al pacchetto nel PTS.

source: Each email sent through the package tracker is classified under one of the keywords listed below. This will let you select the mails that you want to receive.
it: Ogni email inviata attraverso il PTS è classificata, secondo una delle parole chiave sotto elencate. Questo permetterà di selezionare i messaggi che si desidera ricevere.

source: By default you will get:
it: Per impostazione predefinita si otterrà:

source: All the bug reports and following discussions.
it: Tutte le segnalazioni di bug e le successive discussioni.

source: The email notifications from <email>control@&bugs-host;</email> about bug report status changes.
it: Le notifiche email da <email>control@&bugs-host;</email> sui cambiamenti di stato delle segnalazioni di bug.

source: The email notification from <command>dak</command> when an uploaded source package is accepted.
it: La notifica email da <command>dak</command>, quando un pacchetto sorgente caricato è accettato.

source: <literal>archive</literal>
it: <literal>cvs</literal>

source: Other warning and error emails from <command>dak</command> (such as an override disparity for the section and/or the priority field). Also includes notifications of package removals.
it: Altri avvertimenti e messaggi di errore da <command>dak</command> (ad esempio una disparità di override per il campo section e/o il campo priority).

source: <literal>build</literal>
it: <literal>buildd</literal>

source: Build failures notifications sent by the network of build daemons, they contain a pointer to the build logs for analysis.
it: Le notifiche di errori di compilazione inviate dalla rete dei demoni di compilazione, contengono un riferimento ai log di compilazione per l'analisi.

source: Any non-recognized email sent to the package tracker through <literal>dispatch+<replaceable>sourcepackage</replaceable>@&tracker-host;</literal>. In order to prevent spam, all messages sent to these addresses must contain the <literal>X-Distro-Tracker-Approved</literal> header with a non-empty value.
it: Qualsiasi email non automatica inviata al PTS da persone che volevano contattare coloro che sono iscritti al pacchetto. Questo può essere fatto mediante l'invio di email a <literal><replaceable>pacchettosorgente</replaceable>@&pts-host;</literal>. Per evitare lo spam, tutti i messaggi inviati a questi indirizzi devono contenere l'intestazione <literal> X-PTS-Approved</literal> con un valore non vuoto.

source: Mails sent to the maintainer through the *@packages.debian.org email aliases.
it: Le email inviate al maintainer attraverso gli alias di posta elettronica *@packages.debian.org.

source: Regular summary emails about the package's status, including progression into <literal>testing</literal>. Ideally it should also include notifications of new upstream versions, and a notification if the package is orphaned (but this is not yet the case).
it: Email periodiche di riepilogo sullo stato del pacchetto, compreso l'avanzamento in <literal>testing</literal>, notifiche del <ulink url="&url-dehs;">DEHS</ulink> su nuove versioni originali, e una notifica se il pacchetto viene rimosso o diventa orfano.

source: You can also decide to receive additional information:
it: Si può anche decidere di ricevere informazioni supplementari:

source: The email notification from <command>dak</command> when an uploaded binary package is accepted. In other words, whenever a build daemon or a porter uploads your package for another architecture, you can get an email to track how your package gets recompiled for all architectures.
it: L'email di notifica da <command>katie</command>, quando un pacchetto binario caricato è accettato. In altre parole, ogni volta che un demone di compilazione o un autore di port carica il vostro pacchetto per un'altra architettura, è possibile ottenere una email per monitorare come il proprio pacchetto viene ricompilato per tutte le architetture.

source: <literal>vcs</literal>
it: <literal>cvs</literal>

source: VCS commit notifications, if the package has a VCS repository and the maintainer has set up forwarding of commit notifications to the package tracker.
it: Le notifiche di commit di VCS, se il pacchetto ha un repository VCS e il maintainer ha impostato l'inoltro di notifiche di commit sul PTS. Il nome «cvs» è storico, nella maggior parte dei casi le notifiche di commit verranno da altri VCS come Subversion o Git.

source: <literal>translation</literal>
it: <literal>bts</literal>

source: Translations of descriptions or debconf templates submitted to the Debian Description Translation Project.
it: Le traduzioni delle descrizioni o i modelli debconf presentati al Debian Description Translation Project.

source: Information about changes made to the package in derivative distributions (for example Ubuntu).
it: Le informazioni sulle modifiche fatte al pacchetto nelle distribuzioni derivate (per esempio Ubuntu).

source: Bugs reports and comments from derivative distributions (for example Ubuntu).
it: Le segnalazioni di bug e i commenti da distribuzioni derivate (ad esempio Ubuntu).

source: The package tracker email interface
it: L'interfaccia email del PTS

source: You can control your subscription(s) to the package tracker by sending various commands to <email>control@tracker.debian.org</email>.
it: È possibile controllare le proprie sottoscrizioni al PTS inviando vari comandi a <email>pts@qa.debian.org</email>.

source: <literal>subscribe &lt;sourcepackage&gt; [&lt;email&gt;]</literal>
it: <literal>subscribe &lt;pacchettosorgente&gt; [&lt;email&gt;]</literal>

source: Subscribes <replaceable>email</replaceable> to communications related to the source package <replaceable>sourcepackage</replaceable>. Sender address is used if the second argument is not present. If <replaceable>sourcepackage</replaceable> is not a valid source package, you'll get a warning. However if it's a valid binary package, the package tracker will subscribe you to the corresponding source package.
it: Si sottoscriva <replaceable>email</replaceable> per comunicazioni inerenti il pacchetto dei sorgenti di <replaceable>sourcepackage</replaceable>. L'indirizzo del mittente è utilizzato se il secondo argomento non è presente. Se <replaceable>sourcepackage</replaceable> non è un valido pacchetto di sorgenti, si riverà un avvertimento. Tuttavia, se è un valido pacchetto binario, il tracker del pacchetto iscriverà al corrispondente pacchetto sorgente.

source: Removes a previous subscription to the source package <replaceable>sourcepackage</replaceable> using the specified email address or the sender address if the second argument is left out.
it: Rimuove una sottoscrizione precedente al pacchetto sorgente <replaceable>pacchettosorgente</replaceable> utilizzando l'indirizzo di posta elettronica specificato o l'indirizzo del mittente se il secondo argomento è stato lasciato vuoto.

source: Removes all subscriptions of the specified email address or the sender address if the second argument is left out.
it: Rimuove tutte le sottoscrizioni dell'indirizzo di posta elettronica specificato o l'indirizzo del mittente, se il secondo argomento è lasciato vuoto.

source: Lists all subscriptions for the sender or the email address optionally specified.
it: Elenca tutte le sottoscrizioni per il mittente o per l'indirizzo di posta elettronica eventualmente specificato.

source: Tells you the keywords that you are accepting. For an explanation of keywords, <link linkend="pkg-tracker">see above</link>.
it: Indica le parole chiave che si stanno accettando. Per una loro spiegazione, <link linkend="pkg-tracker">si veda sopra</link>. Ecco un breve riassunto:

source: <literal>keyword &lt;sourcepackage&gt; [&lt;email&gt;]</literal>
it: <literal>keyword &lt;pacchetto sorgente&gt; [&lt;email&gt;]</literal>

source: Same as the previous item but for the given source package, since you may select a different set of keywords for each source package.
it: Come la voce precedente ma per il dato pacchetto sorgente, dal momento che è possibile selezionare un diverso insieme di parole chiave per ogni pacchetto sorgente.

source: <literal>keyword [&lt;email&gt;] {+|-|=} &lt;list of keywords&gt;</literal>
it: <literal>keyword [&lt;email&gt;] {+|-|=} &lt;elenco di parole chiave&gt;</literal>

source: Accept (+) or refuse (-) mails classified under the given keyword(s). Define the list (=) of accepted keywords. This changes the default set of keywords accepted by a user.
it: Accetta (+) o rifiuta (-) email classificate sotto le parole chiave. Definisce l'elenco (=) delle parole chiave accettate. Ciò cambia l'insieme predefinito di parole chiave accettate da un utente.
