Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: An effort to translate the package descriptions started long ago, even if very little support is offered by the tools to actually use them (i.e., only APT can use them, when configured correctly). Maintainers don't need to do anything special to support translated package descriptions; translators should use the <ulink url="&url-ddtp;">Debian Description Translation Project (DDTP)</ulink>.
it: Uno sforzo per tradurre le descrizioni dei pacchetti è iniziato molto tempo fa, anche se molto poco sostegno è offerto dagli strumenti che effettivamente li utilizzano (cioè, solo APT possono usare, se configurato correttamente). I maintainer non hanno bisogno di fare nulla di speciale per supportare le descrizioni dei pacchetti tradotti; i traduttori devono usare il <ulink url="&url-ddtp;">Debian Description Translation Project (DDTP)</ulink>.

source: For <systemitem role="package">debconf</systemitem> templates, maintainers should use the <systemitem role="package">po-debconf</systemitem> package to ease the work of translators, who could use the DDTP to do their work (but the French and Brazilian teams don't). Some statistics can be found both on the <ulink url="&url-ddtp;">DDTP site</ulink> (about what is actually translated), and on the <ulink url="&url-l10n;">Central Debian translation statistics</ulink> site (about what is integrated in the packages).
it: Per i modelli <systemitem role="package">debconf</systemitem>, i maintainer dovrebbero utilizzare il pacchetto <systemitem role="package">po-debconf</systemitem> per facilitare il lavoro dei traduttori, che potrebbero usare il DDTP per fare il loro lavoro (ma i team francesi e brasiliani non lo usano). Alcune statistiche possono essere trovate sia sul <ulink url="&url-ddtp;">sito del DDTP</ulink> (su ciò che è stato effettivamente tradotto) e sul sito <ulink url="&url-l10n;">Central Debian translation statistics</ulink> (su ciò che è integrato nei pacchetti).

source: For web pages, each l10n team has access to the relevant VCS, and the statistics are available from the Central Debian translation statistics site.
it: Per le pagine web, ogni squadra l10n ha accesso alle VCS rilevanti, e sono disponibili presso il sito Central Debian translation statistics.

source: For general documentation about Debian, the process is more or less the same as for the web pages (the translators have access to the VCS), but there are no statistics pages.
it: Per la documentazione di carattere generale su Debian, il processo è più o meno lo stesso che per le pagine web (i traduttori hanno accesso al VCS), ma non ci sono pagine di statistiche.

source: For package-specific documentation (man pages, info documents, other formats), almost everything remains to be done.
it: Per la documentazione di un pacchetto specifico (pagine man, documenti info, altri formati), quasi tutto resta da fare.

source: Most notably, the KDE project handles translation of its documentation in the same way as its program messages.
it: Più in particolare, il progetto KDE gestisce la traduzione della sua documentazione nello stesso modo dei suoi messaggi del programma.

source: There is an effort to handle Debian-specific man pages within a <ulink url="&url-cvsweb;manpages/?cvsroot=debian-doc">specific VCS repository</ulink>.
it: C'è uno sforzo per gestire le pagine di manuale specifici di Debian all'interno di uno <ulink url="&url-cvsweb;manpages/?cvsroot=debian-doc">specifico repository VCS</ulink>.

source: I18N &amp; L10N FAQ for maintainers
it: I18N e L10N FAQ per i maintainer

source: This is a list of problems that maintainers may face concerning i18n and l10n. While reading this, keep in mind that there is no real consensus on these points within Debian, and that this is only advice. If you have a better idea for a given problem, or if you disagree on some points, feel free to provide your feedback, so that this document can be enhanced.
it: Questa è un elenco di problemi che i maintainer potrebbero dover affrontare in materia di i18n e l10n. Durante la lettura di questo documento, tenere presente che non esiste un vero consenso su questi punti all'interno di Debian e che questo è solo un consiglio. Se si ha un'idea migliore per un dato problema, o se si è in disaccordo su alcuni punti, non esitare a fornire il proprio feedback, in modo che questo documento possa essere migliorato.

source: How to get a given text translated
it: Come ottenere un certo testo tradotto

source: To translate package descriptions or <systemitem role="package">debconf</systemitem> templates, you have nothing to do; the DDTP infrastructure will dispatch the material to translate to volunteers with no need for interaction from your part.
it: Per tradurre le descrizioni dei pacchetti o di modelli <systemitem role="package">debconf</systemitem>, non dovete fare niente, l'infrastruttura DDTP invierà il materiale da tradurre ai volontari senza necessità di interazione da parte vostra.

source: For all other material (gettext files, man pages, or other documentation), the best solution is to put your text somewhere on the Internet, and ask on debian-i18n for a translation in different languages. Some translation team members are subscribed to this list, and they will take care of the translation and of the reviewing process. Once they are done, you will get your translated document from them in your mailbox.
it: Per tutti gli altri materiali (file gettext, pagine man, o altra documentazione), la soluzione migliore è quella di mettere il testo da qualche parte su Internet e chiedere su debian-i18n una traduzione in diverse lingue. Alcuni membri del team di traduzione sono iscritti a questa lista e si prenderanno cura della traduzione e del processo di revisione. Una volta finito, si avrà il proprio documento tradotto da loro nella vostra casella di posta.

source: How to get a given translation reviewed
it: Come ottenere una revisione di una data traduzione

source: From time to time, individuals translate some texts in your package and will ask you for inclusion of the translation in the package. This can become problematic if you are not fluent in the given language. It is a good idea to send the document to the corresponding l10n mailing list, asking for a review. Once it has been done, you should feel more confident in the quality of the translation, and feel safe to include it in your package.
it: Di volta in volta, gli individui traducono alcuni testi nel proprio pacchetto e vi chiederanno l'inserimento della traduzione nel pacchetto. Questo può diventare un problema se non si parla correntemente la lingua data. È una buona idea inviare il documento alla mailing list l10n corrispondente, chiedendo una revisione. Una volta che è stata fatta, ci si dovrebbe sentire più sicuri della qualità della traduzione e sentirsi sicuri da includerla nel proprio pacchetto.

source: How to get a given translation updated
it: Come ottenere una data traduzione aggiornata

source: If you have some translations of a given text lying around, each time you update the original, you should ask the previous translator to update the translation with your new changes. Keep in mind that this task takes time; at least one week to get the update reviewed and all.
it: Se si dispone di alcune traduzioni di un dato testo in giro, ogni volta che si aggiorna l'originale, si dovrebbe chiedere al traduttore precedente di aggiornare la traduzione con le nuove modifiche. Tenete a mente che questo compito richiede tempo, almeno una settimana per ottenere l'aggiornamento revisionato e tutto il resto.

source: If the translator is unresponsive, you may ask for help on the corresponding l10n mailing list. If everything fails, don't forget to put a warning in the translated document, stating that the translation is somehow outdated, and that the reader should refer to the original document if possible.
it: Se il traduttore non risponde, si può chiedere aiuto sulla mailing list l10n corrispondente. Se tutto fallisce, non dimenticare di mettere un avviso nel documento tradotto, affermando che la traduzione è in qualche modo obsoleta e che il lettore dovrebbe fare riferimento al documento originale, se possibile.

source: Avoid removing a translation completely because it is outdated. Old documentation is often better than no documentation at all for non-English speakers.
it: Evitare di rimuovere una traduzione del tutto perché è obsoleta. La vecchia documentazione è spesso migliore di nessuna documentazione per chi non parla inglese.

source: How to handle a bug report concerning a translation
it: Come gestire una segnalazione di bug riguardante una traduzione

source: The best solution may be to mark the bug as forwarded to upstream, and forward it to both the previous translator and their team (using the corresponding debian-l10n-XXX mailing list).
it: La soluzione migliore potrebbe essere quella di marcare il bug come trasmesso al maintainer originale e trasmetterlo sia al traduttore precedente e alla loro squadra (utilizzando la mailing list debian-l10n-XXX corrispondente).

source: I18N &amp; L10N FAQ for translators
it: I18N &amp; L10N FAQ per traduttori

source: While reading this, please keep in mind that there is no general procedure within Debian concerning these points, and that in any case, you should collaborate with your team and the package maintainer.
it: Durante la lettura di questo documento, si tenga presente che non esiste una procedura generale all'interno di Debian relativa a questi punti, e che in ogni caso, si dovrebbe collaborare con il team e il maintainer del pacchetto.

source: How to help the translation effort
it: Come aiutare lo sforzo di traduzione

source: Choose what you want to translate, make sure that nobody is already working on it (using your debian-l10n-XXX mailing list), translate it, get it reviewed by other native speakers on your l10n mailing list, and provide it to the maintainer of the package (see next point).
it: Scegliere ciò che si desidera tradurre, assicurarsi che nessuno stia già lavorando su di esso (con la tua mailing list debian-l10n-XXX), tradurlo, chiedere la sua revisione da altri madrelingua sulla propria mailing list l10n e fornirlo al maintainer del pacchetto (si consulti il punto successivo).

source: How to provide a translation for inclusion in a package
it: Come fornire una traduzione per l' inclusione in un pacchetto

source: Make sure your translation is correct (asking for review on your l10n mailing list) before providing it for inclusion. It will save time for everyone, and avoid the chaos resulting in having several versions of the same document in bug reports.
it: Assicurarsi che la traduzione sia corretta (chiedere la revisione sulla propria mailing list l10n) prima di fornirla per l'inclusione. Ciò consentirà di risparmiare tempo a tutti e di evitare il caos conseguente all'avere diverse versioni dello stesso documento nelle segnalazioni di bug.

source: The best solution is to file a regular bug containing the translation against the package. Make sure to use the 'PATCH' tag, and to not use a severity higher than 'wishlist', since the lack of translation never prevented a program from running.
it: La soluzione migliore è quella di aprire un bug normale contenente la traduzione per il pacchetto. Assicurarsi di utilizzare il tag «PATCH» e non usare una severità maggiore di «wishlist», dal momento che la mancanza di traduzione non ha impedito al programma di funzionare.

source: Best current practice concerning l10n
it: L'attuale pratica consigliata riguardanti l'l10n

source: As a maintainer, never edit the translations in any way (even to reformat the layout) without asking on the corresponding l10n mailing list. You risk for example breaking the encoding of the file by doing so. Moreover, what you consider an error can be right (or even needed) in the given language.
it: Come maintainer, mai modificare le traduzioni in qualsiasi modo (anche di riformattare il layout), senza chiedere sulla mailing list l10n corrispondente. Si rischia ad esempio di rompere la codifica del file in questo modo. Inoltre, quello che si considera un errore può essere corretto (o addirittura necessario) nella lingua data.

source: As a translator, if you find an error in the original text, make sure to report it. Translators are often the most attentive readers of a given text, and if they don't report the errors they find, nobody will.
it: Come traduttore, se si trova un errore nel testo originale, assicurarsi di segnalarlo. I traduttori sono spesso i lettori più attenti di un dato testo, e se non segnalano gli errori che trovano, nessuno lo sarà.

source: In any case, remember that the major issue with l10n is that it requires several people to cooperate, and that it is very easy to start a flamewar about small problems because of misunderstandings. So if you have problems with your interlocutor, ask for help on the corresponding l10n mailing list, on debian-i18n, or even on debian-devel (but beware, l10n discussions very often become flamewars on that list :)
it: In ogni caso, si ricordi che il problema principale con l10n è che richiede a più persone di collaborare, e che è molto facile iniziare discussioni su piccoli problemi a causa di incomprensioni. Quindi, se si hanno problemi con il proprio interlocutore, si chieda aiuto sulla mailing list l10n corrispondente, su debian-i18n, o anche su debian-devel (ma attenzione, discussioni l10n molto spesso diventano flame su quella lista :)

source: In any case, cooperation can only be achieved with <emphasis role="strong">mutual respect</emphasis>.
it: In ogni caso, la cooperazione può essere raggiunta solo con il <emphasis role="strong">rispetto reciproco</emphasis>.

source: Applying to Become a Maintainer
it: Domanda per diventare un maintainer

source: Getting started
it: Iniziare

source: So, you've read all the documentation, you've gone through the <ulink url="&url-newmaint-guide;">Debian New Maintainers' Guide</ulink>, understand what everything in the <systemitem role="package">hello</systemitem> example package is for, and you're about to Debianize your favorite piece of software. How do you actually become a Debian developer so that your work can be incorporated into the Project?
it: Quindi, si è letta tutta la documentazione, si è passati attraverso la <ulink url="&url-newmaint-guide;">Guida per il nuovo Maintainer</ulink>, si è compreso a cosa serve tutto ciò che è presente nel pacchetto d'esempio <systemitem role="package">hello</systemitem>, e si sta per Debianizzare il proprio pezzetto preferito di software. Come si fa effettivamente a diventare uno sviluppatore Debian in modo che il proprio lavoro possa essere incorporato nel progetto?

source: Firstly, subscribe to &email-debian-devel; if you haven't already. Send the word <literal>subscribe</literal> in the <literal>Subject</literal> of an email to &email-debian-devel-req;. In case of problems, contact the list administrator at &email-listmaster;. More information on available mailing lists can be found in <xref linkend="mailing-lists"/>. &email-debian-devel-announce; is another list which is mandatory for anyone who wishes to follow Debian's development.
it: In primo luogo, iscriversi alla &email-debian-devel; se non lo si ha già fatto. Inviare la parola <literal>subscribe</literal> nell'<literal>Oggetto</literal> di una email a &email-debian-devel-req;. In caso di problemi, contattare l'amministratore della lista di posta elettronica &email-listmaster;. Maggiori informazioni sulle mailing list disponibili possono essere trovate in <xref linkend="mailing-lists"/>. &email-debian-devel-announce;, è un'altra lista, che è obbligatoria per chiunque desideri seguire lo sviluppo di Debian.

source: You should subscribe and lurk (that is, read without posting) for a bit before doing any coding, and you should post about your intentions to work on something to avoid duplicated effort.
it: È possibile iscriversi ed osservare (cioè leggere senza inviare) per un po' prima di fare qualsiasi codifica, e si dovrebbero pubblicare le proprie intenzioni di lavorare su qualcosa per evitare la duplicazione degli sforzi.

source: Another good list to subscribe to is &email-debian-mentors;. See <xref linkend="mentors"/> for details. The IRC channel <literal>#debian</literal> can also be helpful; see <xref linkend="irc-channels"/>.
it: Un'altra buona lista da sottoscrivere è &email-debian-mentors;. Si consulti <xref linkend="mentors"/> per i dettagli. Il canale IRC <literal>#debian</literal> può anche essere utile, si consulti <xref linkend="irc-channels"/>.

source: When you know how you want to contribute to &debian-formal;, you should get in contact with existing Debian maintainers who are working on similar tasks. That way, you can learn from experienced developers. For example, if you are interested in packaging existing software for Debian, you should try to get a sponsor. A sponsor will work together with you on your package and upload it to the Debian archive once they are happy with the packaging work you have done. You can find a sponsor by mailing the &email-debian-mentors; mailing list, describing your package and yourself and asking for a sponsor (see <xref linkend="sponsoring"/> and <ulink url="&url-mentors;"></ulink> for more information on sponsoring). On the other hand, if you are interested in porting Debian to alternative architectures or kernels you can subscribe to port specific mailing lists and ask there how to get started. Finally, if you are interested in documentation or Quality Assurance (QA) work you can join maintainers already working on these tasks and submit patches and improvements.
it: Quando si sa come si vuole contribuire a &debian-formal;, si dovrebbe entrare in contatto con i maintainer Debian esistenti che lavorano su compiti simili. In questo modo, si può imparare da sviluppatori esperti. Per esempio, se si è interessati nella pacchettizzazione del software esistente per Debian, si dovrebbe cercare di ottenere uno sponsor. Uno sponsor lavorerà insieme sul proprio pacchetto e caricherà nell'archivio Debian una volta che sarà contento del lavoro di pacchettizzazione che si è fatto. È possibile trovare uno sponsor inviando una email alla mailing list &email-debian-mentors;, descrivendo il pacchetto e voi stessi e chiedendo uno sponsor (si veda <xref linkend="sponsoring"/> e <ulink url="&url-mentors;"></ulink> per ulteriori informazioni sulla sponsorizzazione). D'altra parte, se si è interessati al porting di Debian per architetture o kernel alternativi è possibile iscriversi a mailing list specifiche e chiedere lì come iniziare. Infine, se si è interessati alla documentazione o alla Quality Assurance (QA) ci si può unire ai maintainer che già lavorano su questi compiti e inviare patch e miglioramenti.

source: One pitfall could be a too-generic local part in your mailadress: Terms like mail, admin, root, master should be avoided, please see <ulink url="&url-debian-lists;"></ulink> for details.
it: Un trabocchetto potrebbe essere una parte locale troppo generica nella vostra mailadress: Termini come posta, admin, root, master dovrebbero essere evitati, consultare <ulink url="&url-debian-lists;"></ulink> per i dettagli.

source: Debian mentors and sponsors
it: Mentor e sponsor Debian

source: The mailing list &email-debian-mentors; has been set up for novice maintainers who seek help with initial packaging and other developer-related issues. Every new developer is invited to subscribe to that list (see <xref linkend="mailing-lists"/> for details).
it: La mailing list &email-debian-mentors; è stata istituita per i maintainer alle prime armi che cercano aiuto con l'iniziale pacchettizzazione e altri problemi legati allo sviluppo. Ogni nuovo sviluppatore è invitato a iscriversi a questa lista (si consulti <xref linkend="mailing-lists"/> per i dettagli).

source: Those who prefer one-on-one help (e.g., via private email) should also post to that list and an experienced developer will volunteer to help.
it: Coloro che preferiscono un aiuto direttamente da un'altra persona (ad esempio, attraverso email privata) dovrebbero anche pubblicare in quella lista e uno sviluppatore esperto volontariamente aiuterà.

source: In addition, if you have some packages ready for inclusion in Debian, but are waiting for your new maintainer application to go through, you might be able find a sponsor to upload your package for you. Sponsors are people who are official Debian Developers, and who are willing to criticize and upload your packages for you. Please read the debian-mentors FAQ at <ulink url="&url-mentors;"></ulink> first.
it: Inoltre, se si dispone di alcuni pacchetti pronti per l'inclusione in Debian, ma che sono in attesa che si affronti il processo per diventare un nuovo maintainer, si potrebbe trovare uno sponsor per caricare il prorio pacchetto al posto vostro. Gli sponsor sono persone che sono sviluppatori ufficiali di Debian, e che sono disposti a criticare e caricare i pacchetti per voi. Leggere prima le debian-mentors FAQ su <ulink url="&url-mentors;"></ulink>.

source: If you wish to be a mentor and/or sponsor, more information is available in <xref linkend="newmaint"/>.
it: Se volete essere un mentore e/o uno sponsor, maggiori informazioni sono disponibili in <xref linkend="newmaint"/>.

source: Registering as a Debian developer
it: Registrazione come sviluppatore Debian

source: Before you decide to register with &debian-formal;, you will need to read all the information available at the <ulink url="&url-newmaint;">New Maintainer's Corner</ulink>. It describes in detail the preparations you have to do before you can register to become a Debian developer. For example, before you apply, you have to read the <ulink url="&url-social-contract;">Debian Social Contract</ulink>. Registering as a developer means that you agree with and pledge to uphold the Debian Social Contract; it is very important that maintainers are in accord with the essential ideas behind &debian-formal;. Reading the <ulink url="&url-gnu-manifesto;">GNU Manifesto</ulink> would also be a good idea.
it: Prima di decidere di registrarsi con &debian-formal;, dovete leggere tutte le informazioni disponibili nell'<ulink url="&url-newmaint;">Angolo del nuovo maintainer</ulink>. Esso descrive nel dettaglio i preparativi che dovete fare prima di potervi registrare per diventare uno sviluppatore Debian. Ad esempio, prima di presentare la domanda, si deve leggere il <ulink url="&url-social-contract;">Debian Social Contract</ulink>. Registrarsi come sviluppatore significa che si è d'accordo e ci si impegna a sostenere il Contratto Sociale Debian, ma è molto importante che i maintainer siano in accordo con le idee essenziali che sono alla base del &debian-formal;. Leggere il <ulink url="&url-gnu-manifesto;">Manifesto GNU</ulink> sarebbe anche una buona idea.
