Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: Debian GNU/Linux 1.3 was only available as <literal>i386</literal>. Debian 2.0 shipped for <literal>i386</literal> and <literal>m68k</literal> architectures. Debian 2.1 shipped for the <literal>i386</literal>, <literal>m68k</literal>, <literal>alpha</literal>, and <literal>sparc</literal> architectures. Since then Debian has grown hugely. Debian 6 supports a total of nine Linux architectures (<literal>amd64</literal>, <literal>armel</literal>, <literal>i386</literal>, <literal>ia64</literal>, <literal>mips</literal>, <literal>mipsel</literal>, <literal>powerpc</literal>, <literal>s390</literal>, <literal>sparc</literal>) and two kFreeBSD architectures (<literal>kfreebsd-i386</literal> and <literal>kfreebsd-amd64</literal>).
it: &debian-formal; 1.3 era disponibile solo come <literal>i386</literal>. Debian 2.0 era distribuita per le architetture <literal>i386</literal> e <literal>m68k</literal>. Debian 2.1 distribuita per <literal>i386</literal>, <literal>m68k</literal>, <literal>alpha</literal>, <literal>sparc</literal>. Da allora Debian è cresciuta enormemente. Debian 6 supporta un totale di nove architetture Linux (<literal>amd64</literal>, <literal>armel</literal>, <literal>i386</literal>, <literal>ia64</literal>, <literal>mips</literal>, <literal>mipsel</literal>, <literal>powerpc</literal>, <literal>s390</literal>, <literal>sparc</literal>) e due architetture kFreeBSD (<literal>kfreebsd-i386</literal> e <literal>kfreebsd-amd64</literal>).

source: Information for developers and users about the specific ports are available at the <ulink url="&url-debian-ports;">Debian Ports web pages</ulink>.
it: Informazioni per gli sviluppatori e gli utenti su port specifici sono disponibili presso le <ulink url="&url-debian-ports;">pagine web dei Port di Debian</ulink>.

source: Packages
it: I pacchetti

source: There are two types of Debian packages, namely <literal>source</literal> and <literal>binary</literal> packages.
it: Ci sono due tipi di pacchetti Debian, e cioè pacchetti <literal>source (sorgente)</literal> e <literal>binary (binario)</literal>.

source: Depending on the format of the source package, it will consist of one or more files in addition to the mandatory <filename>.dsc</filename> file:
it: A seconda del formato del pacchetto sorgente, esso sarà composto da uno o più file in aggiunta all'obbligatorio <filename>.dsc</filename>:

source: with format “1.0”, it has either a <filename>.tar.gz</filename> file or both an <filename>.orig.tar.gz</filename> and a <filename>.diff.gz</filename> file;
it: con il formato «1.0», esso ha sia un file <filename>.tar.gz</filename> sia un file <filename>.orig.tar.gz</filename> sia un <filename>.diff.gz</filename >;

source: with format “3.0 (quilt)”, it has a mandatory <filename>.orig.tar.{gz,bz2,xz}</filename> upstream tarball, multiple optional <filename>.orig-<replaceable>component</replaceable>.tar.{gz,bz2,xz}</filename> additional upstream tarballs and a mandatory <filename>debian.tar.{gz,bz2,xz}</filename> debian tarball;
it: con il formato «3.0 (quilt)», esso ha una un archivio tar originale <filename>.orig.tar.{gz,bz2,xz}</filename> obbligatoria, diversi opzionali archivi tar <filename>.orig-<replaceable>component</replaceable>.tar.{gz,bz2,xz}</filename> originali aggiuntivi e un archivio tar debian obbligatorio <filename>debian.tar.{gz,bz2,xz}</filename>;

source: with format “3.0 (native)”, it has only a single <filename>.tar.{gz,bz2,xz}</filename> tarball.
it: con il formato «3.0 (native)», si ha solo un unico archivio tar <filename>.tar.{gz,bz2,xz}</filename>.

source: If a package is developed specially for Debian and is not distributed outside of Debian, there is just one <filename>.tar.{gz,bz2,xz}</filename> file which contains the sources of the program, it's called a “native” source package. If a package is distributed elsewhere too, the <filename>.orig.tar.{gz,bz2,xz}</filename> file stores the so-called <literal>upstream source code</literal>, that is the source code that's distributed by the <literal>upstream maintainer</literal> (often the author of the software). In this case, the <filename>.diff.gz</filename> or the <filename>debian.tar.{gz,bz2,xz}</filename> contains the changes made by the Debian maintainer.
it: Se un pacchetto è stato sviluppato appositamente per Debian e non è distribuito al di fuori di esso, c'è solo un file <filename>.tar.{gz,bz2,xz}</filename>, che contiene i sorgenti del programma, è chiamato pacchetto «nativo» dei sorgenti. Se un pacchetto viene distribuito anche altrove, il file <filename>.orig.tar.{gz,bz2,xz}</filename> contiene il cosiddetto <literal>codice sorgente originale</literal>, che è il codice sorgente che viene distribuito dal <literal>maintainer originale</literal> (spesso l'autore del software). In questo caso, il file <filename>.diff.gz</filename> o il file <filename>debian.tar.{gz,bz2,xz}</filename> contiene le modifiche apportate dal maintainer Debian.

source: The <filename>.dsc</filename> file lists all the files in the source package together with checksums (<command>md5sums</command>, <command>sha1sums</command>, <command>sha256sums</command>) and some additional info about the package (maintainer, version, etc.).
it: Il file <filename>.dsc</filename> elenca tutti i file nel pacchetto sorgente insieme ai codici di controllo (<command>md5sum</command>) e alcune ulteriori informazioni sul pacchetto (maintainer, versione, etc.).

source: Distributions
it: Le distribuzioni

source: The directory system described in the previous chapter is itself contained within <literal>distribution directories</literal>. Each distribution is actually contained in the <filename>pool</filename> directory in the top-level of the Debian archive itself.
it: Il sistema di cartelle descritto nel capitolo precedente è a sua volta contenuto all'interno delle <literal>cartelle di distribuzione</literal>. Ogni distribuzione è di fatto contenuta nella cartella <filename>pool</filename> nel livello più alto dell'archivio Debian stesso.

source: To summarize, the Debian archive has a root directory within an FTP server. For instance, at the mirror site, <literal>ftp.us.debian.org</literal>, the Debian archive itself is contained in <ulink url="ftp://ftp.us.debian.org/debian">/debian</ulink>, which is a common location (another is <filename>/pub/debian</filename>).
it: Per riassumere, l'archivio Debian ha una cartella radice all'interno di un server FTP. Ad esempio, presso il sito mirror, <literal>ftp.us.debian.org</literal>, l'archivio Debian in sé è contenuto in <ulink url="ftp://ftp.us.debian.org/debian">/debian</ulink>, che è un luogo comune (un altro è <filename>/pub/debian</filename>).

source: A distribution comprises Debian source and binary packages, and the respective <filename>Sources</filename> and <filename>Packages</filename> index files, containing the header information from all those packages. The former are kept in the <filename>pool/</filename> directory, while the latter are kept in the <filename>dists/</filename> directory of the archive (for backwards compatibility).
it: Una distribuzione comprende pacchetti binari e sorgenti Debian, e i rispettivi file indice <filename>Sources</filename> e <filename>Packages</filename>, che contengono le informazioni degli header di tutti quei pacchetti. I primi sono tenuti nella cartella <filename>pool/</filename>, mentre i secondi sono tenuti neella cartella <filename>dists/</filename> dell'archivio (per retro-compatibilità).

source: Stable, testing, and unstable
it: Stable, testing e unstable

source: There are always distributions called <literal>stable</literal> (residing in <filename>dists/stable</filename>), <literal>testing</literal> (residing in <filename>dists/testing</filename>), and <literal>unstable</literal> (residing in <filename>dists/unstable</filename>). This reflects the development process of the Debian project.
it: Ci sono sempre distribuzioni chiamate <literal>stable</literal> (residente in <filename>dists/stable</filename>), <literal>testing</literal> (residente in <filename>dists/testing</filename>) e <literal>unstable</literal> (residente in <filename>dists/unstable</filename>). Ciò riflette il processo di sviluppo del progetto Debian.

source: Active development is done in the <literal>unstable</literal> distribution (that's why this distribution is sometimes called the <literal>development distribution</literal>). Every Debian developer can update their packages in this distribution at any time. Thus, the contents of this distribution change from day to day. Since no special effort is made to make sure everything in this distribution is working properly, it is sometimes literally unstable.
it: Lo sviluppo attivo è fatto nella distribuzione <literal>unstable</literal> (è per questo che questa distribuzione è a volte chiamata <literal>distribuzione di sviluppo</literal>). Ogni sviluppatore Debian può aggiornare i propri pacchetti in questa distribuzione, in qualsiasi momento. Così, il contenuto di questa distribuzione cambia di giorno in giorno. Dal momento che non viene fatto alcun sforzo particolare per assicurarsi che tutto in questa distribuzione funzioni correttamente, a volte è letteralmente instabile.

source: The <link linkend="testing">testing</link> distribution is generated automatically by taking packages from <literal>unstable</literal> if they satisfy certain criteria. Those criteria should ensure a good quality for packages within <literal>testing</literal>. The update to <literal>testing</literal> is launched twice each day, right after the new packages have been installed. See <xref linkend="testing"/>.
it: La distribuzione <link linkend="testing">testing</link> viene generata automaticamente prendendo i pacchetti da <literal>unstable</literal> se soddisfano determinati criteri. Tali criteri dovrebbero assicurare una buona qualità per i pacchetti in <literal>testing</literal>. L'aggiornamento di <literal>testing</literal> è lanciato due volte al giorno, subito dopo che sono stati installati i nuovi pacchetti. Si consulti <xref linkend="testing"/>.

source: After a period of development, once the release manager deems fit, the <literal>testing</literal> distribution is frozen, meaning that the policies which control how packages move from <literal>unstable</literal> to <literal>testing</literal> are tightened. Packages which are too buggy are removed. No changes are allowed into <literal>testing</literal> except for bug fixes. After some time has elapsed, depending on progress, the <literal>testing</literal> distribution is frozen even further. Details of the handling of the testing distribution are published by the Release Team on debian-devel-announce. After the open issues are solved to the satisfaction of the Release Team, the distribution is released. Releasing means that <literal>testing</literal> is renamed to <literal>stable</literal>, and a new copy is created for the new <literal>testing</literal>, and the previous <literal>stable</literal> is renamed to <literal>oldstable</literal> and stays there until it is finally archived. On archiving, the contents are moved to <literal>&archive-host;</literal>.
it: Dopo un periodo di sviluppo, una volta che il responsabile del rilascio lo ritiene opportuno, la distribuzione <literal>testing</literal> è congelata, il che significa che le politiche che controllano come i pacchetti passano da <literal>unstable</literal> a <literal>testing</literal> sono rese più rigide. I pacchetti che hanno troppi bug vengono rimossi. Non sono consentite modifiche in <literal>testing</literal> tranne che per correzioni di bug. Trascorso un po' di tempo, a seconda dei progressi, la distribuzione <literal>testing</literal> è congelata ancora di più. Dettagli sulla gestione della distribuzione testing sono pubblicati dal team di rilascio su debian-devel-announce. Dopo che i problemi aperti sono stati risolti in modo soddisfacente per il team di rilascio, la distribuzione viene rilasciata. Rilasciare significa che <literal>testing</literal> viene rinominata <literal>stable</literal>, e una nuova copia viene creata per la nuova <literal>testing</literal> e la precedente <literal>stable</literal> viene rinominata <literal>oldstable</literal> e vi rimane fino a quando viene definitivamente archiviata. Una volta archiviata, i contenuti vengono spostati in <literal>&archive-host;</literal>.

source: This development cycle is based on the assumption that the <literal>unstable</literal> distribution becomes <literal>stable</literal> after passing a period of being in <literal>testing</literal>. Even once a distribution is considered stable, a few bugs inevitably remain — that's why the stable distribution is updated every now and then. However, these updates are tested very carefully and have to be introduced into the archive individually to reduce the risk of introducing new bugs. You can find proposed additions to <literal>stable</literal> in the <filename>proposed-updates</filename> directory. Those packages in <filename>proposed-updates</filename> that pass muster are periodically moved as a batch into the stable distribution and the revision level of the stable distribution is incremented (e.g., ‘6.0’ becomes ‘6.0.1’, ‘5.0.7’ becomes ‘5.0.8’, and so forth). Please refer to <link linkend="upload-stable">uploads to the <literal>stable</literal> distribution</link> for details.
it: Questo ciclo di sviluppo si basa sul presupposto che la distribuzione <literal>unstable</literal> diventa <literal>stable</literal>, dopo il superamento di un periodo in <literal>testing</literal>. Anche se una distribuzione è considerata stable, alcuni bug inevitabilmente restano: è per questo che la distribuzione stable è aggiornata ogni tanto. Tuttavia, questi aggiornamenti vengono testati molto attentamente e devono essere introdotti nell'archivio singolarmente per ridurre il rischio di introdurre nuovi bug. Si possono trovare le integrazioni proposte alla <literal>stable</literal> nella cartella <filename>proposed-updates</filename>. Questi pacchetti in <filename>proposed-updates</filename> che superano i test sono periodicamente spostati in gruppo nella distribuzione stable e il livello di revisione della distribuzione stable viene incrementato (ad esempio, «6.0» diventa «6.0.1», «5.0.7» diventa «5.0.8», e così via). Fare riferimento a <link linkend="upload-stable">caricamenti per la distribuzione <literal>stable</literal></link> per i dettagli.

source: Note that development under <literal>unstable</literal> continues during the freeze period, since the <literal>unstable</literal> distribution remains in place in parallel with <literal>testing</literal>.
it: Notare che lo sviluppo sotto <literal>unstable</literal> continua durante il periodo di congelamento, in quanto la distribuzione <literal>unstable</literal> resta in parallelo con <literal>testing</literal>.

source: More information about the testing distribution
it: Maggiori informazioni sulla distribuzione testing

source: Packages are usually installed into the <literal>testing</literal> distribution after they have undergone some degree of testing in <literal>unstable</literal>.
it: I pacchetti sono generalmente installati nella distribuzione <literal>testing</literal> dopo aver subito un periodo di prova in <literal>unstable</literal>.

source: For more details, please see the <link linkend="testing">information about the testing distribution</link>.
it: Per maggiori dettagli, consultare le informazioni <link linkend="testing">informazioni sulla distribuzione di testing</link>.

source: The <literal>experimental</literal> distribution is a special distribution. It is not a full distribution in the same sense as <literal>stable</literal>, <literal>testing</literal> and <literal>unstable</literal> are. Instead, it is meant to be a temporary staging area for highly experimental software where there's a good chance that the software could break your system, or software that's just too unstable even for the <literal>unstable</literal> distribution (but there is a reason to package it nevertheless). Users who download and install packages from <literal>experimental</literal> are expected to have been duly warned. In short, all bets are off for the <literal>experimental</literal> distribution.
it: La distribuzione <literal>experimental</literal> è una distribuzione speciale. Non è una distribuzione completa nello stesso senso di come lo sono <literal>stable</literal>, <literal>testing</literal> e <literal>unstable</literal>. Invece, essa è destinata ad essere una zona di sosta temporanea per software altamente sperimentale dove c'è una buona probabilità che il software potrebbe bloccare il sistema o un software che è semplicemente troppo instabile anche per la distribuzione <literal>unstable</literal> (ma vi è un motivo per pacchettizzarlo comunque). Gli utenti che scaricano e installano i pacchetti da <literal>experimental</literal> si presume siano stati ampiamente avvertiti. In breve, qualsiasi cosa può accadere per la distribuzione <literal>experimental</literal>.

source: These are the <citerefentry> <refentrytitle>sources.list</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> lines for <literal>experimental</literal>:
it: Queste sono le righe di <citerefentry> <refentrytitle>sources.list</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> per <literal>experimental</literal>:

source: If there is a chance that the software could do grave damage to a system, it is likely to be better to put it into <literal>experimental</literal>. For instance, an experimental compressed file system should probably go into <literal>experimental</literal>.
it: Se c'è una possibilità che il software potrebbe fare gravi danni a un sistema, è probabile che sia meglio metterlo in <literal>experimental</literal>. Per esempio, un file system compresso sperimentale dovrebbe probabilmente andare in <literal>experiemental</literal>.

source: Whenever there is a new upstream version of a package that introduces new features but breaks a lot of old ones, it should either not be uploaded, or be uploaded to <literal>experimental</literal>. A new, beta, version of some software which uses a completely different configuration can go into <literal>experimental</literal>, at the maintainer's discretion. If you are working on an incompatible or complex upgrade situation, you can also use <literal>experimental</literal> as a staging area, so that testers can get early access.
it: Ogni volta che c'è una nuova versione di un pacchetto che introduce nuove funzionalità, ma rende non funzionanti molte di quelle vecchie, non dovrebbe essere caricato, o essere caricato in <literal>experimental</literal>. Una versione beta nuova di alcuni software che utilizza una configurazione completamente diversa può andare in <literal>experimental</literal>, a discrezione del maintainer. Anche se si sta lavorando su una situazione di aggiornamento incompatibile o complessa, è possibile utilizzare <literal>exerimental</literal> come area di sosta, in modo che i tester possano iniziarci a lavorare prima.

source: Some experimental software can still go into <literal>unstable</literal>, with a few warnings in the description, but that isn't recommended because packages from <literal>unstable</literal> are expected to propagate to <literal>testing</literal> and thus to <literal>stable</literal>. You should not be afraid to use <literal>experimental</literal> since it does not cause any pain to the ftpmasters, the experimental packages are periodically removed once you upload the package in <literal>unstable</literal> with a higher version number.
it: Alcuni software sperimentali possono comunque andare in <literal>unstable</literal>, con alcune avvertenze nella descrizione, ma non è raccomandato perché i pacchetti da <literal>unstable</literal> sono destinati a passare in <literal>testing</literal> e quindi a <literal>stable</literal>. Non si deve aver paura di usare <literal>experimental</literal> dal momento che non causa alcun dolore agli ftpmaster, i pacchetti sperimentali vengono periodicamente rimossi una volta caricato il pacchetto in <literal>unstable</literal> con un numero di versione superiore.

source: New software which isn't likely to damage your system can go directly into <literal>unstable</literal>.
it: Il nuovo software che non rischia di danneggiare il sistema può andare direttamente in <literal>unstable</literal>.

source: An alternative to <literal>experimental</literal> is to use your personal web space on <literal>people.debian.org</literal>.
it: Un'alternativa a <literal>experimental</literal> è quella di utilizzare il proprio spazio web personale su <literal>people.debian.org</literal>.

source: Release code names
it: Nomi in codice dei rilasci

source: Every released Debian distribution has a <literal>code name</literal>: Debian &version-oldoldstable; is called <literal>&codename-oldoldstable;</literal>; Debian &version-oldstable;, <literal>&codename-oldstable;</literal>; Debian &version-stable;, <literal>&codename-stable;</literal>; the next release Debian &version-testing; will be called <literal>&codename-testing;</literal> and Debian &version-nexttesting; will be called <literal>&codename-nexttesting;</literal>. There is also a ``pseudo-distribution'', called <literal>sid</literal>, which is the current <literal>unstable</literal> distribution; since packages are moved from <literal>unstable</literal> to <literal>testing</literal> as they approach stability, <literal>sid</literal> itself is never released. As well as the usual contents of a Debian distribution, <literal>sid</literal> contains packages for architectures which are not yet officially supported or released by Debian. These architectures are planned to be integrated into the mainstream distribution at some future date. The codenames and versions for older releases are <ulink url="&url-releases;">listed</ulink> on the website.
it: Ogni distribuzione Debian rilasciata ha <literal>un nome in codice</literal>: Debian 1.1 è chiamata <literal>buzz</literal>, Debian 1.2, <literal>rex</literal>, Debian 1.3, <literal>bo</literal>, Debian 2.0, <literal>hamm</literal>, Debian 2.1, <literal>slink</literal>, Debian 2.2, <literal>potato</literal>, Debian 3.0, <literal>woody</literal>, Debian 3.1, <literal>sarge</literal>, Debian 4.0, <literal>etch</literal>, Debian 5.0, <literal>lenny</literal>, Debian 6.0, <literal>squeeze</literal> e la prossima versione si chiamerà <literal>wheezy</literal>. Vi è anche una «pseudo-distribuzione», chiamata <literal>sid</literal>, che è l'attuale distribuzione <literal>unstable</literal>; poiché i pacchetti vengono spostati da <literal>unstable</literal> a <literal>testing</literal> quando si avvicinano alla stabilità, <literal>sid</literal> in sé non è mai rilasciata. Oltre ai soliti contenuti di una distribuzione Debian, <literal>sid</literal> contiene i pacchetti per le architetture che non sono ancora ufficialmente supportate o rilasciate da Debian. È in progetto l'integrazione di queste architetture nella distribuzione tradizionale in una data futura.
