Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: <command>debdiff</command> (from the <systemitem role="package">devscripts</systemitem> package, <xref linkend="devscripts"/>) compares file lists and control files of two packages. It is a simple regression test, as it will help you notice if the number of binary packages has changed since the last upload, or if something has changed in the control file. Of course, some of the changes it reports will be all right, but it can help you prevent various accidents.
it: <command>debdiff</command> (dal pacchetto <systemitem role="package">devscripts</systemitem>, <xref linkend="devscripts"/>) confronta elenchi di file e file di controllo di due pacchetti. Si tratta di un test di regressione semplice, in quanto aiuterà a notare se il numero di pacchetti binari è cambiato dall'ultima operazione di caricamento, o se qualcosa è cambiato nel file di controllo. Naturalmente, alcune delle modifiche che segnalerà saranno a posto, ma può aiutare a prevenire vari incidenti.

source: You can run it over a pair of binary packages:
it: È possibile eseguirlo su un paio di pacchetti binari:

source: debdiff package_1-1_arch.deb package_2-1_arch.deb
it: debdiff pacchetto_1-1_arch.deb package_2-1_arch.deb

source: Or even a pair of changes files:
it: O anche su un paio di file di modifiche:

source: debdiff package_1-1_arch.changes package_2-1_arch.changes
it: debdiff pacchetto_1-1_arch.changes package_2-1_arch.changes

source: For more information please see <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
it: Per ulteriori informazioni consultare <citerefentry><refentrytitle>debdiff</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: Helpers for <filename>debian/rules</filename>
it: Strumenti ausiliari per <filename>debian/rules</filename>

source: Package building tools make the process of writing <filename>debian/rules</filename> files easier. See <xref linkend="helper-scripts"/> for more information about why these might or might not be desired.
it: Gli strumenti per la compilazione dei pacchetti rendono il processo di scrittura dei file <filename>debian/rules</filename> più facile. Per ulteriori informazioni sul motivo per cui questi potrebbero o non potrebbero essere desiderati si consulti <xref linkend="helper-scripts"/>.

source: <systemitem role="package">debhelper</systemitem> is a collection of programs which can be used in <filename>debian/rules</filename> to automate common tasks related to building binary Debian packages. <systemitem role="package">debhelper</systemitem> includes programs to install various files into your package, compress files, fix file permissions, and integrate your package with the Debian menu system.
it: <systemitem role="package">debhelper</systemitem> è una raccolta di programmi che possono essere utilizzati in <filename>debian/rules</filename> per automatizzare compiti comuni correlati con la compilazione di pacchetti Debian binari. <systemitem role="package">debhelper</systemitem> include programmi per installare vari file all'interno del pacchetto, comprimere i file, correggere i permessi dei file e integrare il pacchetto nel sistema dei menù Debian.

source: Unlike some approaches, <systemitem role="package">debhelper</systemitem> is broken into several small, simple commands which act in a consistent manner. As such, it allows more fine-grained control than some of the other debian/rules tools.
it: A differenza di altri approcci, <systemitem role="package">debhelper</systemitem> è suddiviso in diversi piccoli, semplici comandi che agiscono in modo coerente. Come tale, esso permette un controllo più capillare di alcuni degli altri strumenti per debian/rules.

source: There are a number of little <systemitem role="package">debhelper</systemitem> add-on packages, too transient to document. You can see the list of most of them by doing <literal>apt-cache search ^dh-</literal>.
it: Ci sono una serie di piccoli pacchetti aggiuntivi per <systemitem role="package">debhelper</systemitem>, troppo effimeri da documentare. È possibile vedere l'elenco della maggior parte di loro invocando <literal>apt-cache search ^dh-</literal>.

source: The <systemitem role="package">dh-make</systemitem> package contains <command>dh_make</command>, a program that creates a skeleton of files necessary to build a Debian package out of a source tree. As the name suggests, <command>dh_make</command> is a rewrite of <systemitem role="package">debmake</systemitem> and its template files use <command>dh_*</command> programs from <systemitem role="package">debhelper</systemitem>.
it: Il pacchetto <systemitem role="package">dh-make</systemitem> contiene <command>dh_make</command>, un programma che crea uno scheletro di file necessari per compilare un pacchetto Debian a partire da un albero sorgente. Come suggerisce il nome, <command>dh_make</command> è una riscrittura di <systemitem role="package">debmake</systemitem> ed i relativi file di template usano i programmi <command>dh_*</command> da <systemitem role="package">debhelper</systemitem>.

source: While the rules files generated by <command>dh_make</command> are in general a sufficient basis for a working package, they are still just the groundwork: the burden still lies on the maintainer to finely tune the generated files and make the package entirely functional and Policy-compliant.
it: Mentre i file di rules generati da <command>dh_make</command> sono, in generale, una base sufficiente per un pacchetto funzionante, sono ancora solo le basi: il maintainer ha ancora l'onere per sintonizzare con precisione i file generati e rendere il pacchetto completamente funzionante e conforme alla Policy.

source: <systemitem role="package">equivs</systemitem> is another package for making packages. It is often suggested for local use if you need to make a package simply to fulfill dependencies. It is also sometimes used when making ``meta-packages'', which are packages whose only purpose is to depend on other packages.
it: <systemitem role="package">equivs</systemitem> è un altro pacchetto per fare i pacchetti. È spesso suggerito per uso locale, se si ha bisogno di creare un pacchetto semplicemente per soddisfare le dipendenze. A volte è anche utilizzato quando si costruiscono «meta-pacchetti», che sono pacchetti il cui unico scopo è quello di dipendere da altri pacchetti.

source: Package builders
it: Strumenti di compilazione

source: The following packages help with the package building process, general driving <command>dpkg-buildpackage</command> as well as handling supporting tasks.
it: I seguenti pacchetti aiutano con il processo di compilazione del pacchetto, pilotando dpkg-buildpackage così come gestendo i compiti di supporto.

source: <systemitem role="package">git-buildpackage</systemitem> provides the capability to inject or import Debian source packages into a Git repository, build a Debian package from the Git repository, and helps in integrating upstream changes into the repository.
it: <systemitem role="package">git-buildpackage</systemitem> fornisce la capacità di iniettare o importare pacchetti sorgenti Debian in un repository GIT, di compilare un pacchetto Debian dal repository GIT, ed aiuta a integrare i cambiamenti del codice originale nel repository.

source: These utilities provide an infrastructure to facilitate the use of Git by Debian maintainers. This allows one to keep separate Git branches of a package for <literal>stable</literal>, <literal>unstable</literal> and possibly <literal>experimental</literal> distributions, along with the other benefits of a version control system.
it: Queste utilità forniscono un'infrastruttura per facilitare l'uso del GIT da parte del maintainer Debian. Questo permette di mantenere in GIT rami separati di un pacchetto per le distribuzioni <literal>stable</literal>, <literal>unstable</literal> e possibilmente <literal>experimental</literal>, con gli altri benefici di un sistema di controllo di versioni.

source: The <systemitem role="package">debootstrap</systemitem> package and script allows you to bootstrap a Debian base system into any part of your filesystem. By base system, we mean the bare minimum of packages required to operate and install the rest of the system.
it: Il pacchetto e lo script <systemitem role="package">debootstrap</systemitem> permettono di avviare un sistema Debian di base in qualsiasi parte del proprio filesystem. Per sistema di base, si intende il minimo dei pacchetti necessari al funzionamento e ad installare il resto del sistema.

source: Having a system like this can be useful in many ways. For instance, you can <command>chroot</command> into it if you want to test your build dependencies. Or you can test how your package behaves when installed into a bare base system. Chroot builders use this package; see below.
it: Avere un sistema come questo può essere utile in molti modi. Ad esempio, è possibile effettuare <command>chroot</command> se si vuole testare le proprie dipendenze di compilazione. Oppure si può verificare come il pacchetto si comporta quando installato in un sistema di base puro. Gli strumenti di compilazione chroot usano questo pacchetto; si veda di seguito.

source: <systemitem role="package">pbuilder</systemitem> constructs a chrooted system, and builds a package inside the chroot. It is very useful to check that a package's build-dependencies are correct, and to be sure that unnecessary and wrong build dependencies will not exist in the resulting package.
it: <systemitem role="package">pbuilder</systemitem> costruisce un sistema chroot, e compila un pacchetto all'interno del chroot. È molto utile per controllare che dipendenze di compilazione di un pacchetto siano corrette e per essere certi che dipendenze non necessarie o sbagliate non esistano nel pacchetto risultante.

source: A related package is <systemitem role="package">cowbuilder</systemitem>, which speeds up the build process using COW filesystem on any standard Linux filesystem.
it: Un pacchetto correlato è <systemitem role="package">pbuilder-uml</systemitem>, che va anche oltre, facendo la compilazione all'interno di un ambiente User Mode Linux.

source: <systemitem role="package">sbuild</systemitem> is another automated builder. It can use chrooted environments as well. It can be used stand-alone, or as part of a networked, distributed build environment. As the latter, it is part of the system used by porters to build binary packages for all the available architectures. See <xref linkend="wanna-build"/> for more information, and <ulink url="&url-buildd;"></ulink> to see the system in action.
it: <systemitem role="package">sbuild</systemitem> è un altro strumento per creazione di pacchetti automatizzato. Anch'esso può utilizzare ambienti chroot. Può essere utilizzato da solo, o come parte di un ambiente di compilazione distribuita in rete. In quest'ultimo caso, è parte del sistema utilizzato dagli autori di port per costruire pacchetti binari per tutte le architetture disponibili. Si consulti <xref linkend="wanna-build"/> per maggiori informazioni, e <ulink url="&url-buildd;"></ulink> per vedere il sistema in azione.

source: Package uploaders
it: Strumenti per caricare i pacchetti

source: The following packages help automate or simplify the process of uploading packages into the official archive.
it: I seguenti pacchetti consentono di automatizzare e semplificare il processo di caricamento dei pacchetti nell'archivio ufficiale.

source: <systemitem role="package">dupload</systemitem> is a package and a script to automatically upload Debian packages to the Debian archive, to log the upload, and to send mail about the upload of a package. You can configure it for new upload locations or methods.
it: <systemitem role="package">dupload</systemitem> è un pacchetto e uno script per caricare automaticamente i pacchetti Debian nell'archivio Debian, per registrare il caricamento, e per inviare email sul caricamento di un pacchetto. È possibile configurarlo per nuovi repository o metodi per il caricamento.

source: The <systemitem role="package">dput</systemitem> package and script does much the same thing as <systemitem role="package">dupload</systemitem>, but in a different way. It has some features over <systemitem role="package">dupload</systemitem>, such as the ability to check the GnuPG signature and checksums before uploading, and the possibility of running <command>dinstall</command> in dry-run mode after the upload.
it: Il pacchetto e lo script <systemitem role="package">dput</systemitem> fanno la stessa cosa di <systemitem role="package">dupload</systemitem>, ma in un modo diverso. Ha alcune caratteristiche in più rispetto a <systemitem role="package">dupload</systemitem>, come ad esempio la possibilità di verificare la firma GnuPG e i codici di controllo prima di caricare, e la possibilità di lanciare <command>dinstall</command> in modalità test dopo il caricamento.

source: The <command>dcut</command> script (part of the package <systemitem role="package">dput</systemitem>, <xref linkend="dput"/>) helps in removing files from the ftp upload directory.
it: Lo script <command>dcut</command> (parte del pacchetto <systemitem role="package">dput</systemitem>, <xref linkend="dput"/>) aiuta a rimuovere i file dalla cartella ftp di caricamento.

source: Maintenance automation
it: Automazione della manutenzione

source: The following tools help automate different maintenance tasks, from adding changelog entries or signature lines and looking up bugs in Emacs to making use of the newest and official <filename>config.sub</filename>.
it: I seguenti strumenti aiutano ad automatizzare diverse attività di manutenzione, ad aggiungere le voci changelog o la firma e a guardare bug in Emacs facendo uso dei più nuovi e ufficiali <filename>config.sub</filename>.

source: <systemitem role="package">devscripts</systemitem> is a package containing wrappers and tools which are very helpful for maintaining your Debian packages. Example scripts include <command>debchange</command> and <command>dch</command>, which manipulate your <filename>debian/changelog</filename> file from the command-line, and <command>debuild</command>, which is a wrapper around <command>dpkg-buildpackage</command>. The <command>bts</command> utility is also very helpful to update the state of bug reports on the command line. <command>uscan</command> can be used to watch for new upstream versions of your packages. <command>debrsign</command> can be used to remotely sign a package prior to upload, which is nice when the machine you build the package on is different from where your GPG keys are.
it: <systemitem role="package">devscripts</systemitem> è un pacchetto contenente wrapper e strumenti che sono molto utili per mantenere i pacchetti Debian. Script di esempio includono <command>debchange</command> e <command>dch</command>, che manipolano il file <filename>debian/changelog</filename> da riga di comando e <command>debuild</command>, che è un wrapper per <command>dpkg-buildpackage</command>. L'utilità <command>bts</command> è anche molto utile per aggiornare lo stato delle segnalazioni di bug da riga di comando. <command>uscan</command> può essere utilizzato per vedere nuove versioni originali fornite dei propri pacchetti. <command>debrsign</command> può essere utilizzata per firmare in remoto un pacchetto prima di caricarlo, che è bello (utile) quando la macchina con cui si genera il pacchetto è diversa da dove sono le chiavi GPG.

source: See the <citerefentry> <refentrytitle>devscripts</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> manual page for a complete list of available scripts.
it: Si consulti la pagina di manuale <citerefentry> <refentrytitle>devscripts</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> per un elenco completo degli script disponibili.

source: <systemitem role="package">autotools-dev</systemitem> contains best practices for people who maintain packages which use <command>autoconf</command> and/or <command>automake</command>. Also contains canonical <filename>config.sub</filename> and <filename>config.guess</filename> files which are known to work on all Debian ports.
it: <systemitem role="package">autotools-dev</systemitem> contiene le buone pratiche per le persone che mantengono i pacchetti e che usano <command>autoconf</command> o <command>automake</command>. Contiene anche i file canonici <filename>config.sub</filename> e <filename>config.guess</filename> che sono conosciuti per funzionare su tutti i port di Debian.

source: <command>dpkg-repack</command> creates Debian package file out of a package that has already been installed. If any changes have been made to the package while it was unpacked (e.g., files in <filename>/etc</filename> were modified), the new package will inherit the changes.
it: <command>dpkg-repack</command> crea il pacchetto Debian da un pacchetto che è già stato installato. Se sono state apportate modifiche al pacchetto mentre era spacchettato (ad esempio, i file in <filename>/etc</filename> sono stati modificati), il nuovo pacchetto erediterà le modifiche.

source: This utility can make it easy to copy packages from one computer to another, or to recreate packages which are installed on your system but no longer available elsewhere, or to save the current state of a package before you upgrade it.
it: Questa utilità può rendere più facile copiare i pacchetti da un computer ad un altro, o ricreare pacchetti che sono installati sul proprio sistema ma non più disponibili, o salvare lo stato attuale di un pacchetto prima di un aggiornamento.

source: <command>alien</command> converts binary packages between various packaging formats, including Debian, RPM (RedHat), LSB (Linux Standard Base), Solaris, and Slackware packages.
it: <command>alien</command> converte i pacchetti binari tra vari formati, tra cui Debian, RPM (RedHat), LSB (Linux Standard Base), Solaris e Slackware.

source: <systemitem role="package">dpkg-dev-el</systemitem> is an Emacs lisp package which provides assistance when editing some of the files in the <filename>debian</filename> directory of your package. For instance, there are handy functions for listing a package's current bugs, and for finalizing the latest entry in a <filename>debian/changelog</filename> file.
it: <systemitem role="package">dpkg-dev-el</systemitem> è un pacchetto Emacs che fornisce assistenza durante la modifica di alcuni file nella cartella <filename>debian</filename> del proprio pacchetto. Per esempio, ci sono utili funzioni per l'elencazione dei bug attuali di un pacchetto e per finalizzare l'ultima voce in un file <filename>debian/changelog</filename>.

source: <command>dpkg-depcheck</command> (from the <systemitem role="package">devscripts</systemitem> package, <xref linkend="devscripts"/>) runs a command under <command>strace</command> to determine all the packages that were used by the said command.
it: <command>dpkg-depcheck</command> (dal pacchetto <systemitem role="package">devscripts</systemitem>, <xref linkend="devscripts"/>) esegue un comando sotto <command>strace</command> per determinare tutti i pacchetti che sono stati da esso utilizzati.

source: For Debian packages, this is useful when you have to compose a <literal>Build-Depends</literal> line for your new package: running the build process through <command>dpkg-depcheck</command> will provide you with a good first approximation of the build-dependencies. For example:
it: Per i pacchetti Debian, questo è utile quando si deve creare una voce <literal>Build-Depends</literal> per il proprio nuovo pacchetto: l'esecuzione del processo di generazione attraverso <command>dpkg-depcheck</command> fornirà una buona prima approssimazione delle dipendenze per la compilazione. Per esempio:

source: <command>dpkg-depcheck</command> can also be used to check for run-time dependencies, especially if your package uses <citerefentry> <refentrytitle>exec</refentrytitle> <manvolnum>2</manvolnum> </citerefentry> to run other programs.
it: <command>dpkg-depcheck</command> può essere utilizzato anche per controllare le dipendenze in fase di esecuzione, soprattutto se il pacchetto usa <citerefentry> <refentrytitle>exec</refentrytitle> <manvolnum>2</manvolnum> </citerefentry> per eseguire altri programmi.

source: For more information please see <citerefentry> <refentrytitle>dpkg-depcheck</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
it: Per ulteriori informazioni consultare <citerefentry> <refentrytitle>dpkg-depcheck</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.

source: Porting tools
it: Strumenti per i port

source: The following tools are helpful for porters and for cross-compilation.
it: I seguenti strumenti sono utili per gli autori di port e per la cross-compilazione.

source: <systemitem role="package">dpkg-cross</systemitem> is a tool for installing libraries and headers for cross-compiling in a way similar to <systemitem role="package">dpkg</systemitem>. Furthermore, the functionality of <command>dpkg-buildpackage</command> and <command>dpkg-shlibdeps</command> is enhanced to support cross-compiling.
it: <systemitem role="package">dpkg-cross</systemitem> è uno strumento per installare librerie e intestazioni per cross-compilare in modo simile a <systemitem role="package">dpkg</systemitem>. Inoltre, le funzionalità di <command>dpkg-buildpackage</command> e <command>dpkg-shlibdeps</command>sono state migliorate per supportare la cross-compilazione.

source: Documentation and information
it: Documentazione ed informazioni

source: The following packages provide information for maintainers or help with building documentation.
it: I seguenti pacchetti forniscono informazioni per i maintainer o aiutano con la scrittura di documentazione.

source: <systemitem role="package">docbook-xml</systemitem> provides the DocBook XML DTDs, which are commonly used for Debian documentation (as is the older debiandoc SGML DTD). This manual, for instance, is written in DocBook XML.
it: <systemitem role="package">docbook-xml</systemitem> fornisce i DTD Docbook XML, che sono comunemente usati per la documentazione Debian (come il vecchio DTD debiandoc SGML). Questo manuale, per esempio, è stato scritto in DocBook XML.

source: The <systemitem role="package">docbook-xsl</systemitem> package provides the XSL files for building and styling the source to various output formats. You will need an XSLT processor, such as <systemitem role="package">xsltproc</systemitem>, to use the XSL stylesheets. Documentation for the stylesheets can be found in the various <systemitem role="package">docbook-xsl-doc-*</systemitem> packages.
it: Il pacchetto <systemitem role="package">docbook-xsl</systemitem> fornisce i file XSL per l'applicazione di stili e la generazione dai sorgenti di vari output. Sara necessario un processore XSLT, come <systemitem role="package">xsltproc</systemitem>, per utilizzare i fogli di stile XSL. La documentazione per i fogli di stile si può trovare nei vari pacchetti <systemitem role="package">docbook-xsl-doc-*</systemitem>.

source: To produce PDF from FO, you need an FO processor, such as <systemitem role="package">xmlroff</systemitem> or <systemitem role="package">fop</systemitem>. Another tool to generate PDF from DocBook XML is <systemitem role="package">dblatex</systemitem>.
it: Per produrre un PDF da FO, è necessario un processore FO, come <systemitem role="package">xmlroff</systemitem> o <systemitem role="package">fop</systemitem>. Un altro strumento per generare PDF da DocBook XML è <systemitem role="package">dblatex</systemitem>.
