Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: <literal>keywordall [&lt;email&gt;] {+|-|=} &lt;list of keywords&gt;</literal>
it: <literal>keywordall [&lt;email&gt;] {+|-|=} &lt;elenco di parole chiave&gt;</literal>

source: Accept (+) or refuse (-) mails classified under the given keyword(s). Define the list (=) of accepted keywords. This changes the set of accepted keywords of all the currently active subscriptions of a user.
it: Accetta (+) o rifiuta (-) email classificate sotto le parole chiave specificate. Definisce l'elenco (=) delle parole chiave accettate. Ciò cambia l'insieme di parole chiave accettate di tutte le sottoscrizioni attualmente attive di un utente.

source: <literal>keyword &lt;sourcepackage&gt; [&lt;email&gt;] {+|-|=} &lt;list of keywords&gt;</literal>
it: <literal>keyword &lt;pacchetto sorgente&gt; [&lt;email&gt;] {+|-|=} &lt;elenco di parole chiave&gt;</literal>

source: Same as previous item but overrides the keywords list for the indicated source package.
it: Come la voce precedente, ma sovrascrive l'elenco di parole chiave per il pacchetto sorgente indicato.

source: Stops processing commands. All following lines are ignored by the bot.
it: Interrompe l'elaborazione dei comandi. Tutte le righe seguenti vengono ignorate dal bot.

source: The <command>pts-subscribe</command> command-line utility (from the <systemitem role="package">devscripts</systemitem> package) can be handy to temporarily subscribe to some packages, for example after having made an non-maintainer upload.
it: L'utilità da riga di comando <command>pts-subscribe</command> (dal pacchetto <systemitem role="package">devscripts</systemitem>) può essere utile per iscriversi temporaneamente ad alcuni pacchetti, per esempio dopo aver fatto un caricamento da non-maintainer.

source: Filtering mails from the package tracker
it: Filtrare mail provenienti dal tracker del pacchetto

source: Once you are subscribed to a package, you will get mails forwarded by the package tracker. Those mails have special headers appended to let you filter them in a special mailbox (e.g. with <command>procmail</command>). The added headers are <literal>X-Loop</literal>, <literal>X-Distro-Tracker-Package</literal>, <literal>X-Distro-Tracker-Keyword</literal>, <literal>X-Debian-Package</literal>, <literal>X-Debian</literal> and <literal>List-Unsubscribe</literal>.
it: Una volta che si è iscritti a un pacchetto, si riceveranno le email inviate a <literal><replaceable>pacchetto sorgente</replaceable>@&pts-host;</literal>. Questi messaggi hanno intestazioni speciali allegate per permettere di filtrarle in una casella di posta speciale (ad esempio con <command>procmail</command>). Le intestazioni aggiunte sono <literal>X-Loop</literal>, <literal>X-PTS-Package</literal>, <literal>X-PTS-Keyword</literal> e <literal>X-Unsubscribe</literal>.

source: Here is an example of added headers for a source upload notification on the <systemitem role="package">dpkg</systemitem> package:
it: Ecco un esempio di intestazioni aggiuntive per una notifica di un caricamento dei sorgenti sul pacchetto <systemitem role="package">dpkg</systemitem>:

source: X-Loop: dispatch@&tracker-host; X-Distro-Tracker-Package: dpkg X-Distro-Tracker-Keyword: upload-source X-Debian-Package: dpkg X-Debian: tracker.debian.org List-Unsubscribe: &lt;mailto:control@tracker.debian.org?body=unsubscribe%20dpkg&gt;
it: X-Loop: dpkg@&pts-host; X-PTS-Package: dpkg X-PTS-Keyword: upload-source List-Unsubscribe: &lt;mailto:pts@qa.debian.org?body=unsubscribe+dpkg&gt;

source: Forwarding VCS commits to the package tracker
it: Inoltrare i commit del VCS nel PTS

source: If you use a publicly accessible VCS repository for maintaining your Debian package, you may want to forward the commit notification to the package tracker so that the subscribers (and possible co-maintainers) can closely follow the package's evolution.
it: Se si utilizza un repository VCS accessibile al pubblico per la manutenzione del proprio pacchetto Debian, si consiglia di inoltrare le notifiche di commit al PTS in modo che gli abbonati (ed i possibili co-maintainer) possano seguire da vicino l'evoluzione del pacchetto.

source: Once you set up the VCS repository to generate commit notifications, you just have to make sure it sends a copy of those mails to the package tracker at <literal>dispatch@&tracker-host;</literal> or at <literal>dispatch+<replaceable>sourcepackage</replaceable>_vcs@&tracker-host;</literal>. In the former case, you must make sure that the package tracker is able to identify the source package and the appropriate keyword... either by adding the headers <literal>X-Distro-Tracker-Package: <replaceable>sourcepackage</replaceable></literal> and <literal>X-Distro-Tracker-Keyword: vcs</literal> or by relying on the fact that the package tracker will detect the <literal>X-Git-Repo</literal> header and assume that the name of the git repository matches a source package.
it: Una volta impostato il repository VCS per generare notifiche di commit, basta assicurarsi che si invii una copia di quelle mail al tracker del pacchetto al <literal>dispatch@&tracker-host;</literal> o <literal>dispatch+<replaceable>sourcepackage</replaceable>_vcs@&tracker-host;</literal>. Nel primo caso, è necessario assicurarsi che il tracker del pacchetto è in grado di identificare il pacchetto sorgente e la parola chiave appropriata ... o aggiungendo le intestazioni <literal>X-Distro-Tracker-Package: <replaceable>sourcepackage</replaceable></literal> and <literal>X-Distro-Tracker-Keyword: vcs</literal> o basandosi sul fatto che il tracker del pacchetto rileverà l'header <literal>X-Git-Repo</literal> e supporrà che il nome del repository git corrisponda a un pacchetto sorgente.

source: For Subversion repositories, the usage of svnmailer is recommended. See <ulink url="&url-alioth-pkg;" /> for an example on how to do it.
it: Per i repository Subversion, si consiglia l'utilizzo di svnmailer. Si consulti <ulink url="&url-alioth-pkg;" /> per un esempio su come farlo.

source: The package tracker web interface
it: L'intefaccia web di PTS

source: The package tracker has a web interface at <ulink url="https://&tracker-host;/"></ulink> that puts together a lot of information about each source package. It features many useful links (BTS, QA stats, contact information, DDTP translation status, buildd logs) and gathers much more information from various places (30 latest changelog entries, testing status, etc.). It's a very useful tool if you want to know what's going on with a specific source package. Furthermore, once authenticated, you can subscribe and unsubscribe from any package with a single click.
it: Il PTS ha una interfaccia web all'indirizzo <ulink url="http://&pts-host;/"></ulink>, che mette insieme molte informazioni su ogni pacchetto sorgente. È dotato di molti collegameti utili (BTS, statistiche QA, informazioni sui contatti, lo stato di traduzione DDTP, log dei buildd) e raccoglie molte informazioni da vari luoghi (le ultime 30 voci del changelog, lo stato di testing, etc.). È uno strumento molto utile se si vuole sapere che cosa sta succedendo ad uno specifico pacchetto sorgente. Inoltre c'è un modulo che permette una facile iscrizione al PTS via email.

source: You can jump directly to the web page concerning a specific source package with a URL like <literal>https://&tracker-host;/pkg/<replaceable>sourcepackage</replaceable></literal>.
it: È possibile accedere direttamente alla pagina web relativa ad uno specifico pacchetto sorgente con un URL del tipo <literal>http://&pts-host;/<replaceable>pacchettosorgente</replaceable></literal>.

source: The web interface is easy to extend and you are welcome to integrate more useful data in it. If you want to contribute, have a look at <ulink url="https://&tracker-host;/docs/contributing.html"></ulink>.
it: L'interfaccia web è facile da estendere e si è invitati ad integrare i dati più utili in essa. Se si vuole contribuire, si dia un'occhiata a <ulink url="https://&tracker-host;/docs/contributing.html"></ulink>.

source: Developer's packages overview
it: Panoramica dei pacchetti per sviluppatori

source: A QA (quality assurance) web portal is available at <ulink url="&url-ddpo;"></ulink> which displays a table listing all the packages of a single developer (including those where the party is listed as a co-maintainer). The table gives a good summary about the developer's packages: number of bugs by severity, list of available versions in each distribution, testing status and much more including links to any other useful information.
it: Un portale web QA (garanzia di qualità) è disponibile all'indirizzo <ulink url="&url-ddpo;"></ulink> che visualizza una tabella che elenca tutti i pacchetti di un singolo sviluppatore (compresi quelli in cui è elencato come co-maintainer). La tabella fornisce una buona sintesi sui pacchetti dello sviluppatore: numero di bug ordinati per gravità, l'elenco delle versioni disponibili in ogni distribuzione, lo stato di testing e molto altro tra cui collegamenti ad ogni altra informazione utile.

source: It is a good idea to look up your own data regularly so that you don't forget any open bugs, and so that you don't forget which packages are your responsibility.
it: È una buona idea cercare i propri dati regolarmente in modo da non dimenticare eventuali bug aperti e in modo da non dimenticare di quali pacchetti si ha la responsabilità.

source: Debian's FusionForge installation: Alioth
it: L'installazione FusionForge di Debian: Alioth

source: Alioth is a Debian service based on a slightly modified version of the FusionForge software (which evolved from SourceForge and GForge). This software offers developers access to easy-to-use tools such as bug trackers, patch manager, project/task managers, file hosting services, mailing lists, VCS repositories etc. All these tools are managed via a web interface.
it: Alioth è un servizio Debian basato su una versione leggermente modificata del software FusionForge (che si è evoluta da SourceForge e GForge). Questo software offre agli sviluppatori l'accesso a strumenti facili da usare, come bug tracker, responsabili delle patch, responsabili di progetto/attività, servizi di file hosting, mailing list, repository VCS ecc. Tutti questi strumenti sono gestiti tramite un'interfaccia web.

source: It is intended to provide facilities to free software projects backed or led by Debian, facilitate contributions from external developers to projects started by Debian, and help projects whose goals are the promotion of Debian or its derivatives. It's heavily used by many Debian teams and provides hosting for all sorts of VCS repositories.
it: Esso è pensato per fornire servizi per progetti di software libero sostenuti o guidati da Debian, facilitare contributi da sviluppatori esterni a progetti avviati da Debian, e contribuire a progetti i cui obiettivi sono la promozione di Debian o le sue derivate. È molto utilizzato da molti team di Debian e fornisce hosting per tutti i tipi di repository VCS.

source: All Debian developers automatically have an account on Alioth. They can activate it by using the recover password facility. External developers can request guest accounts on Alioth.
it: Tutti gli sviluppatori Debian hanno automaticamente un account su Alioth. Essi possono attivarlo utilizzando la funzionalità di recupero password. Gli sviluppatori esterni possono richiedere gli account ospite su Alioth.

source: For more information please visit the following links:
it: Per ulteriori informazioni visitare i seguenti collegamenti:

source: Goodies for Debian Developers and Debian Maintainers
it: Benefici per gli sviluppatori e menutentori Debian

source: Benefits available to Debian Developers and Debian Maintainers are documented on <ulink url="https://wiki.debian.org/MemberBenefits"></ulink>.
it: Vantaggi a disposizione di sviluppatori e dei maintainer Debian sono documentati su <ulink url="https://wiki.debian.org/MemberBenefits"></ulink>.

source: Scope of This Document
it: Scopo di questo documento

source: The purpose of this document is to provide an overview of the recommended procedures and the available resources for Debian developers.
it: Lo scopo di questo documento è quello di fornire una panoramica delle procedure consigliate e delle risorse disponibili per gli sviluppatori Debian.

source: The procedures discussed within include how to become a maintainer (<xref linkend="new-maintainer"/>); how to create new packages (<xref linkend="newpackage"/>) and how to upload packages (<xref linkend="upload"/>); how to handle bug reports (<xref linkend="bug-handling"/>); how to move, remove, or orphan packages (<xref linkend="archive-manip"/>); how to port packages (<xref linkend="porting"/>); and how and when to do interim releases of other maintainers' packages (<xref linkend="nmu"/>).
it: Le procedure descritte qui includono come diventare un maintainer (<xref linkend="new-maintainer"/>); come creare nuovi pacchetti (<xref linkend="newpackage"/>) e come caricare i pacchetti (<xref linkend="upload"/>); come gestire le segnalazioni di bug (<xref linkend="bug-handling"/>); come spostare, rimuovere o rendere orfani i pacchetti (<xref linkend="archive-manip"/>); come fare il port dei pacchetti (<xref linkend="porting"/>); e come e quando fare versioni provvisorie dei pacchetti di altri maintainer (<xref linkend="nmu"/>).

source: The resources discussed in this reference include the mailing lists (<xref linkend="mailing-lists"/>) and servers (<xref linkend="server-machines"/>); a discussion of the structure of the Debian archive (<xref linkend="archive"/>); explanation of the different servers which accept package uploads (<xref linkend="upload-ftp-master"/>); and a discussion of resources which can help maintainers with the quality of their packages (<xref linkend="tools"/>).
it: Le risorse discusse in questo manuale includono le mailing list (<xref linkend="mailing-lists"/>) e server (<xref linkend="server-machines"/>); una discussione sulla struttura dell'archivio Debian (<xref linkend="archive"/>); spiegazione dei diversi server che accettano caricamenti di pacchetti (<xref linkend="upload-ftp-master"/>); e una discussione delle risorse che possono aiutare i maintainer con la qualità dei propri pacchetti (<xref linkend="tools"/>).

source: It should be clear that this reference does not discuss the technical details of Debian packages nor how to generate them. Nor does this reference detail the standards to which Debian software must comply. All of such information can be found in the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>.
it: Dovrebbe essere chiaro che questo manuale non tratta i dettagli tecnici di pacchetti Debian né come generarli. Né questo manuale dettaglia le norme che il software Debian deve rispettare. Tutte queste informazioni possono essere trovate nel <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>.

source: Furthermore, this document is <emphasis>not an expression of formal policy</emphasis>. It contains documentation for the Debian system and generally agreed-upon best practices. Thus, it is not what is called a ``normative'' document.
it: Inoltre, questo documento <emphasis>non è espressione della policy ufficiale</emphasis>. Contiene documentazione per il sistema Debian e le migliori pratiche più condivise. Pertanto, non è quello che viene chiamato un documento «normativo».

source: Overview of Debian Maintainer Tools
it: Panoramica degli strumenti del Debian Maintainer

source: This section contains a rough overview of the tools available to maintainers. The following is by no means complete or definitive, but just a guide to some of the more popular tools.
it: Questa sezione contiene una panoramica generale degli strumenti disponibili per i maintainer. Ciò che segue non è affatto completo o definitivo, ma solo una guida per alcuni degli strumenti più popolari.

source: Debian maintainer tools are meant to aid developers and free their time for critical tasks. As Larry Wall says, there's more than one way to do it.
it: Gli strumenti del maintainer Debian hanno lo scopo di aiutare gli sviluppatori e liberare il loro tempo per attività critiche. Come dice Larry Wall, c'è più di un modo per farlo.

source: Some people prefer to use high-level package maintenance tools and some do not. Debian is officially agnostic on this issue; any tool which gets the job done is fine. Therefore, this section is not meant to stipulate to anyone which tools they should use or how they should go about their duties of maintainership. Nor is it meant to endorse any particular tool to the exclusion of a competing tool.
it: Alcune persone preferiscono utilizzare strumenti gli di manutenzione dei pacchetti ad alto livello e altri no. Debian è ufficialmente agnostica su questo problema, qualsiasi strumento che ottiene il lavoro fatto va bene. Pertanto, questa sezione non intende indicare a nessuno quali strumenti deve adottare o come devono condurre le loro funzioni di mantenimento del pacchetto. Né è destinata a promuovere qualsiasi particolare strumento al fine di escludere uno strumento in competizione.

source: Most of the descriptions of these packages come from the actual package descriptions themselves. Further information can be found in the package documentation itself. You can also see more info with the command <command>apt-cache show <replaceable>package-name</replaceable></command>.
it: La maggior parte delle descrizioni di questi pacchetti vengono dalle descrizioni effettive dei pacchetti stessi. Ulteriori informazioni possono essere trovate nella documentazione del pacchetto stesso. È anche possibile visualizzare ulteriori informazioni con il comando <command>apt-cache show <replaceable>nome-pacchetto</replaceable></command>.

source: Core tools
it: Strumeti di base

source: The following tools are pretty much required for any maintainer.
it: I seguenti strumenti sono praticamente obbligatori per qualsiasi maintainer.

source: <systemitem role="package">dpkg-dev</systemitem> contains the tools (including <command>dpkg-source</command>) required to unpack, build, and upload Debian source packages. These utilities contain the fundamental, low-level functionality required to create and manipulate packages; as such, they are essential for any Debian maintainer.
it: <systemitem role="package">dpkg-dev</systemitem> contiene gli strumenti (compreso <command>dpkg-source</command>) necessari per spacchettare, creare e caricare pacchetti sorgenti Debian. Queste utilità contengono la fondamentale funzionalità di basso livello necessaria per creare e manipolare i pacchetti; in quanto tali, essi sono essenziali per qualsiasi maintainer Debian.

source: <systemitem role="package">debconf</systemitem> provides a consistent interface to configuring packages interactively. It is user interface independent, allowing end-users to configure packages with a text-only interface, an HTML interface, or a dialog interface. New interfaces can be added as modules.
it: <systemitem role="package">debconf</systemitem> fornisce un'interfaccia coerente per la configurazione di pacchetti interattiva.È indipendente dall'interfaccia utente, che consente agli utenti finali di configurare i pacchetti con un'interfaccia testuale, un'interfaccia HTML o un'interfaccia con riquadri di dialogo. Nuove interfacce possono essere aggiunte come moduli.

source: You can find documentation for this package in the <systemitem role="package">debconf-doc</systemitem> package.
it: È possibile trovare la documentazione per questo pacchetto nel pacchetto <systemitem role="package">debconf-doc</systemitem>.

source: Many feel that this system should be used for all packages which require interactive configuration; see <xref linkend="bpp-config-mgmt"/>. <systemitem role="package">debconf</systemitem> is not currently required by Debian Policy, but that may change in the future.
it: Molti ritengono che questo sistema dovrebbe essere utilizzato per tutti i pacchetti che richiedono una configurazione interattiva, si consulti <xref linkend="bpp-config-mgmt"/>. <systemitem role="package">debconf</systemitem> non è attualmente richiesto dalla policy di Debian, ma ciò potrebbe cambiare in futuro.

source: <systemitem role="package">fakeroot</systemitem> simulates root privileges. This enables you to build packages without being root (packages usually want to install files with root ownership). If you have <systemitem role="package">fakeroot</systemitem> installed, <command>dpkg-buildpackage</command> will use it automatically.
it: <systemitem role="package">fakeroot</systemitem> simula i privilegi di root. Questo permette di compilare pacchetti senza essere root (i pacchetti di solito vogliono installare i file con i permessi di root). Se si ha <systemitem role="package">fakeroot</systemitem> installato, è possibile compilare pacchetti come utente normale: <literal>dpkg-buildpackage-rfakeroot</literal>.

source: Package lint tools
it: Strumenti per la pulizia di pacchetti

source: According to the Free On-line Dictionary of Computing (FOLDOC), `lint' is a Unix C language processor which carries out more thorough checks on the code than is usual with C compilers. Package lint tools help package maintainers by automatically finding common problems and policy violations in their packages.
it: Secondo il Dizionario On-line di Informatica (FOLDOC), «lint» è un processore di linguaggio Unix C che effettua verifiche più approfondite sul codice rispetto ai normali compilatori C. Gli strumenti di controllo dei pacchetti aiutano i maintainer trovando nei loro pacchetti automaticamente i problemi più comuni e le violazioni delle policy.

source: <systemitem role="package">lintian</systemitem> dissects Debian packages and emits information about bugs and policy violations. It contains automated checks for many aspects of Debian policy as well as some checks for common errors.
it: <systemitem role="package">lintian</systemitem> studia approfonditamente i pacchetti Debian e fornisce informazioni su bug e violazioni delle policy. Contiene controlli automatici per molti aspetti della policy Debian così come alcuni controlli per gli errori più frequenti.

source: You should periodically get the newest <systemitem role="package">lintian</systemitem> from <literal>unstable</literal> and check over all your packages. Notice that the <literal>-i</literal> option provides detailed explanations of what each error or warning means, what its basis in Policy is, and commonly how you can fix the problem.
it: Si dovrebbe ottenere periodicamente il più nuovo <systemitem role="package">lintian</systemitem> da <literal>unstable</literal> e controllare tutti i propri pacchetti. Si noti che l'opzione <literal>-i</literal> fornisce spiegazioni dettagliate di ciò che ogni errore o avvertimento significa, quale sia la sua base nella Policy e come generalmente si può risolvere il problema.

source: Refer to <xref linkend="sanitycheck"/> for more information on how and when to use Lintian.
it: Si consulti <xref linkend="sanitycheck"/> per maggiori informazioni su come e quando utilizzare Lintian.

source: You can also see a summary of all problems reported by Lintian on your packages at <ulink url="&url-lintian;"></ulink>. These reports contain the latest <command>lintian</command> output for the whole development distribution (<literal>unstable</literal>).
it: È anche possibile visualizzare un riepilogo di tutti i problemi segnalati da Lintian sui vostri pacchetti su <ulink url="&url-lintian;"></ulink>. Questi rapporti contengono gli ultimi output di <command>lintian</command> per l'intera distribuzione di sviluppo (<literal>unstable</literal>).
