Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: The process of registering as a developer is a process of verifying your identity and intentions, and checking your technical skills. As the number of people working on &debian-formal; has grown to over &number-of-maintainers; and our systems are used in several very important places, we have to be careful about being compromised. Therefore, we need to verify new maintainers before we can give them accounts on our servers and let them upload packages.
it: Il processo di registrazione come sviluppatore è un processo di verifica della vostra identità e delle vostre intenzioni, e per controllare le vostre capacità tecniche. Poiché il numero di persone che lavorano su &debian-formal;, è cresciuto fino a oltre &number-of-maintainers; ed i nostri sistemi sono utilizzati in diversi punti molto importanti, dobbiamo stare attenti sull'essere compromessi. Pertanto, abbiamo bisogno di verificare i nuovi maintainer prima che di dar loro l'account sui nostri server e fargli caricare i pacchetti.

source: Before you actually register you should have shown that you can do competent work and will be a good contributor. You show this by submitting patches through the Bug Tracking System and having a package sponsored by an existing Debian Developer for a while. Also, we expect that contributors are interested in the whole project and not just in maintaining their own packages. If you can help other maintainers by providing further information on a bug or even a patch, then do so!
it: Prima che realmente ci si registri si dovrebbe aver dimostrato che si può fare un lavoro competente e che si sarà un buon collaboratore. Si mostrerà ciòmandando patch attraverso il Bug Tracking System e avendo per un po' un pacchetto sponsorizzato da uno sviluppatore Debian esistente. Inoltre, ci si aspetta che i collaboratori siano interessati a tutto il progetto e non solo a mantenere i propri pacchetti. Se si può aiutare gli altri maintainer, fornendo ulteriori informazioni su un bug o anche una patch, lo si faccia!

source: Registration requires that you are familiar with Debian's philosophy and technical documentation. Furthermore, you need a GnuPG key which has been signed by an existing Debian maintainer. If your GnuPG key is not signed yet, you should try to meet a Debian Developer in person to get your key signed. There's a <ulink url="&url-gpg-coord;">GnuPG Key Signing Coordination page</ulink> which should help you find a Debian Developer close to you. (If there is no Debian Developer close to you, alternative ways to pass the ID check may be permitted as an absolute exception on a case-by-case-basis. See the <ulink url="&url-newmaint-id;">identification page</ulink> for more information.)
it: La registrazione richiede che si abbia familiarità con la filosofia di Debian e con la documentazione tecnica. Inoltre, è necessaria una chiave GnuPG che sia stata firmata da un maintainer Debian esistente. Se la chiave GnuPG non è stata ancora firmata, si dovrebbe cercare di incontrare uno sviluppatore Debian di persona per farsi firmare la chiave. C'è una <ulink url="&url-gpg-coord;">pagina GnuPG Key Signing Coordination</ulink>, che dovrebbe aiutare a trovare uno sviluppatore Debian vicino a voi. (Se non c'è uno sviluppatore Debian vicino a voi, modi alternativi per passare il controllo ID possono essere autorizzati come un'eccezione assoluta, valutata caso per caso. Si veda la <ulink url="&url-newmaint-id;">pagina di identificazione</ulink> per ulteriori informazioni.)

source: If you do not have an OpenPGP key yet, generate one. Every developer needs an OpenPGP key in order to sign and verify package uploads. You should read the manual for the software you are using, since it has much important information which is critical to its security. Many more security failures are due to human error than to software failure or high-powered spy techniques. See <xref linkend="key-maint"/> for more information on maintaining your public key.
it: Se non si dispone ancora di una chiave OpenPGP, generatene una. Ogni sviluppatore ha bisogno di una chiave OpenPGP per firmare e verificare i caricamenti dei pacchetti. Si consiglia di leggere il manuale del software in uso, dal momento che dispone di informazioni molto importanti che sono fondamentali per la sua sicurezza. Molti fallimenti sono dovuti ad errori umani che a malfunzionamenti del software o tecniche avanzate di spionaggio. Per maggiori informazioni sulla manutenzione della chiave pubblica si consulti <xref linkend="key-maint"/>.

source: Debian uses the <literal>GNU Privacy Guard</literal> (package <systemitem role="package">gnupg</systemitem> version 1 or better) as its baseline standard. You can use some other implementation of OpenPGP as well. Note that OpenPGP is an open standard based on <ulink url="&url-rfc2440;">RFC 2440</ulink>.
it: Debian usa il <literal>GNU Privacy Guard</literal> (pacchetto <systemitem role="package">GnuPG</systemitem> versione 1 o superiore) come standard di riferimento. È possibile anche utilizzare qualche altra implementazione di OpenPGP. Si noti che OpenPGP è uno standard aperto basato su <ulink url="&url-rfc2440;">RFC 2440</ulink>.

source: Version 4 keys are keys conforming to the OpenPGP standard as defined in RFC 2440. Version 4 is the key type that has always been created when using GnuPG. PGP versions since 5.x also could create v4 keys, the other choice having been pgp 2.6.x compatible v3 keys (also called legacy RSA by PGP).
it: Le chiavi versione 4 sono chiavi conformi allo standard OpenPGP come definito nella RFC 2440. La versione 4 è il tipo di chiave che è creata quando si utilizza GnuPG. Le versioni di PGP dalla 5.x in su potrebbero anche creare chiavi v4, l'altra scelta essendo compatibili le chiavi pgp 2.6.x v3 (anche chiamata eredità RSA da PGP).

source: Version 4 (primary) keys can either use the RSA or the DSA algorithms, so this has nothing to do with GnuPG's question about which kind of key do you want: (1) DSA and Elgamal, (2) DSA (sign only), (5) RSA (sign only). If you don't have any special requirements just pick the default.
it: Le chiavi (primarie) versione 4 possono utilizzare l'algoritmo RSA o DSA, quindi questo non ha nulla a che fare con la questione di GnuPG su quale tipo di chiave volete: (1) DSA e Elgamal, (2) DSA (solo firma), (5) RSA (solo firma). Se non si hanno esigenze particolari basta scegliere l'opzione predefinita.

source: The easiest way to tell whether an existing key is a v4 key or a v3 (or v2) key is to look at the fingerprint: Fingerprints of version 4 keys are the SHA-1 hash of some key material, so they are 40 hex digits, usually grouped in blocks of 4. Fingerprints of older key format versions used MD5 and are generally shown in blocks of 2 hex digits. For example if your fingerprint looks like <literal>5B00 C96D 5D54 AEE1 206B AF84 DE7A AF6E 94C0 9C7F</literal> then it's a v4 key.
it: Il modo più semplice per dire se una chiave esistente è una chiave v4 o v3 (o v2) è quello di esaminare l'impronta digitale: Le impronte digitali delle chiavi versione 4 sono l'hash SHA-1 di una chiave materiale, in modo che siano 40 cifre esadecimali, solitamente raggruppate in blocchi di 4. Le impronte digitali formate con vecchie versioni utilizzavano l'MD5 e sono generalmente indicate in blocchi di 2 cifre esadecimali. Per esempio, se l'impronta digitale si presenta come <literal>5B00 C96D 5D54 AEE1 206B AF84 DE7A AF6E 94C0 9C7F</literal>, allora è una chiave v4.

source: Another possibility is to pipe the key into <command>pgpdump</command>, which will say something like Public Key Packet - Ver 4.
it: Un'altra possibilità è quella di inoltrare la chiave in <command>PGPdump</command>, che dirà qualcosa di simile a Public Key Packet - Ver 4.

source: Also note that your key must be self-signed (i.e. it has to sign all its own user IDs; this prevents user ID tampering). All modern OpenPGP software does that automatically, but if you have an older key you may have to manually add those signatures.
it: Si noti inoltre che la chiave deve essere self-signed (cioè deve firmare tutti i propri ID utente; questo impedisce manomissioni dell'ID utente). Tutti i moderni software di OpenPGP lo fanno automaticamente, ma se si dispone di una chiave più vecchia può essere necessario aggiungere manualmente le firme.

source: You need a version 4 key for use in Debian Development. <ulink url="https://lists.debian.org/20090520092534.GG22906@earth.li">Your key length must be greater than 1024 bits</ulink>; there is no reason to use a smaller key, and doing so would be much less secure.<placeholder type="footnote" id="0"/>
it: Si ha bisogno di una chiave di versione 4 per utilizzarla nello sviluppo Debian. <ulink url="http://lists.debian.org/20090520092534.GG22906@earth.li">La lunghezza della chiave deve essere maggiore di 1024 bit</ulink>; non c'è motivo di usare una chiave più piccola, e così facendo sarebbe molto meno sicuro. <placeholder type="footnote" id="0"/>

source: If your public key isn't on a public key server such as &pgp-keyserv;, please read the documentation available at <ulink url="&url-newmaint-id;">NM Step 2: Identification</ulink>. That document contains instructions on how to put your key on the public key servers. The New Maintainer Group will put your public key on the servers if it isn't already there.
it: Se la chiave pubblica non è su un server a chiave pubblica, come &pgp-keyserv;, leggere la documentazione disponibile presso <ulink url="&url-newmaint-id;">NM Fase 2: Identificazione</ulink>. Questo documento contiene le istruzioni su come mettere la vostra chiave sui server di chiavi pubbliche. Il New Maintainer Group metterà la vostra chiave pubblica sul server, se non è già presente.

source: Some countries restrict the use of cryptographic software by their citizens. This need not impede one's activities as a Debian package maintainer however, as it may be perfectly legal to use cryptographic products for authentication, rather than encryption purposes. If you live in a country where use of cryptography even for authentication is forbidden then please contact us so we can make special arrangements.
it: Alcuni paesi limitano l'utilizzo di software di crittografia per i loro cittadini. Questo non deve impedire tuttavia le attività come maintainer Debian di un pacchetto, essendo perfettamente legale l'utilizzo di prodotti di crittografia per l'autenticazione, piuttosto che per scopi di crittografia. Se si vive in un paese dove è vietato l'uso della crittografia per l'autenticazione, allora non esitare a contattarci in modo da poter prendere accordi speciali.

source: To apply as a new maintainer, you need an existing Debian Developer to support your application (an <literal>advocate</literal>). After you have contributed to Debian for a while, and you want to apply to become a registered developer, an existing developer with whom you have worked over the past months has to express their belief that you can contribute to Debian successfully.
it: Per proporsi come un nuovo maintainer, è necessario uno sviluppatore Debian esistente per supportare la vostra domanda (un <literal>sostenitore</literal>). Dopo aver contribuito a Debian per un po', e si vuole chiedere di diventare uno sviluppatore registrato, uno sviluppatore esistente con cui si è lavorato negli ultimi mesi deve esprimere la propria convinzione che si possa contribuire a Debian con successo.

source: When you have found an advocate, have your GnuPG key signed and have already contributed to Debian for a while, you're ready to apply. You can simply register on our <ulink url="&url-newmaint-apply;">application page</ulink>. After you have signed up, your advocate has to confirm your application. When your advocate has completed this step you will be assigned an Application Manager who will go with you through the necessary steps of the New Maintainer process. You can always check your status on the <ulink url="&url-newmaint-db;">applications status board</ulink>.
it: Nel momento in cui si sarà trovato un sostenitore, la propria chiave GnuPG firmata e contribuito a Debian per un po', si è pronti a presentare la domanda. Potete semplicemente registrarla sulla nostra <ulink url="&url-newmaint-apply;">pagina applicazioni</ulink>. Dopo che ci si è registrati, il proprio sostenitore deve confermare la propria domanda. Quando il proprio sostenitore avrà completato questo passaggio verrà assegnato un Application Manager, che accompagnerà attraverso i passaggi necessari del processo di New Maintainer. Si potrà sempre controllare lo stato sulla <ulink url="&url-newmaint-db;">applications status board</ulink>.

source: For more details, please consult <ulink url="&url-newmaint;">New Maintainer's Corner</ulink> at the Debian web site. Make sure that you are familiar with the necessary steps of the New Maintainer process before actually applying. If you are well prepared, you can save a lot of time later on.
it: Per maggiori informazioni, consultare il <ulink url="&url-newmaint;">New Maintainer's Corner</ulink> sul sito web di Debian. Assicurarsi di avere familiarità con i passi necessari del processo del Nuovo Maintainer prima di presentare la domanda. Se si è ben preparati, si può risparmiare molto di tempo in seguito.

source: Managing Packages
it: Gestione dei pacchetti

source: This chapter contains information related to creating, uploading, maintaining, and porting packages.
it: Questo capitolo contiene informazioni relative alla creazione, al caricamento, al mantenimento, ed al porting dei pacchetti.

source: New packages
it: Nuovi pacchetti

source: If you want to create a new package for the Debian distribution, you should first check the <ulink url="&url-wnpp;">Work-Needing and Prospective Packages (WNPP)</ulink> list. Checking the WNPP list ensures that no one is already working on packaging that software, and that effort is not duplicated. Read the <ulink url="&url-wnpp;">WNPP web pages</ulink> for more information.
it: Se si desidera creare un nuovo pacchetto per la distribuzione Debian, si dovrebbe verificare prima l'elenco <ulink url="&url-wnpp;">Work-Needing and Prospective Packages (WNPP)</ulink>. Il controllo dell'elenco WNPP assicura che nessuno stia già lavorando sulla pacchettizzazione del software, e che lo sforzo non sia duplicato. Si leggano le <ulink url="&url-wnpp;">pagine web WNPP</ulink> per ulteriori informazioni.

source: Assuming no one else is already working on your prospective package, you must then submit a bug report (<xref linkend="submit-bug"/>) against the pseudo-package <systemitem role="package">wnpp</systemitem> describing your plan to create a new package, including, but not limiting yourself to, the description of the package (so that others can review it), the license of the prospective package, and the current URL where it can be downloaded from.
it: Supponendo che nessun altro stia già lavorando sul proprio futuro pacchetto, è necessario poi presentare una segnalazione di bug (<xref linkend="submit-bug"/>) nei confronti dello pseudo-pacchetto <systemitem role="package">wnpp</systemitem> descrivendo come si vuole procedere per creare un nuovo pacchetto, includendo, senza limitarsi ad essa, una descrizione del medesimo, la licenza del futuro pacchetto, e l'URL corrente da dove è possibile scaricarlo.

source: You should set the subject of the bug to <literal>ITP: <replaceable>foo</replaceable> -- <replaceable>short description</replaceable></literal>, substituting the name of the new package for <replaceable>foo</replaceable>. The severity of the bug report must be set to <literal>wishlist</literal>. Please send a copy to &email-debian-devel; by using the X-Debbugs-CC header (don't use CC:, because that way the message's subject won't indicate the bug number). If you are packaging so many new packages (>10) that notifying the mailing list in separate messages is too disruptive, send a summary after filing the bugs to the debian-devel list instead. This will inform the other developers about upcoming packages and will allow a review of your description and package name.
it: Si consiglia di impostare l'oggetto del bug a <literal>ITP: <replaceable>foo</replaceable> -- <replaceable>breve descrizione</replaceable> </literal>, sostituendo il nome del nuovo pacchetto in <replaceable>foo</replaceable>. La gravità della segnalazione di bug deve essere impostata su <literal>wishlist</literal>. Inviare una copia a &email-debian-devel;, utilizzando l'intestazione X-Debbugs-CC (non usare CC:, perché in questo modo il soggetto del messaggio non indicherà il numero di bug). Se si stanno pacchettizzando tanti nuovi pacchetti (> 10) tale che notificare alla mailing list con messaggi separati sia troppo dirompente, si invii invece un riepilogo dopo aver depositato i bug nella lista debian-devel. Questo informerà gli altri sviluppatori sui prossimi pacchetti e consentirà una revisione della vostra descrizione e nome del pacchetto.

source: Please include a <literal>Closes: #<replaceable>nnnnn</replaceable></literal> entry in the changelog of the new package in order for the bug report to be automatically closed once the new package is installed in the archive (see <xref linkend="upload-bugfix"/>).
it: Inserire una voce <literal>Closes: #<replaceable>nnnnn</replaceable></literal> nel changelog del nuovo pacchetto per la segnalare di bug da chiudere automaticamente una volta che il nuovo pacchetto è installato in archivio (si consulti <xref linkend="upload-bugfix"/>).

source: If you think your package needs some explanations for the administrators of the NEW package queue, include them in your changelog, send to &email-ftpmaster; a reply to the email you receive as a maintainer after your upload, or reply to the rejection email in case you are already re-uploading.
it: Se si pensa che il proprio pacchetto abbia bisogno di alcune spiegazioni per gli amministratori della coda NEW dei pacchetti, includerle nel proprio changelog, inviare a &email-ftpmaster; una risposta alla email ricevuta come maintainer dopo il proprio caricamento, o rispondere alla email di rifiuto in caso si stia già effettuando nuovamente il caricamento.

source: When closing security bugs include CVE numbers as well as the <literal>Closes: #<replaceable>nnnnn</replaceable></literal>. This is useful for the security team to track vulnerabilities. If an upload is made to fix the bug before the advisory ID is known, it is encouraged to modify the historical changelog entry with the next upload. Even in this case, please include all available pointers to background information in the original changelog entry.
it: Nel chiudere i bug di sicurezza includete i numeri CVE come <literal>Closes: #<replaceable>nnnnn</replaceable></literal>. Questo è utile al il team di sicurezza per monitorare le vulnerabilità. Se un caricamento è fatto per risolvere il bug prima che l'ID della segnalazione fosse noto, è buona norma aggiornare la voce storica del changelog con il successivo caricamento. Anche in questo caso, Includere tutti i puntatori alle informazioni di fondo nella voce originale del changelog.

source: There are a number of reasons why we ask maintainers to announce their intentions:
it: Ci sono una serie di motivi per cui chiediamo ai maintainer di dichiarare le loro intenzioni:

source: It helps the (potentially new) maintainer to tap into the experience of people on the list, and lets them know if anyone else is working on it already.
it: Aiuta il maintainer (potenzialmente nuovo) ad attingere all'esperienza di persone sulla lista, e permette loro di sapere se qualcun altro sta già lavorando su di esso.

source: It lets other people thinking about working on the package know that there already is a volunteer, so efforts may be shared.
it: Esso consente ad altre persone di pensare se lavorare sul pacchetto sapendo che c'è già un volontario, così gli sforzi possono essere condivisi.

source: It lets the rest of the maintainers know more about the package than the one line description and the usual changelog entry ``Initial release'' that gets posted to &email-debian-devel-changes;.
it: Consente al resto dei maintainer di sapere di più sul pacchetto rispetto alla riga di descrizione e alla solita voce del changelog «Initial release» che viene inviata alla &email-debian-devel-changes;.

source: It is helpful to the people who live off <literal>unstable</literal> (and form our first line of testers). We should encourage these people.
it: È utile per le persone che vivono fuori <literal>unstable</literal> (e che formano la nostra prima linea di tester). Dovremmo incoraggiare queste persone.

source: The announcements give maintainers and other interested parties a better feel of what is going on, and what is new, in the project.
it: Gli annunci danno ai maintainer e ad altre parti interessate una migliore sensazione di ciò che sta accadendo, e cosa c'è di nuovo, nel progetto.

source: Please see <ulink url="https://&ftp-master-host;/REJECT-FAQ.html"></ulink> for common rejection reasons for a new package.
it: Consultare <ulink url="http://&ftp-master-host;/REJECT-FAQ.html"></ulink> sui comuni motivi di rifiuto per un nuovo pacchetto.

source: Recording changes in the package
it: Registrare i cambiamenti nel pacchetto

source: Changes that you make to the package need to be recorded in the <filename>debian/changelog</filename>. These changes should provide a concise description of what was changed, why (if it's in doubt), and note if any bugs were closed. They also record when the package was completed. This file will be installed in <filename>/usr/share/doc/<replaceable>package</replaceable>/changelog.Debian.gz</filename>, or <filename>/usr/share/doc/<replaceable>package</replaceable>/changelog.gz</filename> for native packages.
it: Le modifiche apportate al pacchetto devono essere registrate nel <filename>debian/changelog</filename>. Questi cambiamenti dovrebbero fornire una descrizione concisa di ciò che è stato modificato, del perché (se è in dubbio), e annotare se qualche bug è stato chiuso. Devono anche registrare quando il pacchetto è stato completato. Questo file verrà installato in <filename>/usr/share/doc/<replaceable>package</replaceable>/changelog.Debian.gz</filename>, o <filename>/usr/share/doc/<replaceable>package</replaceable>/changelog.gz</filename> per i pacchetti nativi.

source: The <filename>debian/changelog</filename> file conforms to a certain structure, with a number of different fields. One field of note, the <literal>distribution</literal>, is described in <xref linkend="distribution"/>. More information about the structure of this file can be found in the Debian Policy section titled <filename>debian/changelog</filename>.
it: Il <filename>debian/changelog</filename> si adegua ad una certa struttura, con una serie di campi differenti. Un campo di nota, la <literal>distribuzione</literal>, è descritto in <xref linkend="distribution"/>. Maggiori informazioni sulla struttura di questo file si trovano nella sezione della Debian Policy intitolata <filename>debian/changelog</filename>.

source: Changelog entries can be used to automatically close Debian bugs when the package is installed into the archive. See <xref linkend="upload-bugfix"/>.
it: Le voci del changelog possono essere usate per chiudere automaticamente i bug Debian quando il pacchetto viene installato nell'archivio. Si consulti <xref linkend="upload-bugfix"/>.

source: It is conventional that the changelog entry of a package that contains a new upstream version of the software looks like this:
it: È convenzione che la voce del changelog di un pacchetto che contiene una nuova versione originale del software è la seguente:
