Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: Such bugs are presumed to have an impact on the chances that the package will be released with the <literal>stable</literal> release of Debian: in general, if a package has open release-critical bugs filed on it, it won't get into <literal>testing</literal>, and consequently won't be released in <literal>stable</literal>.
it: Tali bug sono ritenuti avere un impatto sulle possibilità che il pacchetto venga rilasciato con la distribuzione <literal>stable</literal> di Debian: in generale, se un pacchetto ha un bug critico per il rilascio aperto, non sarà integrato in <literal>testing</literal>, e di conseguenza non sarà rilasciato in <literal>stable</literal>.

source: The <literal>unstable</literal> bug count are all release-critical bugs which are marked to apply to <replaceable>package</replaceable>/<replaceable>version</replaceable> combinations that are available in unstable for a release architecture. The <literal>testing</literal> bug count is defined analogously.
it: Il conteggio dei bug in <literal>unstable</literal> sono tutti i bug critici per il rilascio che sono contrassegnati come relativi a combinazioni <replaceable>pacchetto</replaceable>/<replaceable>versione</replaceable> disponibili in unstable per un'architettura di rilascio. Il conteggio dei bug in <literal>testing</literal> è definito in modo analogo.

source: How could installing a package into <literal>testing</literal> possibly break other packages?
it: Come potrebbe l'installazione di un pacchetto in <literal>testing</literal> rendere difettosi altri pacchetti?

source: The structure of the distribution archives is such that they can only contain one version of a package; a package is defined by its name. So when the source package <literal>acmefoo</literal> is installed into <literal>testing</literal>, along with its binary packages <literal>acme-foo-bin</literal>, <literal>acme-bar-bin</literal>, <literal>libacme-foo1</literal> and <literal>libacme-foo-dev</literal>, the old version is removed.
it: La struttura degli archivi di distribuzione è tale che possono contenere solo una versione di un pacchetto; un pacchetto è definito dal suo nome. Così, quando il pacchetto sorgente <literal>acmefoo</literal> è installato in <literal>testing</literal>, insieme con i suoi pacchetti binari <literal>acme-foo-bin</literal>, <literal>acme-bar-bin</literal>, <literal>libacme-foo1</literal> e <literal>libacme-foo-dev</literal>, la versione precedente viene rimossa.

source: However, the old version may have provided a binary package with an old soname of a library, such as <literal>libacme-foo0</literal>. Removing the old <literal>acmefoo</literal> will remove <literal>libacme-foo0</literal>, which will break any packages which depend on it.
it: Tuttavia, la vecchia versione potrebbe aver fornito un pacchetto binario con un vecchio nome di una libreria che è in uso, come <literal>libacme-foo0</literal>. La rimozione del vecchio <literal>acmefoo</literal> rimuoverà <literal>libacme-foo0</literal>, che renderà difettosi tutti i pacchetti che dipendono da essa.

source: Evidently, this mainly affects packages which provide changing sets of binary packages in different versions (in turn, mainly libraries). However, it will also affect packages upon which versioned dependencies have been declared of the ==, &lt;=, or &lt;&lt; varieties.
it: Evidentemente, questo riguarda principalmente i pacchetti che forniscono insiemi diversi di pacchetti binari in versioni differenti (principalmente le librerie). Tuttavia, ne saranno affetti anche i pacchetti verso i quali sono state dichiarate dipendenze con numero di versione (versionate) del tipo ==, &lt;=, or &lt;&lt;

source: When the set of binary packages provided by a source package change in this way, all the packages that depended on the old binaries will have to be updated to depend on the new binaries instead. Because installing such a source package into <literal>testing</literal> breaks all the packages that depended on it in <literal>testing</literal>, some care has to be taken now: all the depending packages must be updated and ready to be installed themselves so that they won't be broken, and, once everything is ready, manual intervention by the release manager or an assistant is normally required.
it: Quando l'insieme di pacchetti binari forniti da un pacchetto sorgente è modificato in questo modo, tutti i pacchetti che dipendevano dai precedenti binari devono essere aggiornati in modo da dipendere dai nuovi. Poiché l'installazione di un pacchetto sorgente in <literal>testing</literal> rende difettosi tutti i pacchetti che ne dipendono in <literal>testing</literal>, in tale momento deve essere posta una certa attenzione: tutti i pacchetti dipendenti devono essere aggiornati e pronti per essere installati in modo da non risultare difettosi, e, una volta che tutto è pronto, è normalmente richiesto un intervento manuale del gestore del rilascio o di un assistente.

source: If you are having problems with complicated groups of packages like this, contact &email-debian-devel; or &email-debian-release; for help.
it: Se si hanno problemi con gruppi complessi di pacchetti come questo, si contatti &email-debian-devel; o &email-debian-release; per un aiuto.

source: Resources for Debian Developers and Debian Maintainers
it: Risorse per sviluppatori e manutentori Debian

source: In this chapter you will find a very brief road map of the Debian mailing lists, the Debian machines which may be available to you as a developer, and all the other resources that are available to help you in your maintainer work.
it: In questo capitolo troverete una breve mappa relativa alle mailing list Debian, delle macchine Debian che possono essere a disposizione degli sviluppatori e di tutte le altre risorse che sono a disposizione per aiutare il maintainer nel suo lavoro.

source: Mailing lists
it: Mailing list

source: Much of the conversation between Debian developers (and users) is managed through a wide array of mailing lists we host at <literal><ulink url="https://&lists-host;/">&lists-host;</ulink></literal>. To find out more on how to subscribe or unsubscribe, how to post and how not to post, where to find old posts and how to search them, how to contact the list maintainers and see various other information about the mailing lists, please read <ulink url="&url-debian-lists;"></ulink>. This section will only cover aspects of mailing lists that are of particular interest to developers.
it: Gran parte delle conversazioni tra gli sviluppatori Debian (e gli utenti) sono gestite attraverso una vasta gamma di mailing list che ospitiamo su <literal><ulink url="https://&lists-host;/">&lists-host;</ulink></literal>. Per saperne di più su come iscriversi o cancellarsi, come inviare e come non inviare, dove trovare vecchi post e come cercarli, come contattare i maintainer delle liste e visionare varie altre informazioni sulle mailing list, leggere <ulink url="&url-debian-lists;"></ulink>. Questa sezione tratterà solo gli aspetti delle mailing list che sono di particolare interesse per gli sviluppatori.

source: Basic rules for use
it: Regole di base per l'utilizzo

source: When replying to messages on the mailing list, please do not send a carbon copy (<literal>CC</literal>) to the original poster unless they explicitly request to be copied. Anyone who posts to a mailing list should read it to see the responses.
it: Quando si risponde ai messaggi della mailing list, non inviare una copia per conoscenza (<literal>CC</literal>) al mittente originale a meno che non lo richiedano esplicitamente. Chiunque invii messaggi ad una mailing list dovrebbe leggerla per vedere le risposte.

source: Cross-posting (sending the same message to multiple lists) is discouraged. As ever on the net, please trim down the quoting of articles you're replying to. In general, please adhere to the usual conventions for posting messages.
it: L'invio incrociato (invio dello stesso messaggio a più mailing list) è sconsigliato. Come sempre in rete, tagliare la citazione di articoli a cui si sta rispondendo. In generale, rispettare le consuete convenzioni per l'invio di messaggi.

source: Please read the <ulink url="&url-debian-lists;#codeofconduct">code of conduct</ulink> for more information. The <ulink url="&url-dcg;">Debian Community Guidelines</ulink> are also worth reading.
it: Si prega di leggere il <ulink url="&url-debian-lists;#codeofconduct">codice di condotta</ulink> per ulteriori informazioni. Vale anche la pena di leggere le <ulink url="&url-dcg;">Debian Community Guidelines</ulink>.

source: Core development mailing lists
it: Mailing list dello sviluppo centrale

source: The core Debian mailing lists that developers should use are:
it: Le principali mailing list Debian che gli sviluppatori dovrebbero utilizzare sono:

source: &email-debian-devel-announce;, used to announce important things to developers. All developers are expected to be subscribed to this list.
it: &email-debian-devel-announce;, usata per annunciare cose importanti per gli sviluppatori. Tutti gli sviluppatori dovrebbero essere iscritti a questa lista.

source: &email-debian-devel;, used to discuss various development related technical issues.
it: &email-debian-devel;, utilizzata per discutere di vari problemi tecnici legati allo sviluppo.

source: &email-debian-policy;, where the Debian Policy is discussed and voted on.
it: &email-debian-policy;, dove vengono discusse e votate le Debian Policy.

source: &email-debian-project;, used to discuss various non-technical issues related to the project.
it: &email-debian-project;, utilizzata per discutere di varie questioni non tecniche legate al progetto.

source: There are other mailing lists available for a variety of special topics; see <ulink url="https://&lists-host;/"></ulink> for a list.
it: Ci sono altre mailing list disponibili per una varietà di particolari argomenti, si consulti <ulink url="https://&lists-host;/"></ulink> per un elenco.

source: Special lists
it: Mailing list speciali

source: &email-debian-private; is a special mailing list for private discussions amongst Debian developers. It is meant to be used for posts which for whatever reason should not be published publicly. As such, it is a low volume list, and users are urged not to use &email-debian-private; unless it is really necessary. Moreover, do <emphasis>not</emphasis> forward email from that list to anyone. Archives of this list are not available on the web for obvious reasons, but you can see them using your shell account on <literal>&master-host;</literal> and looking in the <filename>&file-debian-private-archive;</filename> directory.
it: &email-debian-private; è una mailing list speciale per discussioni private tra gli sviluppatori Debian. È pensata per essere utilizzata per i messaggi che per qualsiasi ragione non dovrebbero essere pubblicati pubblicamente. Come tale, è una lista a basso traffico, e gli utenti sono invitati a non usare &email-debian-private; a meno che non sia veramente necessario. Inoltre, <emphasis>non</emphasis> inoltrare email da tale lista a nessuno. Archivi di questa lista non sono disponibili sul web per ovvie ragioni, ma è possibile vederli usando il proprio account di shell su <literal>&master-host;</literal> e guardando nella directory <filename>&file-debian-private-archive;</filename>.

source: &email-debian-email; is a special mailing list used as a grab-bag for Debian related correspondence such as contacting upstream authors about licenses, bugs, etc. or discussing the project with others where it might be useful to have the discussion archived somewhere.
it: &email-debian-email;, è una mailing list speciale usata come raccogli tutto per la corrispondenza relativa a Debian come per contattare gli autori originali su licenze, bug, etc. o discutere il progetto con altri, nei casi in cui potrebbe essere utile avere la discussione archiviata da qualche parte.

source: Requesting new development-related lists
it: Richiedere nuove liste connesse con lo sviluppo

source: Before requesting a mailing list that relates to the development of a package (or a small group of related packages), please consider if using an alias (via a .forward-aliasname file on master.debian.org, which translates into a reasonably nice <replaceable>you-aliasname@debian.org</replaceable> address) or a self-managed mailing list on <link linkend="alioth">Alioth</link> is more appropriate.
it: Prima di richiedere una mailing list che si riferisce allo sviluppo di un pacchetto (o di un piccolo gruppo di pacchetti correlati), prendere in considerazione se è più appropriato utilizzare l'utilizzo di un alias (tramite un file a.forward-aliasname su master.debian.org, che si traduce in un indirizzo ragionevolmente bello <replaceable>tu-nomealias@debian.org</replaceable>) o una mailing list autogestita su <link linkend="alioth">Alioth</link>.

source: If you decide that a regular mailing list on &lists-host; is really what you want, go ahead and fill in a request, following <ulink url="&url-debian-lists-new;">the HOWTO</ulink>.
it: Se si decide che una mailing list regolare su &lists-host; è davvero ciò che si desidera, si compilii un modulo di richiesta, seguando <ulink url="&url-debian-lists-new;">l'HOWTO</ulink >.

source: IRC channels
it: Canali IRC

source: Several IRC channels are dedicated to Debian's development. They are mainly hosted on the <ulink url="&url-oftc;">Open and free technology community (OFTC)</ulink> network. The <literal>irc.debian.org</literal> DNS entry is an alias to <literal>irc.oftc.net</literal>.
it: Diversi canali IRC sono dedicati allo sviluppo di Debian. Essi sono principalmente ospitati sulla rete <ulink url="&url-oftc;">Open and free technology community (OFTC)</ulink>. La voce DNS <literal>irc.debian.org</literal> è un alias per <literal>irc.oftc.net</literal>.

source: The main channel for Debian in general is <literal>#debian</literal>. This is a large, general-purpose channel where users can find recent news in the topic and served by bots. <literal>#debian</literal> is for English speakers; there are also <literal>#debian.de</literal>, <literal>#debian-fr</literal>, <literal>#debian-br</literal> and other similarly named channels for speakers of other languages.
it: Il principale canale di Debian in generale è <literal>#debian</literal>. Questo è un grande canale generico dove gli utenti possono trovare le notizie recenti nel topic oltre che fornite dai bot. <literal>#debian</literal> è per chi parla inglese, ci sono anche <literal>#debian.de</literal>, <literal>#debian-fr</literal>, <literal>#debian-br</literal> e altri canali con nomi simili per utenti di altre lingue.

source: The main channel for Debian development is <literal>#debian-devel</literal>. It is a very active channel; it will typically have a minimum of 150 people at any time of day. It's a channel for people who work on Debian, it's not a support channel (there's <literal>#debian</literal> for that). It is however open to anyone who wants to lurk (and learn). Its topic is commonly full of interesting information for developers.
it: Il canale principale per lo sviluppo di Debian è <literal>#debian-devel</literal>. È un canale molto attivo; in genere avrà un minimo di 150 persone in ogni momento della giornata. È un canale per le persone che lavorano su Debian, non è un canale di supporto (c'è <literal>#debian</literal> per quello). È comunque aperto a chiunque voglia dare un'occhiata (e imparare). Il suo topic è generalmente pieno di informazioni interessanti per gli sviluppatori.

source: Since <literal>#debian-devel</literal> is an open channel, you should not speak there of issues that are discussed in &email-debian-private;. There's another channel for this purpose, it's called <literal>#debian-private</literal> and it's protected by a key. This key is available at <filename>master.debian.org:&file-debian-private-key;</filename>.
it: Siccome <literal>#debian-devel</literal> è un canale aperto, non si dovrebbe parlare di problemi che vengono discussi in &email-debian-private;. C'è un altro canale per questo scopo, si chiama <literal>#debian-private</literal> ed è protetto da una chiave. Questa chiave è disponibile presso <filename>master.debian.org:&file-debian-private-key;</filename>.

source: There are other additional channels dedicated to specific subjects. <literal>#debian-bugs</literal> is used for coordinating bug squashing parties. <literal>#debian-boot</literal> is used to coordinate the work on the debian-installer. <literal>#debian-doc</literal> is occasionally used to talk about documentation, like the document you are reading. Other channels are dedicated to an architecture or a set of packages: <literal>#debian-kde</literal>, <literal>#debian-dpkg</literal>, <literal>#debian-jr</literal>, <literal>#debian-edu</literal>, <literal>#debian-oo</literal> (OpenOffice.org package)...
it: Ci sono altri canali aggiuntivi dedicati a temi specifici. <literal>#debian-bugs</literal> è usato per coordinare le feste di bug squashing. <literal>#debian-boot</literal> è usato per coordinare il lavoro sul debian-installer. <literal>#debian-doc</literal> è usato occasionalmente per parlare di documentazione, come il documento che si sta leggendo. Altri canali sono dedicati ad una architettura o ad un insieme di pacchetti: <literal>#debian-kde</literal>, <literal>#debian-dpkg</literal>, <literal>#debian-jr</literal>, <literal>#debian-edu</literal>, <literal>#debian-oo</literal> (pacchetto OpenOffice.org)...

source: Some non-English developers' channels exist as well, for example <literal>#debian-devel-fr</literal> for French speaking people interested in Debian's development.
it: Esistono anche alcuni canali di sviluppatori non inglesi, per esempio <literal>#debian-devel-fr</literal> per le persone di lingua francese interessate allo sviluppo di Debian.

source: Channels dedicated to Debian also exist on other IRC networks, notably on the <ulink url="&url-openprojects;">freenode</ulink> IRC network, which was pointed at by the <literal>irc.debian.org</literal> alias until 4th June 2006.
it: Canali dedicati a Debian esistono anche su altre reti IRC, in particolare sulla rete IRC <ulink url="&url-openprojects;">freenode</ulink>, a cui puntava l'alias <literal>irc.debian.org</literal> fino al 4 giugno 2006.

source: To get a cloak on freenode, you send Jörg Jaspert &lt;joerg@debian.org&gt; a signed mail where you tell what your nick is. Put cloak somewhere in the Subject: header. The nick should be registered: <ulink url="https://freenode.net/faq.shtml#nicksetup">Nick Setup Page</ulink>. The mail needs to be signed by a key in the Debian keyring. Please see <ulink url="https://freenode.net/faq.shtml#projectcloak">Freenode documentation</ulink> for more information about cloaks.
it: Per ottenere un copertura su freenode, si invii a Jörg Jasper &lt;joerg@debian.org&gt; una email firmata dove si indica il proprio nick. Mettere la parola «cloak» da qualche parte nel campo Oggetto:. Il nick deve essere registrato: <ulink url="https://freenode.net/faq.shtml#nicksetup">Pagina sull'impostazione dei nick</ulink>. La posta deve essere firmata da una chiave nel portachiavi Debian. Si consulti la <ulink url="https://freenode.net/faq.shtml#projectcloak">Freenode documentation</ulink> per ulteriori informazioni sulla copertura.

source: This document contains a lot of information which is useful to Debian developers, but it cannot contain everything. Most of the other interesting documents are linked from <ulink url="&url-devel-docs;">The Developers' Corner</ulink>. Take the time to browse all the links, you will learn many more things.
it: Questo documento contiene molte informazioni utili per gli sviluppatori Debian, ma non può contenere tutto. La maggior parte degli altri documenti interessanti sono indicati nell'<ulink url="&url-devel-docs;">Angolo degli sviluppatori</ulink>. Prendetevi il tempo di sfogliare tutti i collegamenti, imparerete molte più cose.

source: Debian machines
it: Le macchine Debian

source: Debian has several computers working as servers, most of which serve critical functions in the Debian project. Most of the machines are used for porting activities, and they all have a permanent connection to the Internet.
it: Debian ha diversi computer che lavorano come server, molti dei quali utilizzati per le funzioni critiche del progetto Debian. La maggior parte delle macchine sono utilizzate per le attività di port e tutte hanno una connessione permanente a Internet.

source: Some of the machines are available for individual developers to use, as long as the developers follow the rules set forth in the <ulink url="&url-dmup;">Debian Machine Usage Policies</ulink>.
it: Alcune delle macchine sono disponibili per essere utilizzate da singoli sviluppatori, a patto che gli seguano le regole stabilite nella <ulink url="&url-dmup;">Policy Debian per l'utilizzo delle macchine</ulink>.

source: Generally speaking, you can use these machines for Debian-related purposes as you see fit. Please be kind to system administrators, and do not use up tons and tons of disk space, network bandwidth, or CPU without first getting the approval of the system administrators. Usually these machines are run by volunteers.
it: In generale, è possibile utilizzare queste macchine come meglio si crede per scopi relativi a Debian. Essere gentili con gli amministratori di sistema, e di non utilizzare tonnellate e tonnellate di spazio su disco, larghezza di banda, o CPU senza prima ottenere l'approvazione degli amministratori di sistema. Di solito queste macchine sono gestite da volontari.

source: Please take care to protect your Debian passwords and SSH keys installed on Debian machines. Avoid login or upload methods which send passwords over the Internet in the clear, such as Telnet, FTP, POP etc.
it: Fare attenzione a proteggere le proprie password e le chiavi SSH Debian installate sulle macchine Debian. Evitare il login o metodi di caricamento che inviano le password su Internet in chiaro, come Telnet, FTP, POP, etc.

source: Please do not put any material that doesn't relate to Debian on the Debian servers, unless you have prior permission.
it: Non inserire alcun materiale che non riguarda Debian sui server Debian, se non è stato prima ottenuto il permesso.

source: The current list of Debian machines is available at <ulink url="&url-devel-machines;"></ulink>. That web page contains machine names, contact information, information about who can log in, SSH keys etc.
it: L'elenco attuale delle macchine Debian è disponibile presso <ulink url="&url-devel-machines;"></ulink>. Quella pagina web contiene i nomi delle macchine, informazioni di contatto, informazioni su chi può accedere, le chiavi SSH, etc.
