Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: If you have a problem with the operation of a Debian server, and you think that the system operators need to be notified of this problem, you can check the list of open issues in the DSA (Debian System Administration) Team's queue of our request tracker at <ulink url="&url-rt;" /> (you can login with user "debian", its password is available at <filename>master.debian.org:&file-debian-rt-password;</filename>). To report a new problem in the request tracker, simply send a mail to &email-rt-dsa; and make sure to put the string "Debian RT" somewhere in the subject. To contact the DSA team by email, use <email>dsa@debian.org</email> for anything that contains private or privileged information and should not be made public, and <email>debian-admin@lists.debian.org</email> otherwise. The DSA team is also present on the <literal>#debian-admin</literal> IRC channel on OFTC.
it: Se si ha un problema con il funzionamento di un server Debian, e si pensa che i gestori del sistema devono essere avvisati di ciò, è possibile consultare l'elenco dei problemi aperti nella coda DSA del nostro sistema di tracciamento delle richieste all'indirizzo <ulink url="&url-rt;" /> (si può effettuare il login con user «debian», la cui password è disponibile su <filename>master.debian.org:&file-debian-rt-password;</filename>). Per segnalare un nuovo problema, è sufficiente inviare una email all'indirizzo &email-rt-dsa; e fare in modo di mettere la stringa «Debian RT» in qualche parte nell'oggetto.

source: If you have a problem with a certain service, not related to the system administration (such as packages to be removed from the archive, suggestions for the web site, etc.), generally you'll report a bug against a ``pseudo-package''. See <xref linkend="submit-bug"/> for information on how to submit bugs.
it: Se si ha un problema con un certo servizio, non legato all'amministrazione del sistema (come ad esempio i pacchetti da rimuovere dall'archivio, suggerimenti per il sito web, etc.), generalmente si segnala un bug su uno «pseudo-pacchetto». Per informazioni su come segnalare bug si consulti <xref linkend="submit-bug"/>.

source: Some of the core servers are restricted, but the information from there is mirrored to another server.
it: Alcuni dei server centrali sono riservati, ma le informazioni sono duplicate su un altro server.

source: The bugs server
it: Il server dei bug

source: <literal>&bugs-host;</literal> is the canonical location for the Bug Tracking System (BTS).
it: <literal>&bugs-host;</literal> è il percorso canonico per il Bug Tracking System (BTS).

source: If you plan on doing some statistical analysis or processing of Debian bugs, this would be the place to do it. Please describe your plans on &email-debian-devel; before implementing anything, however, to reduce unnecessary duplication of effort or wasted processing time.
it: Se si ha intenzione di fare un po' di analisi statistiche o qualche elaborazione dei dati sui bug Debian, questo sarebbe il posto per farlo. Tuttavia si descrivano le intenzioni su &email-debian-devel; prima di attuare qualsiasi cosa, per ridurre inutili duplicazioni di attività o di tempo di elaborazione sprecato.

source: The ftp-master server
it: Il server ftp-master

source: The <literal>&ftp-master-host;</literal> server holds the canonical copy of the Debian archive. Generally, package uploaded to &ftp-upload-host; end up on this server, see <xref linkend="upload"/>.
it: Il server <literal>&ftp-master-host;</literal> contiene la copia canonica dell'archivio Debian. In generale, il pacchetto caricato su &ftp-upload-host; finisce su questo server, si consulti <xref linkend="upload"/>.

source: It is restricted; a mirror is available on <literal>&ftp-master-mirror;</literal>.
it: È riservato; un server specchio è disponibile su <literal>&ftp-master-mirror;</literal>.

source: Problems with the Debian FTP archive generally need to be reported as bugs against the <systemitem role="package">&ftp-debian-org;</systemitem> pseudo-package or an email to &email-ftpmaster;, but also see the procedures in <xref linkend="archive-manip"/>.
it: I problemi con l'archivio FTP Debian generalmente necessitano di essere segnalati come bug nei confronti dello pseudo-pacchetto <systemitem role="package">&ftp-debian-org;</systemitem> o attraverso una email a &email-ftpmaster;, ma si consultino anche le procedure in <xref linkend="archive-manip"/>.

source: The www-master server
it: Il server www-master

source: The main web server is <literal>www-master.debian.org</literal>. It holds the official web pages, the face of Debian for most newbies.
it: Il server web principale è <literal>www-master.debian.org</literal>. Contiene le pagine web ufficiali, il volto di Debian per la maggior parte dei neofiti.

source: If you find a problem with the Debian web server, you should generally submit a bug against the pseudo-package, <systemitem role="package">www.debian.org</systemitem>. Remember to check whether or not someone else has already reported the problem to the <ulink url="https://&bugs-host;/&www-debian-org;">Bug Tracking System</ulink>.
it: Se si trova un problema con il server web di Debian, si dovrebbe generalmente segnalare un bug nei confronti dello pseudo-pacchetto <systemitem role="package">www.debian.org</systemitem>. Ricordarsi di controllare se qualcun altro ha già segnalato il problema al <ulink url="http://&bugs-host;/&www-debian-org;">Sistema di tracciamento dei bug</ulink>.

source: The people web server
it: Il web server persone

source: <literal>people.debian.org</literal> is the server used for developers' own web pages about anything related to Debian.
it: <literal>people.debian.org</literal> è il server utilizzato per creare pagine web personali degli sviluppatori su qualsiasi cosa relativa a Debian.

source: If you have some Debian-specific information which you want to serve on the web, you can do this by putting material in the <filename>public_html</filename> directory under your home directory on <literal>people.debian.org</literal>. This will be accessible at the URL <literal>https://people.debian.org/~<replaceable>your-user-id</replaceable>/</literal>.
it: Se si dispone di alcune informazioni specifiche di Debian che si vuole fornire sul web, è possibile farlo mettendo il materiale nella cartella <filename>public_html</filename> sotto la propria cartella home su <literal>people.debian.org</literal>. Questa sarà accessibile all'URL <literal>http://people.debian.org/~<replaceable>proprio-user-id</replaceable>/</literal>.

source: You should only use this particular location because it will be backed up, whereas on other hosts it won't.
it: Si consiglia di utilizzare solo questa particolare posizione, perché ne verrà eseguito il backup, mentre su altri host no.

source: Usually the only reason to use a different host is when you need to publish materials subject to the U.S. export restrictions, in which case you can use one of the other servers located outside the United States.
it: Di solito l'unica ragione per usare un host diverso è quando si ha bisogno di pubblicare materiali soggetti a restrizioni sull'esportazione degli Stati Uniti, nel qual caso è possibile utilizzare uno degli altri server situati al di fuori degli Stati Uniti.

source: Send mail to &email-debian-devel; if you have any questions.
it: Si invii una email a &email-debian-devel; se si hanno domande.

source: The VCS servers
it: I server VCS

source: If you need to use a Version Control System for any of your Debian work, you can use one of the existing repositories hosted on Alioth (e.g. inside the collab-maint project) or you can request a new project and ask for the VCS repository of your choice. Alioth supports CVS (cvs.alioth.debian.org/cvs.debian.org), Subversion (svn.debian.org), Arch (tla/baz, both on arch.debian.org), Bazaar (bzr.debian.org), Darcs (darcs.debian.org), Mercurial (hg.debian.org) and Git (git.debian.org). Checkout <ulink url="&url-alioth-pkg;" /> if you plan to maintain packages in a VCS repository. See <xref linkend="alioth"/> for information on the services provided by Alioth.
it: Se è necessario utilizzare un sistema di controllo di versione per qualsiasi tipo di lavoro per Debian, è possibile utilizzare uno dei repository esistenti ospitati su Alioth oppure si può richiedere un nuovo progetto e chiedere il repository VCS che si preferisce. Alioth supporta CVS (cvs.alioth.debian.org/cvs.debian.org), Subversion (svn.debian.org), Arco (tla/baz, sia su arch.debian.org), Bazar (bzr.debian.org), Darcs (darcs.debian.org), Mercurial (hg.debian.org) e Git (git.debian.org). Controllare la pagina web <ulink url="&url-alioth-pkg;" /> se si prevede di mantenere pacchetti in un repository VCS. Per informazioni sui servizi forniti da Alioth si consulti <xref linkend="alioth"/>.

source: chroots to different distributions
it: chroot per diverse distribuzioni

source: On some machines, there are chroots to different distributions available. You can use them like this:
it: Su alcune macchine, ci sono chroot disponibili per differenti distribuzioni. Si possono utilizzare in questo modo:

source: In all chroots, the normal user home directories are available. You can find out which chroots are available via <ulink url="&url-devel-machines;"></ulink>.
it: In tutti i chroot, sono disponibili le normali cartelle home degli utenti. Si possono scoprire quali chroot sono disponibili tramite <ulink url="&url-devel-machines;"></ulink>.

source: The Developers Database
it: Il Database degli sviluppatori

source: The Developers Database, at <ulink url="&url-debian-db;"></ulink>, is an LDAP directory for managing Debian developer attributes. You can use this resource to search the list of Debian developers. Part of this information is also available through the finger service on Debian servers, try <command>finger yourlogin@db.debian.org</command> to see what it reports.
it: Il Database degli svulippatori, su <ulink url="&url-debian-db;"></ulink>, è una cartella LDAP per la gestione di attributi degli sviluppatori Debian. È possibile utilizzare questa risorsa per cercare nell'elenco degli sviluppatori Debian. Parte di queste informazioni sono disponibili anche attraverso il servizio finger sui server Debian, si provi <command>finger propriologin@db.debian.org</command> per vedere cosa riporta.

source: Developers can <ulink url="&url-debian-db-login;">log into the database</ulink> to change various information about themselves, such as:
it: Gli sviluppatori possono <ulink url="&url-debian-db-login;">autenticarsi al database</ulink> per cambiare varie informazioni su se stessi, come ad esempio:

source: forwarding address for your debian.org email
it: indirizzo a cui inoltrare la posta elettronica debian.org

source: subscription to debian-private
it: sottoscrizione a debian-private

source: whether you are on vacation
it: se si è in vacanza

source: personal information such as your address, country, the latitude and longitude of the place where you live for use in <ulink url="&url-worldmap;">the world map of Debian developers</ulink>, phone and fax numbers, IRC nickname and web page
it: informazioni personali, come il proprio indirizzo, la nazione, la latitudine e la longitudine del luogo in cui si vive per l'uso nella <ulink url="&url-worldmap;">mappa del mondo degli sviluppatori Debian</ulink>, telefono e fax, IRC nickname e pagina web

source: password and preferred shell on Debian Project machines
it: la password e la shell preferita su macchine del progetto Debian

source: Most of the information is not accessible to the public, naturally. For more information please read the online documentation that you can find at <ulink url="&url-debian-db-doc;"></ulink>.
it: La maggior parte delle informazioni non sono accessibili al pubblico, ovviamente. Per ulteriori informazioni leggere la documentazione online che si può trovare su <ulink url="&url-debian-db-doc;"></ulink>.

source: Developers can also submit their SSH keys to be used for authorization on the official Debian machines, and even add new *.debian.net DNS entries. Those features are documented at <ulink url="&url-debian-db-mail-gw;"></ulink>.
it: Gli sviluppatori possono inoltre inviare le loro chiavi SSH per essere utilizzate per l'autorizzazione sulle macchine ufficiali di Debian, e persino aggiungere nuove voci DNS *.debian.net. Tali caratteristiche sono documentate su <ulink url="&url-debian-db-mail-gw;"></ulink>.

source: The Debian archive
it: L'archivio Debian

source: The &debian-formal; distribution consists of a lot of packages (currently around &number-of-pkgs; source packages) and a few additional files (such as documentation and installation disk images).
it: La distribuzione &debian-formal; è composta da molti pacchetti (attualmente circa &number-of-pkgs; pacchetti sorgente) e alcuni file aggiuntivi (come ad esempio la documentazione e le immagini del disco di installazione).

source: Here is an example directory tree of a complete Debian archive:
it: Ecco un esempio di albero di cartelle di un archivio completo di Debian:

source: As you can see, the top-level directory contains two directories, <filename>dists/</filename> and <filename>pool/</filename>. The latter is a “pool” in which the packages actually are, and which is handled by the archive maintenance database and the accompanying programs. The former contains the distributions, <literal>stable</literal>, <literal>testing</literal> and <literal>unstable</literal>. The <filename>Packages</filename> and <filename>Sources</filename> files in the distribution subdirectories can reference files in the <filename>pool/</filename> directory. The directory tree below each of the distributions is arranged in an identical manner. What we describe below for <literal>stable</literal> is equally applicable to the <literal>unstable</literal> and <literal>testing</literal> distributions.
it: Come si può vedere, la cartella di livello superiore contiene due cartelle, <filename>dists/</filename> e <filename>pool/</filename>. Quest'ultimo è un «punto di raccolta» in cui si trovano effettivamente i pacchetti e che è gestito dal database di manutenzione dell'archivio e dai programmi di accompagnamento. La prima contiene le distribuzioni, <literal>stable</literal>, <literal>testing</literal> e <literal>unstable</literal>. I file <filename>Packages</filename> e <filename>Sources</filename> delle sottocartelle di distribuzione possono fare riferimento ai file in <filename>pool/</filename>. L'albero delle cartelle sotto ciascuna delle distribuzioni è disposto in modo identico. Ciò che viene descritto qui di seguito per <literal>stable</literal> è ugualmente applicabile alle distribuzioni <literal>unstable</literal> e <literal>testing</literal>.

source: <filename>dists/stable</filename> contains three directories, namely <filename>main</filename>, <filename>contrib</filename>, and <filename>non-free</filename>.
it: <filename>dists/stable</filename> contiene tre cartelle e cioè <filename>main</filename>, <filename>contrib</filename> e <filename>non-free</filename>.

source: In each of the areas, there is a directory for the source packages (<filename>source</filename>) and a directory for each supported architecture (<filename>binary-i386</filename>, <filename>binary-amd64</filename>, etc.).
it: In ciascuna delle aree, vi è una cartella per i pacchetti sorgente (<filename>source</filename>) e una cartella per ogni architettura supportata (<filename>binary-i386</filename>, <filename>binary-amd64</filename>, etc.).

source: The <filename>main</filename> area contains additional directories which hold the disk images and some essential pieces of documentation required for installing the Debian distribution on a specific architecture (<filename>disks-i386</filename>, <filename>disks-amd64</filename>, etc.).
it: L'area <filename>main</filename> contiene altre cartelle che contengono le immagini del disco e alcuni pezzi essenziali della documentazione necessari per l'installazione della distribuzione Debian su una specifica architettura (<filename>disk-i386</filename>, <filename>disk-amd64</filename>, etc.).

source: Sections
it: Sezioni

source: The <literal>main</literal> section of the Debian archive is what makes up the <emphasis role="strong">official &debian-formal; distribution</emphasis>. The <literal>main</literal> section is official because it fully complies with all our guidelines. The other two sections do not, to different degrees; as such, they are <emphasis role="strong">not</emphasis> officially part of &debian-formal;.
it: La sezione <literal>main</literal> dell'archivio Debian è ciò che costituisce <emphasis role="strong">ufficiale la distribuzione &debian-formal;</emphasis>. La sezione <literal>main</literal> è ufficiale perché soddisfa pienamente tutte le nostre linee guida. Le altre due sezioni no, a gradi diversi; in quanto tali, esse <emphasis role="strong">non</emphasis> sono ufficialmente parte di &debian-formal;.

source: Every package in the main section must fully comply with the <ulink url="&url-dfsg;">Debian Free Software Guidelines</ulink> (DFSG) and with all other policy requirements as described in the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>. The DFSG is our definition of “free software.” Check out the Debian Policy Manual for details.
it: Ogni pacchetto nella sezione main deve soddisfare le <ulink url="&url-dfsg;">Linee guida Debian per il sofware libero</ulink> (DFSG) e tutti gli altri requisiti delle policy come descritto nel <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>. Le DFSG sono la nostra definizione del «software libero». Si controlli il Debian Policy Manual per maggiori dettagli.

source: Packages in the <literal>contrib</literal> section have to comply with the DFSG, but may fail other requirements. For instance, they may depend on non-free packages.
it: I pacchetti nella sezione <literal>contrib</literal> sono tenuti a rispettare le DFSG, ma possono non soddisfare altri requisiti. Ad esempio, possono dipendere da pacchetti non-free.

source: Packages which do not conform to the DFSG are placed in the <literal>non-free</literal> section. These packages are not considered as part of the Debian distribution, though we enable their use, and we provide infrastructure (such as our bug-tracking system and mailing lists) for non-free software packages.
it: I pacchetti che non sono conformi alle DFSG sono collocati nella sezione <literal>non-free</literal>. Questi pacchetti non sono considerati come parte della distribuzione Debian, anche se è consentito il loro uso, e vengono messe a disposizione le infrastrutture (ad esempio, il sistema di tracciamento dei bug e mailing list) per i pacchetti software non-free.

source: The <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> contains a more exact definition of the three sections. The above discussion is just an introduction.
it: Il <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> contiene una definizione più precisa delle tre sezioni. La discussione di cui sopra è solo un'introduzione.

source: The separation of the three sections at the top-level of the archive is important for all people who want to distribute Debian, either via FTP servers on the Internet or on CD-ROMs: by distributing only the <literal>main</literal> and <literal>contrib</literal> sections, one can avoid any legal risks. Some packages in the <literal>non-free</literal> section do not allow commercial distribution, for example.
it: La separazione delle tre sezioni al livello più alto di archivio è importante per tutte le persone che vogliono distribuire Debian, sia tramite server FTP su Internet sia su CD-ROM: distribuendo solo le sezioni <literal>main</literal> e <literal>contrib</literal>, si possono evitare eventuali rischi legali. Alcuni pacchetti nella sezione <literal>non-free</literal> non permettono la distribuzione commerciale, per esempio.

source: On the other hand, a CD-ROM vendor could easily check the individual package licenses of the packages in <literal>non-free</literal> and include as many on the CD-ROMs as it's allowed to. (Since this varies greatly from vendor to vendor, this job can't be done by the Debian developers.)
it: D'altra parte, un venditore di CD-ROM potrebbe controllare facilmente le singole licenze dei pacchetti presenti in <literal>non-free</literal> e includere nel CD-ROM il maggior numero consentito. (Dal momento che questo varia da fornitore a fornitore, questo lavoro non può essere fatto dagli sviluppatori Debian.)

source: Note that the term section is also used to refer to categories which simplify the organization and browsing of available packages, e.g. <literal>admin</literal>, <literal>net</literal>, <literal>utils</literal> etc. Once upon a time, these sections (subsections, rather) existed in the form of subdirectories within the Debian archive. Nowadays, these exist only in the Section header fields of packages.
it: Si noti che il termine sezione è usato anche per riferirsi a categorie che semplificano l'organizzazione e la navigazione di pacchetti disponibili, ad esempio <literal>admin</literal>, <literal>net</literal>, <literal>utils</literal>, etc. Tempo fa, queste sezioni (sottosezioni, piuttosto) esistevano in forma di sottocartelle all'interno dell'archivio Debian. Al giorno d'oggi, queste esistono solo nei campi Section delle intestazioni dei pacchetti.

source: Architectures
it: Le architetture

source: In the first days, the Linux kernel was only available for Intel i386 (or greater) platforms, and so was Debian. But as Linux became more and more popular, the kernel was ported to other architectures and Debian started to support them. And as if supporting so much hardware was not enough, Debian decided to build some ports based on other Unix kernels, like <literal>hurd</literal> and <literal>kfreebsd</literal>.
it: I primi tempi, il kernel Linux era disponibile solo per le piattaforme Intel i386 (o superiore), e così è stato per Debian. Ma, man mano che Linux è diventato sempre più popolare, il kernel è stato portato su altre architetture e Debian iniziò a supportarle. E siccome sostenere così tanto hardware non fosse abbastanza, Debian ha deciso di costruire alcuni port sulla base di altri kernel Unix, come <literal>hurd</literal> e <literal>kFreeBSD</literal>.
