Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: There are tools to help you create entries and finalize the <filename>changelog</filename> for release — see <xref linkend="devscripts"/> and <xref linkend="dpkg-dev-el"/>.
it: Ci sono strumenti che consentono di creare voci e di finalizzare il <filename>changelog</filename> per la stampa - si consulti <xref linkend="devscripts"/> e <xref linkend="dpkg-dev-el"/>.

source: See also <xref linkend="bpp-debian-changelog"/>.
it: Si consulti anche <xref linkend="bpp-debian-changelog"/>.

source: Testing the package
it: Testare del pacchetto

source: Before you upload your package, you should do basic testing on it. At a minimum, you should try the following activities (you'll need to have an older version of the same Debian package around):
it: Prima di caricare il proprio pacchetto, si dovrebbe fare dei test di base su di esso. Come minimo, si dovrebbe provare le seguenti attività (è necessario avere una versione precedente dello stesso pacchetto Debian in giro):

source: Install the package and make sure the software works, or upgrade the package from an older version to your new version if a Debian package for it already exists.
it: Installare il pacchetto e assicurarsi che il software funzioni, o aggiornare il pacchetto da una versione precedente alla nuova versione, se già esiste un pacchetto Debian.

source: Run <command>lintian</command> over the package. You can run <command>lintian</command> as follows: <literal>lintian -v <replaceable>package-version</replaceable>.changes</literal>. This will check the source package as well as the binary package. If you don't understand the output that <command>lintian</command> generates, try adding the <literal>-i</literal> switch, which will cause <command>lintian</command> to output a very verbose description of the problem.
it: Eseguite <command>lintian</command> sul pacchetto. È possibile eseguire <command>lintian</command> come segue: <literal>lintian -v <replaceable>versione-pacchetto</replaceable>.changes</literal>. Questo controllerà il pacchetto sorgente, così come il pacchetto binario. Se non si comprendono i risultati che <command>lintian</command> genera, provare ad aggiungere il commutatore <literal>-i</literal>, che farà produrre a <command>lintian</command> una descrizione molto dettagliata del problema.

source: Normally, a package should <emphasis>not</emphasis> be uploaded if it causes <command>lintian</command> to emit errors (they will start with <literal>E</literal>).
it: Normalmente, un pacchetto <emphasis>non</emphasis> dovrebbe essere caricato se provoca a <command>lintian</command> di emettere errori (inizieranno con <literal>E</literal>).

source: For more information on <command>lintian</command>, see <xref linkend="lintian"/>.
it: Per maggiori informazioni su <command>lintian</command>, si consulti <xref linkend="lintian"/>.

source: Optionally run <command>debdiff</command> (see <xref linkend="debdiff"/>) to analyze changes from an older version, if one exists.
it: Facoltativamente eseguite <command>debdiff</command> (si consulti <xref linkend="debdiff"/>) per analizzare i cambiamenti da una versione precedente, se ne esiste una.

source: Downgrade the package to the previous version (if one exists) — this tests the <filename>postrm</filename> and <filename>prerm</filename> scripts.
it: Degradare il pacchetto alla versione precedente (se esistente): questo prova gli script di <filename>postrm</filename> e di <filename>prerm</filename>.

source: Remove the package, then reinstall it.
it: Rimuovete il pacchetto, quindi reinstallarlo.

source: Copy the source package in a different directory and try unpacking it and rebuilding it. This tests if the package relies on existing files outside of it, or if it relies on permissions being preserved on the files shipped inside the <filename>.diff.gz</filename> file.
it: Copiare il pacchetto sorgente in una cartella diversa e provare a spacchettarlo ed a ricompilarlo. Questo testa se il pacchetto si basa su file esistenti al di fuori di esso, o se si basa su permessi che sono stati conservati sui file distribuiti all'interno del <filename>.diff.gz</filename>.

source: Layout of the source package
it: Struttura del pacchetto sorgente

source: There are two types of Debian source packages:
it: Ci sono due tipi di pacchetto sorgente Debian:

source: the so-called <literal>native</literal> packages, where there is no distinction between the original sources and the patches applied for Debian
it: i cosiddetti pacchetti <literal>nativi</literal>, dove non c'è distinzione tra i sorgenti originali e le patch applicate per Debian

source: the (more common) packages where there's an original source tarball file accompanied by another file that contains the changes made by Debian
it: i (più comuni) pacchetti dove c'è un file di archivio dei sorgenti originali accompagnato da un altro file che contiene le modifiche apportate da Debian

source: For the native packages, the source package includes a Debian source control file (<filename>.dsc</filename>) and the source tarball (<filename>.tar.{gz,bz2,xz}</filename>). A source package of a non-native package includes a Debian source control file, the original source tarball (<filename>.orig.tar.{gz,bz2,xz}</filename>) and the Debian changes (<filename>.diff.gz</filename> for the source format “1.0” or <filename>.debian.tar.{gz,bz2,xz}</filename> for the source format “3.0 (quilt)”).
it: Per i pacchetti nativi, il pacchetto sorgente include un file di controllo del codice sorgente Debian (<filename>.dsc</filename>) e l'archivio dei sorgenti (<filename>.tar.{gz,bz2,xz}</filename>). Un pacchetto sorgente di un pacchetto non nativo include un file Debian di controllo sorgenti, l'archivio dei sorgenti originali (<filename>.orig.tar.{gz,bz2,xz}</filename>) e le modifiche Debian (<filename>.diff.gz</filename> per il formato sorgente «1.0» o <filename>.debian.tar.{gz,bz2,xz} </filename> per il formato sorgente «3.0 (quilt)»).

source: With source format “1.0”, whether a package is native or not was determined by <command>dpkg-source</command> at build time. Nowadays it is recommended to be explicit about the desired source format by putting either “3.0 (quilt)” or “3.0 (native)” in <filename>debian/source/format</filename>. The rest of this section relates only to non-native packages.
it: Con il formato dei sorgenti «1.0», se un pacchetto è nativo o non è stato determinato da <command>dpkg-source</command> al momento della compilazione. Al giorno d'oggi, si raccomanda di essere espliciti sul formato sorgente desiderato mettendo entrambi «3.0 (quilt)» o «3.0 (nativo)» in <filename>debian/source/format</filename>. Il resto di questa sezione riguarda solo i pacchetti non-nativi.

source: The first time a version is uploaded which corresponds to a particular upstream version, the original source tar file should be uploaded and included in the <filename>.changes</filename> file. Subsequently, this very same tar file should be used to build the new diffs and <filename>.dsc</filename> files, and will not need to be re-uploaded.
it: La prima volta che viene caricata una versione che corrisponde ad una particolare versione originale, il file tar dei sorgenti originali deve essere caricato e incluso nel <filename>.changes</filename>. In seguito, questo stesso file tar deve essere utilizzato per costruire i nuovi file diff e <filename>.dsc</filename>, e non avrà bisogno di essere nuovamente caricato.

source: By default, <command>dpkg-genchanges</command> and <command>dpkg-buildpackage</command> will include the original source tar file if and only if the current changelog entry has a different upstream version from the preceding entry. This behavior may be modified by using <literal>-sa</literal> to always include it or <literal>-sd</literal> to always leave it out.
it: Per impostazione predefinita, <command>dpkg-genchanges</command> e <command>dpkg-buildpackage</command> includerà il file tar dei sorgenti originali, se e solo se l'attuale voce del changelog ha una versione originale diversa dalla voce precedente. Questo comportamento può essere modificato utilizzando <literal>-sa</literal> per includere sempre o <literal>-sd</literal> per lasciarlo sempre fuori.

source: If no original source is included in the upload, the original source tar-file used by <command>dpkg-source</command> when constructing the <filename>.dsc</filename> file and diff to be uploaded <emphasis>must</emphasis> be byte-for-byte identical with the one already in the archive.
it: Se nessun sorgente originale è incluso nel caricamento, il file tar dei sorgenti originali utilizzato da <command>dpkg-source</command> quando fu costruito il file <filename>.dsc</filename> e diff da caricare <emphasis>deve</emphasis> essere del tutto identico a quello già presente in archivio.

source: Please notice that, in non-native packages, permissions on files that are not present in the <filename>*.orig.tar.{gz,bz2,xz}</filename> will not be preserved, as diff does not store file permissions in the patch. However when using source format “3.0 (quilt)”, permissions of files inside the <filename>debian</filename> directory are preserved since they are stored in a tar archive.
it: Notare che, in pacchetti non nativi, i permessi per i file che non sono presenti nel <filename>*.orig.tar.{gz,bz2,xz}</filename> non saranno conservati, così come diff non memorizza i permessi dei file nella patch. Tuttavia, quando si usa il formato sorgente «3.0 (quilt)», i permessi dei file all'interno della cartella <filename>debian</filename> sono conservati dal momento che sono memorizzati in un archivio tar.

source: Picking a distribution
it: Scegliere una distribuzione

source: Each upload needs to specify which distribution the package is intended for. The package build process extracts this information from the first line of the <filename>debian/changelog</filename> file and places it in the <literal>Distribution</literal> field of the <filename>.changes</filename> file.
it: Ogni caricamento deve specificare a quale distribuzione il pacchetto è destinato. Il processo di compilazione del pacchetto estrae questa informazione dalla prima riga del <filename>debian/changelog</filename> e la inserisce nel campo <literal>Distribution</literal> del file <filename>.changes</filename>.

source: Packages are normally uploaded into <literal>unstable</literal>. Uploads to <literal>unstable</literal> or <literal>experimental</literal> should use these suite names in the changelog entry; uploads for other supported suites should use the suite codenames, as they avoid any ambiguity.
it: I pacchetti sono generalmente caricati in <literal>unstable</literal>. I caricamenti in <literal>unstable</literal> o <literal>experimental</literal> dovrebbero utilizzare questi nomi nelle voci del changelog; caricamenti per altre suite dovrebbero utlizzare il nome della suite, in modo da evitare ambiguità.

source: Actually, there are other possible distributions: <replaceable>codename</replaceable><literal>-security</literal>, but read <xref linkend="bug-security"/> for more information on those.
it: In realtà, ci sono altre due possibili distribuzioni: <literal>stable-security</literal> e <literal>testing-security</literal>, ma si legga <xref linkend="bug-security"/> per ulteriori informazioni su queste ultime.

source: It is not possible to upload a package into several distributions at the same time.
it: Non è possibile caricare un pacchetto in più distribuzioni contemporaneamente.

source: Special case: uploads to the <literal>stable</literal> and <literal>oldstable</literal> distributions
it: Caso particolare: caricamenti sulle distribuzioni <literal>stable</literal> e <literal>oldstable</literal>

source: Uploading to <literal>stable</literal> means that the package will transferred to the <literal>proposed-updates-new</literal> queue for review by the stable release managers, and if approved will be installed in <filename>stable-proposed-updates</filename> directory of the Debian archive. From there, it will be included in <literal>stable</literal> with the next point release.
it: Il caricamento su <literal>stable</literal> significa che il pacchetto verrà trasferito alla coda <literal>proposed-updates-new</literal> per la revisione da parte dei gestori del rilascio stabile, e, se approvata sarà installato in <filename>stable -proposed-updates</filename> dell'archivio Debian. Da lì, sarà incluso nella <literal>stable</literal> con il prossimo rilascio puntuale.

source: To ensure that your upload will be accepted, you should discuss the changes with the stable release team before you upload. For that, file a bug against the <systemitem role="package">release.debian.org</systemitem> pseudo-package using <command>reportbug</command>, including the patch you want to apply to the package version currently in <literal>stable</literal>. Always be verbose and detailed in your changelog entries for uploads to the <literal>stable</literal> distribution.
it: Per assicurarsi che il caricamento sarà accettato, si dovrebbe discutere le modifiche con il team del rilascio stabile prima di caricare. Per questo, segnalare un bug relativo allo pseudo-pacchetto <systemitem role="package">release.debian.org</systemitem> utilizzando <command>reportbug</command>, includendo la patch che si desidera applicare alla versione del pacchetto attualmente in <literal>stable</literal>. Si sia sempre prolissi e dettagliati nelle voci del changelog per i file caricati sulla distribuzione <literal>stable</literal>.

source: Extra care should be taken when uploading to <literal>stable</literal>. Basically, a package should only be uploaded to <literal>stable</literal> if one of the following happens:
it: Particolare attenzione dovrebbe essere posta durante il caricamento in <literal>stable</literal>. In sostanza, un pacchetto deve essere caricato solo per <literal>stable</literal> se si verifica una delle seguenti circostanze:

source: a truly critical functionality problem
it: un problema di funzionalità davvero critica

source: the package becomes uninstallable
it: il pacchetto diventa non installabile

source: a released architecture lacks the package
it: una architettura rilasciata necessita del pacchetto

source: In the past, uploads to <literal>stable</literal> were used to address security problems as well. However, this practice is deprecated, as uploads used for Debian security advisories are automatically copied to the appropriate <filename>proposed-updates</filename> archive when the advisory is released. See <xref linkend="bug-security"/> for detailed information on handling security problems. If the security teams deems the problem to be too benign to be fixed through a <literal>DSA</literal>, the stable release managers are usually willing to include your fix nonetheless in a regular upload to <literal>stable</literal>.
it: In passato, caricamenti in <literal>stable</literal> sono stati utilizzati per risolvere anche problemi di sicurezza. Tuttavia, questa pratica è sconsigliata, dato che i caricamenti utilizzati per la sicurezza di Debian vengono copiati automaticamente nell'appropriato archivio <filename>proposed-updates</filename> quando l'avviso viene rilasciato. Per informazioni dettagliate sulla gestione dei problemi di sicurezza si consulti <xref linkend="bug-security"/>. Se i team di sicurezza ritengono che il problema sia troppo benevolo per essere risolto attraverso una <literal>DSA</literal>, i gestori del rilascio stable di solito sono disposti a includere comunque la correzione in un normale caricamento su <literal>stable</literal>.

source: Changing anything else in the package that isn't important is discouraged, because even trivial fixes can cause bugs later on.
it: Cambiare qualsiasi altra cosa nel pacchetto che non sia importante è sconsigliato, perché anche correzioni banali possono successivamente causare errori.

source: Packages uploaded to <literal>stable</literal> need to be compiled on systems running <literal>stable</literal>, so that their dependencies are limited to the libraries (and other packages) available in <literal>stable</literal>; for example, a package uploaded to <literal>stable</literal> that depends on a library package that only exists in <literal>unstable</literal> will be rejected. Making changes to dependencies of other packages (by messing with <literal>Provides</literal> or <filename>shlibs</filename> files), possibly making those other packages uninstallable, is strongly discouraged.
it: I pacchetti caricati su <literal>stable</literal> necessitano di essere compilati su sistemi che eseguono <literal>stable</literal>, in modo che le loro dipendenze siano limitate alle librerie (ed altri pacchetti) disponibili in <literal>stable</literal>; per esempio, un pacchetto caricato in <literal>stable</literal> che dipende da un pacchetto di libreria che esiste solo in <literal>unstable</literal> sarà respinto. Apportare modifiche alle dipendenze di altri pacchetti (modificando i file <literal>Provides</literal> o <filename>shlibs</filename>), eventualmente rendendo quegli altri pacchetti non installabili, è decisamente sconsigliato.

source: Uploads to the <literal>oldstable</literal> distributions are possible as long as it hasn't been archived. The same rules as for <literal>stable</literal> apply.
it: caricamenti su distribuzioni <literal>oldstable</literal> sono possibili a patto che non siano state archiviate. Valgono le stesse regole per <literal>stable</literal>.

source: Special case: uploads to <literal>testing/testing-proposed-updates</literal>
it: Caso particolare: caricamenti su <literal>testing/testing-proposed-updates</literal>

source: Please see the information in the <link linkend="t-p-u">testing section</link> for details.
it: Consultare le informazioni nella <link linkend="t-p-u">sezione di test</link> per i dettagli.

source: Uploading a package
it: Caricare un pacchetto

source: Uploading to <literal>ftp-master</literal>
it: Caricamento su <literal>ftp-master</literal>

source: To upload a package, you should upload the files (including the signed changes and dsc-file) with anonymous ftp to <literal>&ftp-upload-host;</literal> in the directory <ulink url="ftp://&ftp-upload-host;&upload-queue;">&upload-queue;</ulink>. To get the files processed there, they need to be signed with a key in the Debian Developers keyring or the Debian Maintainers keyring (see <ulink url="&url-wiki-dm;"></ulink>).
it: Per caricare un pacchetto, è necessario caricare i file (incluse le modifiche firmate e i file .dsc) con ftp anonimo su <literal>&ftp-upload-host;</literal> nella cartella <ulink url="ftp://&ftp-upload-host;&upload-queue;">&upload-queue;</ulink>. Per ottenere che i file vengano processati, devono essere firmati con una chiave del portachiavi dei Developer Debian o dei Debian Maintainer (si veda <ulink url="&url-wiki-dm;"></ulink>).

source: Please note that you should transfer the changes file last. Otherwise, your upload may be rejected because the archive maintenance software will parse the changes file and see that not all files have been uploaded.
it: Notare che è necessario trasferire il file delle modifiche alla fine. In caso contrario, il caricamento potrebbe essere respinto in quanto il software di mantenimento analizzerà il file delle modifiche e noterà che non tutti i file sono stati caricati.

source: You may also find the Debian packages <link linkend="dupload">dupload</link> or <link linkend="dput">dput</link> useful when uploading packages.These handy programs help automate the process of uploading packages into Debian.
it: È inoltre possibile trovare i pacchetti Debian <link linkend="dupload">dupload</link> o <link linkend="dput">dput</link> utili quando si caricano i pacchetti. Questi comodi programmi aiutano ad automatizzare il processo di caricamento dei pacchetti in Debian.

source: For removing packages, please see <ulink url="ftp://&ftp-upload-host;&upload-queue;README"/> and the Debian package <link linkend="dcut">dcut</link>.
it: Per la rimozione di pacchetti, si consulti <ulink url="ftp://&ftp-upload-host;&upload-queue;README"/> e il pacchetto Debian <link linkend="dcut">dcut</link>.

source: Delayed uploads
it: Caricamenti differiti

source: It is sometimes useful to upload a package immediately, but to want this package to arrive in the archive only a few days later. For example, when preparing a <link linkend="nmu">Non-Maintainer Upload</link>, you might want to give the maintainer a few days to react.
it: A volte è utile caricare immediatamente un pacchetto, ma si desidera che quest'ultimo arrivi nell'archivio solo dopo qualche giorno. Ad esempio, quando si prepara un <link linkend="nmu">Non-Maintainer Upload</link>, si potrebbe desiderare di dare al maintainer qualche giorno per reagire.

source: An upload to the delayed directory keeps the package in <ulink url="https://ftp-master.debian.org/deferred.html">the deferred uploads queue</ulink>. When the specified waiting time is over, the package is moved into the regular incoming directory for processing. This is done through automatic uploading to <literal>&ftp-upload-host;</literal> in upload-directory <literal>DELAYED/<replaceable>X</replaceable>-day</literal> (<replaceable>X</replaceable> between 0 and 15). 0-day is uploaded multiple times per day to <literal>&ftp-upload-host;</literal>.
it: Un caricamento nella cartella differita fa mantenere il pacchetto nella <ulink url="http://ftp-master.debian.org/deferred.html">coda caricamenti differiti</ulink>. Quando il tempo di attesa specificato è terminato, il pacchetto viene spostato nella cartella regolare incoming per l'elaborazione. Questo viene fatto attraverso il caricamento di <literal>&ftp-upload-host;</literal> nella cartella di caricamento<literal> DELAYED/<replaceable>X</replaceable>-day</literal> (<replaceable>X</replaceable> tra 0 e 15). 0-day viene caricato più volte al giorno in <literal>&ftp-upload-host;</literal>.

source: With dput, you can use the <literal>--delayed <replaceable>DELAY</replaceable></literal> parameter to put the package into one of the queues.
it: Con dput, è possibile utilizzare il parametro <literal>--delayed <replaceable>DELAY</replaceable></literal> per mettere il pacchetto in una delle code.

source: Security uploads
it: Caricamenti di sicurezza

source: Do <emphasis role="strong">NOT</emphasis> upload a package to the security upload queue (on <literal>security-master.debian.org</literal>) without prior authorization from the security team. If the package does not exactly meet the team's requirements, it will cause many problems and delays in dealing with the unwanted upload. For details, please see <xref linkend="bug-security"/>.
it: <emphasis role="strong">NON</emphasis> caricare un pacchetto nella coda dei caricamenti di sicurezza (<literal> oldstable-security </literal>, <literal> stabili-security </literal>, etc.) senza la preventiva autorizzazione da parte del team di sicurezza. Se il pacchetto non soddisfa le esigenze del team, causerà molti problemi e ritardi nel gestire il caricamento indesiderato. Per i dettagli, si consulti <xref linkend="bug-security"/>.

source: Other upload queues
it: Altre code di caricamento

source: There is an alternative upload queue in Europe at <ulink url="ftp://&ftp-eu-upload-host;&upload-queue;"/>. It operates in the same way as <literal>&ftp-upload-host;</literal>, but should be faster for European developers.
it: Vi è una coda di caricamento alternativa in Europa a <ulink url="ftp://&ftp-eu-upload-host;&upload-queue;"/>. Funziona allo stesso modo come <literal>&ftp-upload-host;</literal>, ma dovrebbe essere più veloce per gli sviluppatori europei.
