Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: The first paragraph of the long description should answer the following questions: what does the package do? what task does it help the user accomplish? It is important to describe this in a non-technical way, unless of course the audience for the package is necessarily technical.
it: Il primo paragrafo della descrizione lunga deve rispondere alle seguenti domande: che cosa fa il pacchetto? in che modo aiuta l'utente ad assolvere ai suoi task? È importante descrivere ciò in maniera non tecnica, salvo ovviamente quando il pacchetto è destinato ad una utenza tecnica.

source: The following paragraphs should answer the following questions: Why do I as a user need this package? What other features does the package have? What outstanding features and deficiencies are there compared to other packages (e.g., if you need X, use Y instead)? Is this package related to other packages in some way that is not handled by the package manager (e.g., this is the client for the foo server)?
it: I paragrafi che seguono devono rispondere alle seguenti domande: Perché, come utente, ho bisogno di questo pacchetto? Quali altre caratteristiche ha il pacchetto? Quali le caratteristiche e le carenze ci sono rispetto ad altri pacchetti (per esempio, se si ha bisogno di X, usare Y invece)? Questo pacchetto è correlato ad altri pacchetti in qualche modo che non viene gestito dal gestore di pacchetti (per esempio, questo è il client per il server foo)?

source: Be careful to avoid spelling and grammar mistakes. Ensure that you spell-check it. Both <command>ispell</command> and <command>aspell</command> have special modes for checking <filename>debian/control</filename> files:
it: Fare attenzione ad evitare errori di ortografia e di grammatica. Ci si assicuri di effettuare il controllo ortografico. Entrambi <command>ispell</command> e <command>aspell</command> hanno modalità speciali per il controllo del file <filename>debian/control</filename>:

source: Users usually expect these questions to be answered in the package description:
it: Gli utenti di solito si aspettano che queste domande ricevano risposta nella descrizione del pacchetto:

source: What does the package do? If it is an add-on to another package, then the short description of the package we are an add-on to should be put in here.
it: Che cosa fa il pacchetto? Se si tratta di un componente aggiuntivo per un altro pacchetto, allora la breve descrizione del pacchetto per il quale è un componente aggiuntivo dovrebbe essere inserita qui.

source: Why should I want this package? This is related to the above, but not the same (this is a mail user agent; this is cool, fast, interfaces with PGP and LDAP and IMAP, has features X, Y, and Z).
it: Perché dovrei volere questo pacchetto? Questo è legato al precedente, ma non è lo stesso (questo è un client di posta elettronica; questo è eccezionale, veloce, si interfaccia con PGP e LDAP e IMAP, ha caratteristiche X, Y e Z).

source: If this package should not be installed directly, but is pulled in by another package, this should be mentioned.
it: Se il pacchetto non deve essere installato direttamente, ma è richiamato da un altro pacchetto, questo dovrebbe essere menzionato.

source: If the package is <literal>experimental</literal>, or there are other reasons it should not be used, if there are other packages that should be used instead, it should be here as well.
it: Se il pacchetto è <literal>experimental</literal>, o ci sono altri motivi per i quali non dovrebbe essere usato, se invece ci sono altri pacchetti che dovrebbero essere utilizzati, esso dovrebbe essere indicato.

source: How is this package different from the competition? Is it a better implementation? more features? different features? Why should I choose this package.
it: In che modo questo pacchetto si differenzia da altri? È un'implementazione migliore? più funzioni? caratteristiche diverse? Perché dovrei scegliere questo pacchetto.

source: Upstream home page
it: Home page originale del pacchetto

source: We recommend that you add the URL for the package's home page in the <literal>Homepage</literal> field of the <literal>Source</literal> section in <filename>debian/control</filename>. Adding this information in the package description itself is considered deprecated.
it: Si consiglia di aggiungere l'URL per la home page del pacchetto nel campo <literal>Homepage</literal> della sezione <literal>Source</literal> in <filename>debian/control</filename>. L'aggiunta di questa informazione nella descrizione del stesso pacchetto è considerata obsoleta.

source: Version Control System location
it: La posizione del Version Control System

source: There are additional fields for the location of the Version Control System in <filename>debian/control</filename>.
it: Ci sono campi aggiuntivi per la posizione del Version Control System in <filename>debian/control</filename>.

source: Value of this field should be a <literal>http://</literal> URL pointing to a web-browsable copy of the Version Control System repository used to maintain the given package, if available.
it: Il valore di questo campo dovrebbe essere una URL <literal>http://</literal> che punta a una copia web navigabile del Version Control System utilizzato per mantenere il pacchetto, se disponibile.

source: The information is meant to be useful for the final user, willing to browse the latest work done on the package (e.g. when looking for the patch fixing a bug tagged as <literal>pending</literal> in the bug tracking system).
it: L'informazione è destinata ad essere utile per l'utente finale, disposto a sfogliare l'ultimo lavoro svolto sul pacchetto (ad esempio quando si cerca la patch di un bug etichettato come <literal>pending</literal> nel sistema di bug tracking).

source: Value of this field should be a string identifying unequivocally the location of the Version Control System repository used to maintain the given package, if available. <literal>*</literal> identify the Version Control System; currently the following systems are supported by the package tracking system: <literal>arch</literal>, <literal>bzr</literal> (Bazaar), <literal>cvs</literal>, <literal>darcs</literal>, <literal>git</literal>, <literal>hg</literal> (Mercurial), <literal>mtn</literal> (Monotone), <literal>svn</literal> (Subversion). It is allowed to specify different VCS fields for the same package: they will all be shown in the PTS web interface.
it: Il valore di questo campo deve essere una stringa che identifica in modo inequivocabile la posizione del repository del Version Control System utilizzato per mantenere il pacchetto, se disponibile. <literal>*</literal> individua il Version Control System; attualmente i seguenti sistemi sono supportati dal package tracking system: <literal>arch</literal>, <literal>bzr</literal> (Bazaar), <literal>cvs</literal>, <literal>darcs</literal>, <literal>git</literal>, <literal>hg</literal> (Mercurial), <literal>mtn</literal> (Monotone), <literal>svn</literal> (Subversion). È consentito specificare diversi campi VCS per lo stesso pacchetto: saranno tutti mostrati nell'interfaccia web di PTS.

source: The information is meant to be useful for a user knowledgeable in the given Version Control System and willing to build the current version of a package from the VCS sources. Other uses of this information might include automatic building of the latest VCS version of the given package. To this end the location pointed to by the field should better be version agnostic and point to the main branch (for VCSs supporting such a concept). Also, the location pointed to should be accessible to the final user; fulfilling this requirement might imply pointing to an anonymous access of the repository instead of pointing to an SSH-accessible version of the same.
it: L'informazione è destinata ad essere utile per un utente esperto nel dato Version Control System e disposto a compilare la versione attuale del pacchetto dai sorgenti VCS. Altri usi di queste informazioni possono includere compilazioni automatiche della versione VCS più recente del dato pacchetto. A tal fine la posizione a cui punta il campo dovrebbe essere la versione migliore rispetto a quella agnostica e puntare al ramo principale (per i VCS che supportano tale concetto). Inoltre, la posizione indicata dovrebbe essere accessibile per l'utente finale; soddisfare questo requisito potrebbe implicare un accesso anonimo al repository invece di puntare a una versione SSH-accessibile dello stesso.

source: In the following example, an instance of the field for a Subversion repository of the <systemitem role="package">vim</systemitem> package is shown. Note how the URL is in the <literal>svn://</literal> scheme (instead of <literal>svn+ssh://</literal>) and how it points to the <filename>trunk/</filename> branch. The use of the <literal>Vcs-Browser</literal> and <literal>Homepage</literal> fields described above is also shown.
it: Nel seguente esempio è mostrata un'istanza del campo per un repository Subversion del pacchetto <systemitem role="package">vim</systemitem>. Si noti come l'URL è nello schema <literal>svn://</literal> (invece di <literal>svn+ssh://</literal>) e come si punti al branch <filename>trunk/</filename>. È anche mostrato l'uso dei campi del <literal>Vcs-Browser</literal> e <literal>Homepage</literal> descritti precedentemente.

source: Source: vim Section: editors Priority: optional &lt;snip&gt; Vcs-Svn: svn://svn.debian.org/svn/pkg-vim/trunk/packages/vim Vcs-Browser: https://svn.debian.org/wsvn/pkg-vim/trunk/packages/vim Homepage: http://www.vim.org
it: Source: vim Section: editors Priority: optional &lt;snip&gt; Vcs-Svn: svn://svn.debian.org/svn/pkg-vim/trunk/packages/vim Vcs-Browser: http://svn.debian.org/wsvn/pkg-vim/trunk/packages/vim Homepage: http://www.vim.org

source: Best practices for <filename>debian/changelog</filename>
it: Buone pratiche per il <filename>debian/changelog</filename>

source: The following practices supplement the <ulink url="&url-debian-policy;ch-docs.html#s-changelogs">Policy on changelog files</ulink>.
it: Le seguenti pratiche integrano la <ulink url="&url-debian-policy;ch-docs.html#s-changelogs">Policy sui file changelog</ulink>.

source: Writing useful changelog entries
it: Scrivere informazioni utili nel file changelog

source: The changelog entry for a package revision documents changes in that revision, and only them. Concentrate on describing significant and user-visible changes that were made since the last version.
it: La voce del changelog inerente una revisione del pacchetto documenta i cambiamenti in quella specifica revisione e solo loro. Concentrarsi sulla descrizione di cambiamenti significativi e visibili all'utente che sono stati fatti dopo l'ultima versione.

source: Focus on <emphasis>what</emphasis> was changed — who, how and when are usually less important. Having said that, remember to politely attribute people who have provided notable help in making the package (e.g., those who have sent in patches).
it: Ci si concentri su <emphasis>ciò</emphasis> che è stato cambiato: chi, come e quando di solito sono meno importanti. Detto questo, ricordarsi di citare le persone che hanno fornito un notevole aiuto nel compilare il pacchetto (ad esempio, coloro che hanno inviato delle patch).

source: There's no need to elaborate the trivial and obvious changes. You can also aggregate several changes in one entry. On the other hand, don't be overly terse if you have undertaken a major change. Be especially clear if there are changes that affect the behaviour of the program. For further explanations, use the <filename>README.Debian</filename> file.
it: Non c'è bisogno di elaborare le modifiche banali e ovvie. È inoltre possibile aggregare diversi cambiamenti in un'unica voce. D'altra parte, non si sia troppo ermetici se si ha intrapreso un cambiamento importante. Si sia particolarmente chiari se ci sono cambiamenti che influenzano il comportamento del programma. Per ulteriori chiarimenti, utilizzare il <filename>README.Debian</filename>.

source: Use common English so that the majority of readers can comprehend it. Avoid abbreviations, tech-speak and jargon when explaining changes that close bugs, especially for bugs filed by users that did not strike you as particularly technically savvy. Be polite, don't swear.
it: Si utilizzi l'inglese comune in modo che la maggior parte dei lettori possa comprenderlo. Si evitino abbreviazioni, termini tecnici e gergo quando si spiegano i cambiamenti che chiudono i bug, soprattutto per i bug segnalati dagli utenti che non sembrano particolarmente smaliziati dal punto di vista tecnico. Si sia gentili, non si imprechi.

source: It is sometimes desirable to prefix changelog entries with the names of the files that were changed. However, there's no need to explicitly list each and every last one of the changed files, especially if the change was small or repetitive. You may use wildcards.
it: A volte è desiderabile far precedere le voci del changelog con i nomi dei file che sono stati modificati. Tuttavia, non c'è bisogno di elencare esplicitamente uno per uno tutti i file modificati, soprattutto se il cambiamento è stato piccolo o ripetitivo. È possibile utilizzare i metacaratteri.

source: When referring to bugs, don't assume anything. Say what the problem was, how it was fixed, and append the closes: #nnnnn string. See <xref linkend="upload-bugfix"/> for more information.
it: Quando si parla di bug, non si dia per scontato nulla. Dire quale era il problema, come è stato risolto e aggiungere in fondo la stringa closes: #nnnnn. Per ulteriori informazioni, si consulti <xref linkend="upload-bugfix"/>.

source: Common misconceptions about changelog entries
it: Comuni incomprensioni sulle voci del changelog

source: The changelog entries should <emphasis role="strong">not</emphasis> document generic packaging issues (Hey, if you're looking for foo.conf, it's in /etc/blah/.), since administrators and users are supposed to be at least remotely acquainted with how such things are generally arranged on Debian systems. Do, however, mention if you change the location of a configuration file.
it: Le voci del changelog <emphasis role="strong">non</emphasis> dovrebbero documentare generici problemi di packaging (Ehi, se si è alla ricerca di foo.conf, è in /etc/blah/.), dal momento che si suppone che gli amministratori e gli utenti siano a conoscenza di come queste cose sono generalmente gestite sui sistemi Debian. Parlatene, tuttavia, se si modifica la posizione di un file di configurazione.

source: The only bugs closed with a changelog entry should be those that are actually fixed in the same package revision. Closing unrelated bugs in the changelog is bad practice. See <xref linkend="upload-bugfix"/>.
it: Gli unici bug chiusi con una voce nel changelog dovrebbero essere quelli che sono effettivamente chiusi nella stessa versione del pacchetto. Chiudere bug non correlati nel changelog è cattiva pratica. Si veda <xref linkend="upload-bugfix"/>.

source: The changelog entries should <emphasis role="strong">not</emphasis> be used for random discussion with bug reporters (I don't see segfaults when starting foo with option bar; send in more info), general statements on life, the universe and everything (sorry this upload took me so long, but I caught the flu), or pleas for help (the bug list on this package is huge, please lend me a hand). Such things usually won't be noticed by their target audience, but may annoy people who wish to read information about actual changes in the package. See <xref linkend="bug-answering"/> for more information on how to use the bug tracking system.
it: Le voci del changelog <emphasis role="strong">non</emphasis> dovrebbero essere utilizzate per discussioni casuali con chi ha segnalato il bug (non vedo segmentation fault quando avvio foo con l'opzione bar; invia più informazioni al riguardo), dichiarazioni generali sulla vita, l'universo e tutto il resto (scusate questo caricamento mi ha preso così tanto tempo, ma ho preso l'influenza), o richieste di aiuto (la lista di bug su questo pacchetto è enorme, vi prego di dare una mano). Queste cose di solito non vengono notate, ma possono infastidire le persone che desiderano leggere le informazioni sulle modifiche effettive nel pacchetto. Per ulteriori informazioni su come utilizzare il sistema di bug tracking vedere <xref linkend="bug-answering"/>.

source: It is an old tradition to acknowledge bugs fixed in non-maintainer uploads in the first changelog entry of the proper maintainer upload. As we have version tracking now, it is enough to keep the NMUed changelog entries and just mention this fact in your own changelog entry.
it: Si tratta di una vecchia tradizione per riconoscere bug corretti in un caricamento di un non-maintainer nella prima voce del changelog dell'appropriato maintainer. Siccome ora abbiamo il version tracking, è sufficiente mantenere le voci del changelog NMUed e citare questo fatto nella propria voce del changelog.

source: Common errors in changelog entries
it: Errori frequenti nelle voci del changelog

source: The following examples demonstrate some common errors or examples of bad style in changelog entries.
it: I seguenti esempi dimostrano alcuni errori comuni o di cattivo stile nelle voci del changelog.

source: This doesn't tell readers anything too useful, obviously.
it: Questo non dice ai lettori qualcosa di particolarmente utile, ovviamente.

source: What was the patch about?
it: Qual'era l'argomento della patch?

source: Overhaul which accomplished what? Is the mention of late night supposed to remind us that we shouldn't trust that code?
it: Revisione che ha completato cosa? L'ipotetica citazione notturna è lì a ricordarci che non dovremmo fidarci di quel codice?

source: Too many acronyms, and it's not overly clear what the, uh, fsckup (oops, a curse word!) was actually about, or how it was fixed.
it: Troppe sigle e non è troppo chiaro a quale la, uh, fsckup (ops, una parolaccia!) si riferiva, o come è stato sistemato.

source: First of all, there's absolutely no need to upload the package to convey this information; instead, use the bug tracking system. Secondly, there's no explanation as to why the report is not a bug.
it: Innanzitutto, non c'è assolutamente alcun bisogno di caricare il pacchetto per trasmettere queste informazioni; invece, utilizzare il sistema di bug tracking. In secondo luogo, non c'è alcuna spiegazione del perché il rapporto non è un bug.

source: If for some reason you didn't mention the bug number in a previous changelog entry, there's no problem, just close the bug normally in the BTS. There's no need to touch the changelog file, presuming the description of the fix is already in (this applies to the fixes by the upstream authors/maintainers as well, you don't have to track bugs that they fixed ages ago in your changelog).
it: Se per qualche motivo non si è citato il numero di bug in una voce precedente del changelog, non è un problema, basta chiudere normalmente il bug nel BTS. Non c'è bisogno di toccare il file changelog, presumendo che la descrizione della correzione sia già indicata (questo vale per le correzioni da parte degli autori/manutentori, non c'è bisogno di tenere traccia dei bug che hanno risolto secoli fa nel proprio changelog).

source: Where's the description? If you can't think of a descriptive message, start by inserting the title of each different bug.
it: Dov'è la descrizione? Se non è possibile pensare ad un messaggio descrittivo, iniziare inserendo il titolo di ogni differente bug.

source: Supplementing changelogs with <filename>NEWS.Debian</filename> files
it: Integrare i changelog con i file <filename>NEWS.Debian</filename>

source: Important news about changes in a package can also be put in <filename>NEWS.Debian</filename> files. The news will be displayed by tools like <systemitem role="package">apt-listchanges</systemitem>, before all the rest of the changelogs. This is the preferred means to let the user know about significant changes in a package. It is better than using <systemitem role="package">debconf</systemitem> notes since it is less annoying and the user can go back and refer to the <filename>NEWS.Debian</filename> file after the install. And it's better than listing major changes in <filename>README.Debian</filename>, since the user can easily miss such notes.
it: Importanti novità sui i cambiamenti in un pacchetto possono anche essere inserite nei file <filename>NEWS.Debian</filename>. Le notizie saranno visualizzate da strumenti come <systemitem role="package">apt-listchanges</systemitem>, prima di tutto il resto dei changelog. Questo è il mezzo preferito per permettere all'utente di conoscere i cambiamenti significativi in ??un pacchetto. È meglio che usare le note di <systemitem role="package">debconf</systemitem> in quanto è meno fastidioso e l'utente può tornare indietro e vedere il file <filename>NEWS.Debian</filename> dopo l'installazione. Ed è meglio rispetto all'elencare i principali cambiamenti presenti in <filename>README.Debian</filename>, dal momento che l'utente può facilmente perderli.

source: The file format is the same as a debian changelog file, but leave off the asterisks and describe each news item with a full paragraph when necessary rather than the more concise summaries that would go in a changelog. It's a good idea to run your file through <literal>dpkg-parsechangelog</literal> to check its formatting as it will not be automatically checked during build as the changelog is. Here is an example of a real <filename>NEWS.Debian</filename> file:
it: Il formato del file è lo stesso di un file changelog Debian, ma lasciare fuori gli asterischi e descrivere ogni notizia con un paragrafo completo quando necessario, piuttosto che le più concise sintesi che andrebbero in un changelog. È una buona idea eseguire il file attraverso <literal>dpkg-parsechangelog</literal> per controllare la formattazione in quanto durante la fase di compilazione non sarà controllata automaticamente come è stato fatto per il changelog. Ecco un esempio di un vero e proprio file <filename>NEWS.Debian</filename>:

source: The <filename>NEWS.Debian</filename> file is installed as <filename>/usr/share/doc/<replaceable>package</replaceable>/NEWS.Debian.gz</filename>. It is compressed, and always has that name even in Debian native packages. If you use <literal>debhelper</literal>, <literal>dh_installchangelogs</literal> will install <filename>debian/NEWS</filename> files for you.
it: Il file <filename>NEWS.Debian</filename> è installato come <filename>/usr/share/doc/<replaceable>package</replaceable>/NEWS.Debian.gz</filename>. È compresso e ha sempre quel nome, anche in pacchetti nativi Debian. Se si utilizza <literal>debhelper</literal>, <literal>dh_installchangelogs</literal> installerà il file <filename>debian/NEWS</filename> per voi.

source: Unlike changelog files, you need not update <filename>NEWS.Debian</filename> files with every release. Only update them if you have something particularly newsworthy that user should know about. If you have no news at all, there's no need to ship a <filename>NEWS.Debian</filename> file in your package. No news is good news!
it: A differenza dei file changelog, non è necessario aggiornare il file <filename>NEWS.Debian</filename> ad ogni rilascio. Aggiornarli solo se si ha qualcosa particolarmente degna di nota che l'utente dovrebbe conoscere. Se non si ha alcuna notizia, non c'è bisogno di fornire un file <filename>NEWS.Debian</filename>. Nessuna notizia è una buona notizia!

source: Best practices for maintainer scripts
it: Buone pratiche per gli script del mantainer
