Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: If the package is not a native package, you should add a minor version number to the Debian revision part of the version number (the portion after the last hyphen). This extra number must start at <literal>1</literal>. For example, if the current version is <literal>1.5-2</literal>, then an NMU would get version <literal>1.5-2.1</literal>. If a new upstream version is packaged in the NMU, the Debian revision is set to <literal>0</literal>, for example <literal>1.6-0.1</literal>.
it: Se il pacchetto non è un pacchetto nativo, si dovrebbe aggiungere un numero di versione secondario alla parte di revisione Debian del numero di versione (la parte dopo l'ultimo trattino). Questo numero aggiuntivo deve iniziare da <literal>1</literal>. Ad esempio, se la versione corrente è <literal>1.5-2</literal>, poi un NMU otterrebbe la versione <literal>1.5-2.1</literal>. Se nell'NMU viene pacchettizzata una nuova versione a monte, la revisione Debian viene impostata a <literal>0</literal>, per esempio <literal>1.6-0.1</literal>.

source: In both cases, if the last upload was also an NMU, the counter should be increased. For example, if the current version is <literal>1.5+nmu3</literal> (a native package which has already been NMUed), the NMU would get version <literal>1.5+nmu4</literal>.
it: In entrambi i casi, se anche l'ultimo caricamento è stato un NMU, il contatore dovrebbe essere aumentato. Ad esempio, se la versione corrente è <literal>1.5+nmu3</literal> (un pacchetto nativo che ha già subito un NMU), l'NMU avrebbe versione <literal>1.5+nmu4</literal>.

source: A special versioning scheme is needed to avoid disrupting the maintainer's work, since using an integer for the Debian revision will potentially conflict with a maintainer upload already in preparation at the time of an NMU, or even one sitting in the ftp NEW queue. It also has the benefit of making it visually clear that a package in the archive was not made by the official maintainer.
it: Uno speciale schema per i nomi di versione del codice è necessario per evitare di danneggiare il lavoro del maintainer, in quanto utilizzare un numero intero per la revisione Debian potenzialmente potrebbe entrare in conflitto con un caricamento del maintainer già in preparazione al momento di un NMU, o anche con uno presente nella coda NEW dell'ftp. Ha anche il vantaggio di rendere visivamente chiaro che un pacchetto nell'archivio non è stato fatto dal maintainer ufficiale.

source: If you upload a package to testing or stable, you sometimes need to "fork" the version number tree. This is the case for security uploads, for example. For this, a version of the form <literal>+deb<replaceable>X</replaceable>u<replaceable>Y</replaceable></literal> should be used, where <replaceable>X</replaceable> is the major release number, and <replaceable>Y</replaceable> is a counter starting at <literal>1</literal>. For example, while &codename-stable; (Debian &version-stable;) is stable, a security NMU to stable for a package at version <literal>1.5-3</literal> would have version <literal>1.5-3+deb&version-stable;u1</literal>, whereas a security upload to &codename-testing; would get version <literal>1.5-3+deb&version-testing;u1</literal>.
it: Se si carica un pacchetto su testing o stable, a volte è necessario fare il «fork» dell'albero dei numeri di versione. Questo è il caso dei caricamenti di sicurezza, ad esempio. Per questo dovrebbe essere usata una versione della forma <literal>+deb<replaceable>XY</replaceable>u<replaceable>Z</replaceable></literal>, dove <replaceable>X</replaceable> e <replaceable>Y</replaceable> sono i numeri di versione principale e minore, e <replaceable>Z</replaceable> è un contatore che parte da <literal>1</literal>. Quando il numero di rilascio non è ancora noto (spesso è il caso per <literal>testing</literal>, all'inizio dei cicli di rilascio), deve essere utilizzato il più basso numero di versione che è più alto dell'ultimo numero di rilascio stabile. Per esempio, mentre Lenny (Debian 5.0) è stabile, un NMU di sicurezza a stable per un pacchetto alla versione <literal>1.5-3</literal> avrebbe versione <literal>1.5-3+deb50u1</literal>, mentre un NMU di sicurezza per Squeeze avrebbe versione <literal>1.5-3+deb60u1</literal>. Dopo l'uscita di Squeeze, i caricamenti di sicurezza per la distribuzione <literal>testing</literal> saranno avranno versione <literal>+deb61uZ</literal>, fino a quando non è noto se tale versione sarà Debian 6.1 o Debian 7.0 (se si avvera quest'ultimo caso i caricamenti avranno versione come <literal>+deb70uZ</literal>).

source: Using the <literal>DELAYED/</literal> queue
it: Utilizzare la coda <literal>DELAYED/</literal>

source: Having to wait for a response after you request permission to NMU is inefficient, because it costs the NMUer a context switch to come back to the issue. The <literal>DELAYED</literal> queue (see <xref linkend="delayed-incoming"/>) allows the developer doing the NMU to perform all the necessary tasks at the same time. For instance, instead of telling the maintainer that you will upload the updated package in 7 days, you should upload the package to <literal>DELAYED/7</literal> and tell the maintainer that they have 7 days to react. During this time, the maintainer can ask you to delay the upload some more, or cancel your upload.
it: Il dover attendere una risposta dopo che si è richiesto il permesso per un NMU è inefficiente, perché costa all'autore dell'NMU un cambio di contesto per ritornare sul problema. La coda <literal>DELAYED</literal> (si consulti <xref linkend="delayed-incoming"/>) consente allo sviluppatore che fa l'NMU di svolgere al tempo stesso tutti i compiti necessari. Per esempio, invece di dire al maintainer che si caricherà il pacchetto aggiornato tra 7 giorni, si dovrebbe caricare il pacchetto in <literal>DELAYED/7</literal> e dire al maintainer che ha 7 giorni di tempo per reagire. Durante questo tempo, il maintainer può chiedere di ritardare il caricamento di un po', o annullarlo.

source: The <literal>DELAYED</literal> queue should not be used to put additional pressure on the maintainer. In particular, it's important that you are available to cancel or delay the upload before the delay expires since the maintainer cannot cancel the upload themselves.
it: La coda <literal>DELAYED</literal> non deve essere utilizzata per mettere ulteriore pressione sul maintainer. In particolare, è importante che ci si renda disponibili ad annullare o ritardare il caricamento prima della scadenza del ritardo in quanto il maintainer non lo può annullare da solo.

source: If you make an NMU to <literal>DELAYED</literal> and the maintainer updates the package before the delay expires, your upload will be rejected because a newer version is already available in the archive. Ideally, the maintainer will take care to include your proposed changes (or at least a solution for the problems they address) in that upload.
it: Se si fa un NMU <literal>DELAYED</literal> e il maintainer aggiorna il pacchetto prima della scadenza del ritardo, il caricamento sarà respinto perché una nuova versione è già disponibile nell'archivio. Idealmente, il maintainer avrà cura di includere in questa versione le modifiche proposte (o almeno una soluzione per i problemi che affrontano).

source: NMUs from the maintainer's point of view
it: NMU dal punto di vista del maintainer

source: When someone NMUs your package, this means they want to help you to keep it in good shape. This gives users fixed packages faster. You can consider asking the NMUer to become a co-maintainer of the package. Receiving an NMU on a package is not a bad thing; it just means that the package is interesting enough for other people to work on it.
it: Quando qualcuno fa un NMU per il vostro pacchetto, questo significa che vuole aiutare a mantenerlo in buona forma. Questo dà agli utenti più velocemente dei pacchetti corretti. Si può considerare di chiedere all'autore dell'NMU di diventare un co-maintainer del pacchetto. La ricezione di un NMU su un pacchetto non è una cosa negativa; ma semplicemente significa che il pacchetto è abbastanza interessante per le altre persone da spingerle a lavorare su di esso.

source: To acknowledge an NMU, include its changes and changelog entry in your next maintainer upload. If you do not acknowledge the NMU by including the NMU changelog entry in your changelog, the bugs will remain closed in the BTS but will be listed as affecting your maintainer version of the package.
it: Per riconoscere un NMU, si includano i suoi cambiamenti e le voci del changelog nel proprio prossimo caricamento da maintainer. Se non si riconosce l'NMU non includendo le voci del changelog dell'NMU nel proprio changelog, i bug rimarranno chiusi nel BTS, ma saranno elencati come presenti nella propria versione di maintainer del pacchetto.

source: The full name of an NMU is <emphasis>source NMU</emphasis>. There is also another type, namely the <emphasis>binary-only NMU</emphasis>, or <emphasis>binNMU</emphasis>. A binNMU is also a package upload by someone other than the package's maintainer. However, it is a binary-only upload.
it: Il nome completo di un NMU è <emphasis>NMU sorgente</emphasis>. C'è anche un altro tipo, vale a dire la <emphasis>NMU solo binario</emphasis>, o <emphasis>binNMU</emphasis>. Un binNMU è anche un pacchetto caricato da una persona diversa dal maintainer del pacchetto. Tuttavia, è un solo un caricamento dei soli binari.

source: When a library (or other dependency) is updated, the packages using it may need to be rebuilt. Since no changes to the source are needed, the same source package is used.
it: Quando una libreria (o altra dipendenza) viene aggiornata, i pacchetti che la utilizzano possono aver bisogno di essere ricompilati. Dal momento che non sono necessarie modifiche al sorgente, viene utilizzato lo stesso pacchetto sorgente.

source: BinNMUs are usually triggered on the buildds by wanna-build. An entry is added to <filename>debian/changelog</filename>, explaining why the upload was needed and increasing the version number as described in <xref linkend="binary-only-nmu"/>. This entry should not be included in the next upload.
it: I binNMU sono di solito attivati sui buildd da wanna-build. Viene aggiunta una voce al <filename>debian/changelog</filename>, che spiega perché il caricamento è stato necessario e incrementa il numero di versione come descritto in <xref linkend="binary-only-nmu"/>. Questa voce non deve essere inclusa nel prossimo caricamento.

source: Buildds upload packages for their architecture to the archive as binary-only uploads. Strictly speaking, these are binNMUs. However, they are not normally called NMU, and they don't add an entry to <filename>debian/changelog</filename>.
it: Buildds carica i pacchetti per le loroarchitetture negliarchivi come upload binari. Parlando più precisamente, questi sono binNMUs. Comunque, non sono chimamati NMU, e non sono aggiunte voci al <filename>debian/changelog</filename>.

source: NMUs vs QA uploads
it: NMU e caricamenti di QA

source: NMUs are uploads of packages by somebody else than their assigned maintainer. There is another type of upload where the uploaded package is not yours: QA uploads. QA uploads are uploads of orphaned packages.
it: Gli NMU sono caricamneti di pacchetti effettuati da qualcun altro che non è il maintainer assegnato. Vi è un altro tipo di caricamento in cui il pacchetto caricato non è vostro: caricamenti di QA. Questi ultimi sono aggiornamenti di pacchetti orfani.

source: QA uploads are very much like normal maintainer uploads: they may fix anything, even minor issues; the version numbering is normal, and there is no need to use a delayed upload. The difference is that you are not listed as the <literal>Maintainer</literal> or <literal>Uploader</literal> for the package. Also, the changelog entry of a QA upload has a special first line:
it: I caricamenti di QA sono molto simili a normali caricamenti del maintainer: possono correggere qualsiasi cosa, anche problemi minori; la numerazione delle versioni è normale, e non vi è alcuna necessità di utilizzare un caricamento differito. La differenza è che non si viene elencati come il <literal>Maintainer</literal> o <literal>Uploader</literal> per il pacchetto. Inoltre, la voce del changelog del caricamento di QA ha una speciale prima riga:

source: If you want to do an NMU, and it seems that the maintainer is not active, it is wise to check if the package is orphaned (this information is displayed on the package's Package Tracking System page). When doing the first QA upload to an orphaned package, the maintainer should be set to <literal>Debian QA Group &lt;packages@qa.debian.org&gt;</literal>. Orphaned packages which did not yet have a QA upload still have their old maintainer set. There is a list of them at <ulink url="&url-orphaned-not-qa;"/>.
it: Se si vuole fare un NMU, e sembra che il maintainer non sia attivo, è consigliabile controllare se il pacchetto sia orfano (questa informazione viene visualizzata sulla pagina Package Tracking System del pacchetto). Quando si fa il primo caricamento di QA ad un pacchetto orfano, il maintainer deve essere impostato su <literal>Debian QA Group &lt;packages@qa.debian.org&gt;</literal>. I pacchetti orfani che non avevano ancora un caricamento QA hanno ancora indicato il loro vecchio maintainer. C'è un elenco di questi ultimi in <ulink url="&url-orphaned-not-qa;"/>.

source: Instead of doing a QA upload, you can also consider adopting the package by making yourself the maintainer. You don't need permission from anybody to adopt an orphaned package, you can just set yourself as maintainer and upload the new version (see <xref linkend="adopting"/>).
it: Invece di fare un caricamento QA, si può anche prendere in considerazione l'adozione del pacchetto diventando il maintainer. Non è necessario il permesso di nessuno per adottare un pacchetto orfano, basta impostare se stessi come maintainer e caricare la nuova versione (si consulti <xref linkend="adopting"/>).

source: NMUs vs team uploads
it: NMU e caricamenti del team

source: Sometimes you are fixing and/or updating a package because you are member of a packaging team (which uses a mailing list as <literal>Maintainer</literal> or <literal>Uploader</literal>, see <xref linkend="collaborative-maint"/>) but you don't want to add yourself to <literal>Uploaders</literal> because you do not plan to contribute regularly to this specific package. If it conforms with your team's policy, you can perform a normal upload without being listed directly as <literal>Maintainer</literal> or <literal>Uploader</literal>. In that case, you should start your changelog entry with the following line:
it: A volte si sta correggendo o aggiornando un pacchetto perché si è membri di una gruppo di pacchettizzazione (che si avvale di una mailing list come <literal>Maintainer</literal> o <literal>Uploader</literal>, si consulti <xref linkend="collaborative-maint"/>), ma non si desidera aggiungere se stessi agli <literal>Uploader</literal>, perché non si prevede di contribuire regolarmente a questo pacchetto specifico. Se è conforme con la politica del team, è possibile eseguire un caricamento normale senza figurare direttamente come <literal>Maintainer</literal> o <literal>Uploader</literal>. In tal caso, si dovrebbe iniziare la propria voce del changelog con la seguente riga:

source: Collaborative maintenance
it: La manutenzione collaborativa

source: Collaborative maintenance is a term describing the sharing of Debian package maintenance duties by several people. This collaboration is almost always a good idea, since it generally results in higher quality and faster bug fix turnaround times. It is strongly recommended that packages with a priority of <literal>standard</literal> or which are part of the base set have co-maintainers.
it: Manutenzione collaborativa è un termine che descrive la condivisione dei compiti di manutenzione dei pacchetti Debian tra più persone. Questa collaborazione è quasi sempre una buona idea, dato che in genere si traduce in una maggiore qualità e in tempi più rapidi per la soluzione di bug. Si raccomanda vivamente che i pacchetti con priorità <literal>standard</literal> o che sono parte dell'insieme base abbiano dei co-maintainer.

source: Generally there is a primary maintainer and one or more co-maintainers. The primary maintainer is the person whose name is listed in the <literal>Maintainer</literal> field of the <filename>debian/control</filename> file. Co-maintainers are all the other maintainers, usually listed in the <literal>Uploaders</literal> field of the <filename>debian/control</filename> file.
it: In generale vi è un maintainer primario e uno o più co-maintainer. Il maintainer primario è la persona il cui nome è inserito nel campo <literal>Maintainer</literal> del file <filename>debian/control</filename>. Co-maintainer sono tutti gli altri maintainer, di solito elencati nel campo <literal>Uploaders</literal> del file <filename>debian/control</filename>.

source: In its most basic form, the process of adding a new co-maintainer is quite easy:
it: Nella sua forma più semplice, il processo di aggiunta di un nuovo co-maintainer è abbastanza facile:

source: Setup the co-maintainer with access to the sources you build the package from. Generally this implies you are using a network-capable version control system, such as <literal>CVS</literal> or <literal>Subversion</literal>. Alioth (see <xref linkend="alioth"/>) provides such tools, amongst others.
it: Si imposti il co-maintainer con accesso ai sorgenti dai quali si compila il pacchetto. Generalmente questo significa che si sta utilizzando un sistema di controllo versione con capacità di rete, come <literal>CVS</literal> o <literal>Subversion</literal>. Alioth (si consulti <xref linkend="alioth"/>) fornisce tali strumenti, tra gli altri.

source: Add the co-maintainer's correct maintainer name and address to the <literal>Uploaders</literal> field in the first paragraph of the <filename>debian/control</filename> file.
it: Si aggiunga il nome corretto del co-maintainer e l'indirizzo nel campo <literal>Uploaders</literal> nel primo paragrafo del file <filename>debian/control</filename>.

source: Using the PTS (<xref linkend="pkg-tracker"/>), the co-maintainers should subscribe themselves to the appropriate source package.
it: Si utilizzi il PTS (<xref linkend="pkg-tracker"/>), i co-maintainer dovrebbero iscriversi all'appropriato pacchetto di sorgenti.

source: Another form of collaborative maintenance is team maintenance, which is recommended if you maintain several packages with the same group of developers. In that case, the <literal>Maintainer</literal> and <literal>Uploaders</literal> field of each package must be managed with care. It is recommended to choose between one of the two following schemes:
it: Un'altra forma di manutenzione collaborativa è la manutenzione in un team, che è raccomandata se si mantengono diversi pacchetti con lo stesso gruppo di sviluppatori. In tal caso, i campi <literal>Maintainer</literal> e <literal>Uploaders</literal> di ogni pacchetto devono essere gestiti con attenzione. Si consiglia di scegliere tra i seguenti due schemi:

source: Put the team member mainly responsible for the package in the <literal>Maintainer</literal> field. In the <literal>Uploaders</literal>, put the mailing list address, and the team members who care for the package.
it: Inserire il membro del team che è il principale responsabile per il pacchetto nel campo <literal>Maintainer</literal>. Nel campo <literal>Uploaders</literal>, inserire l'indirizzo della mailing list, ed i membri del team che si interessano al pacchetto.

source: Put the mailing list address in the <literal>Maintainer</literal> field. In the <literal>Uploaders</literal> field, put the team members who care for the package. In this case, you must make sure the mailing list accept bug reports without any human interaction (like moderation for non-subscribers).
it: Inserire l'indirizzo della mailing list nel campo <literal>Maintainer</literal>. Nel campo <literal>Uploaders</literal>, inserire i membri del team che si interessano al pacchetto. In questo caso, è necessario assicurarsi che la mailing list accetti le segnalazioni di bug senza alcuna interazione umana (come la moderazione per i non iscritti).

source: In any case, it is a bad idea to automatically put all team members in the <literal>Uploaders</literal> field. It clutters the Developer's Package Overview listing (see <xref linkend="ddpo"/>) with packages one doesn't really care for, and creates a false sense of good maintenance. For the same reason, team members do not need to add themselves to the <literal>Uploaders</literal> field just because they are uploading the package once, they can do a “Team upload” (see <xref linkend="nmu-team-upload"/>). Conversely, it is a bad idea to keep a package with only the mailing list address as a <literal>Maintainer</literal> and no <literal>Uploaders</literal>.
it: In ogni caso, è una cattiva idea mettere automaticamente tutti i membri del team nel campo <literal>Uploaders</literal>. Ciò ingombra l'elenco dei Developer's Package Overview (si consulti <xref linkend="ddpo"/>) con pacchetti di cui di fatto uno non si occupa veramente, e crea un falso senso di buona manutenzione. Per lo stesso motivo, i membri del team non devono di aggiungere se stessi nel campo <literal>Uploaders</literal> solo perché stanno caricando il pacchetto una sola volta, possono fare un «caricamento di Team» (si consulti <xref linkend="nmu-team-upload"/>). Al contrario, è una cattiva idea tenere un pacchetto con il solo indirizzo della mailing list come <literal>Maintainer</literal> e senza nessuno <literal>Uploaders</literal>.

source: The testing distribution
it: La distribuzione testing

source: Basics
it: Nozioni di base

source: Packages are usually installed into the <literal>testing</literal> distribution after they have undergone some degree of <literal>testing</literal> in <literal>unstable</literal>.
it: I pacchetti sono generalmente installati nella distribuzione <literal>testing</literal> dopo aver subito un periodo di <literal>test</literal> in <literal>unstable</literal>.

source: They must be in sync on all architectures and mustn't have dependencies that make them uninstallable; they also have to have generally no known release-critical bugs at the time they're installed into <literal>testing</literal>. This way, <literal>testing</literal> should always be close to being a release candidate. Please see below for details.
it: Essi devono essere sincronizzati su tutte le architetture e non devono avere dipendenze tali da renderli non installabili; inoltre devono generalmente non avere bug critici per il rilascio noti nel momento dell'installazione in <literal>testing</literal>. In questo modo, <literal>testing</literal> dovrebbe essere sempre vicina ad essere candidata al rilascio. Si veda sotto per i dettagli.

source: Updates from unstable
it: Aggiornamenti da unstable
