Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: Some tools (e.g. <systemitem role="package">po4a</systemitem>, <systemitem role="package">poxml</systemitem>, or the <systemitem role="package">translate-toolkit</systemitem>) are specialized in extracting the translatable material from different formats. They produce PO files, a format quite common to translators, which permits to see what needs to be retranslated when the translated document is updated.
it: Alcuni strumenti (ad es <systemitem role="package">po4a</systemitem>, <systemitem role="package">poxml</systemitem>, o il <systemitem role="package">translate-toolkit</systemitem>) sono specializzati nell'estrazione del materiale traducibile da diversi formati. Producono i file PO, un formato abbastanza comune ai traduttori, che permette di vedere ciò che deve essere ritradotto quando il documento tradotto viene aggiornato.

source: Common packaging situations
it: Situazioni comuni durante la pacchettizzazione

source: Packages using <command>autoconf</command>/<command>automake</command>
it: Pacchettizzazione utilizzando <command>autoconf</command>/<command>automake</command>

source: Keeping <command>autoconf</command>'s <filename>config.sub</filename> and <filename>config.guess</filename> files up to date is critical for porters, especially on more volatile architectures. Some very good packaging practices for any package using <command>autoconf</command> and/or <command>automake</command> have been synthesized in &file-bpp-autotools; from the <systemitem role="package">autotools-dev</systemitem> package. You're strongly encouraged to read this file and to follow the given recommendations.
it: Mantenere i file <filename>config.sub</filename> e <filename>config.guess</filename> di <command>autoconf</command> aggiornati è fondamentale per gli autori di port, soprattutto su architetture più volatili. Alcune ottime pratiche di packaging per ogni pacchetto che usa <command>autoconf</command> e/o <command>automake</command> sono state sintetizzate in &file-bpp-autotools; dal pacchetto <systemitem role="package">autotools-dev</systemitem>. Si è vivamente incoraggiati a leggere questo file e di seguire le raccomandazioni in esso fornite.

source: Libraries
it: Le librerie

source: Libraries are always difficult to package for various reasons. The policy imposes many constraints to ease their maintenance and to make sure upgrades are as simple as possible when a new upstream version comes out. Breakage in a library can result in dozens of dependent packages breaking.
it: Le librerie sono sempre difficili da pacchettizzare per vari motivi. La policy impone molti vincoli per facilitare il loro mantenimento e per assicurarsi che gli aggiornamenti siano i più semplici possibili quando una nuova versione viene pubblicata. Una rottura in una libreria può causare una rottura in decine di pacchetti dipendenti.

source: Good practices for library packaging have been grouped in <ulink url="&url-libpkg-guide;">the library packaging guide</ulink>.
it: Delle buone pratiche per la pacchettizzazione delle librerie sono state raggruppate in <ulink url="&url-libpkg-guide;">Guida alla pacchettizzazione delle librerie</ulink>.

source: Documentation
it: La documentazione

source: Be sure to follow the <ulink url="&url-debian-policy;ch-docs.html">Policy on documentation</ulink>.
it: Assicurarsi di seguire la policy <ulink url="&url-debian-policy;ch-docs.html">Policy sulla documentazione</ulink>.

source: If your package contains documentation built from XML or SGML, we recommend you not ship the XML or SGML source in the binary package(s). If users want the source of the documentation, they should retrieve the source package.
it: Se il pacchetto contiene la documentazione compilata a partire da XML o SGML, si consiglia di non includere il sorgente XML o SGML nel pacchetto binario. Se gli utenti vogliono il sorgente della documentazione, dovrebbero poter recuperare il pacchetto sorgente.

source: Policy specifies that documentation should be shipped in HTML format. We also recommend shipping documentation in PDF and plain text format if convenient and if output of reasonable quality is possible. However, it is generally not appropriate to ship plain text versions of documentation whose source format is HTML.
it: La policy specifica che la documentazione deve essere fornita in formato HTML. Si consiglia anche di inserire la documentazione in formato PDF e testo normale se conveniente e se è possibile output di discreta qualità. Tuttavia, non è in genere appropriato includere la versione in testo semplice della documentazione il cui formato sorgente è HTML.

source: Major shipped manuals should register themselves with <systemitem role="package">doc-base</systemitem> on installation. See the <systemitem role="package">doc-base</systemitem> package documentation for more information.
it: La maggior parte dei manuali dovrebbe registrarsi con <systemitem role="package">doc-base</systemitem> durante l'installazione. Si consulti la documentazione del pacchetto <systemitem role="package">doc-base</systemitem> per ulteriori informazioni.

source: Debian policy (section 12.1) directs that manual pages should accompany every program, utility, and function, and suggests them for other objects like configuration files. If the work you are packaging does not have such manual pages, consider writing them for inclusion in your package, and submitting them upstream.
it: La policy di Debian (sezione 12.1) indica che le pagine del manuale dovrebbero accompagnare ogni programma, utility e la funzione e suggerirli per altri oggetti come file di configurazione. Se il lavoro che si sta pacchettizzando non ha queste pagine di manuale, si consideri la loro scrittura per l'inclusione nel pacchetto e di sottoporla allo sviluppatore originale.

source: The manpages do not need to be written directly in the troff format. Popular source formats are Docbook, POD and reST, which can be converted using <command>xsltproc</command>, <command>pod2man</command> and <command>rst2man</command> respectively. To a lesser extent, the <command>help2man</command> program can also be used to write a stub.
it: Le pagine man non necessitano di essere scritte direttamente in formato troff. I formati file più diffusi sono DocBook, POD e di reST, che possono essere convertiti usando <command>xsltproc</command>, <command>pod2man</command> e <command>rst2man</command> rispettivamente. In misura minore, il programma <command>help2man</command> può anche essere utilizzato per scrivere uno stub.

source: Specific types of packages
it: Specifici tipi di pacchetti

source: Several specific types of packages have special sub-policies and corresponding packaging rules and practices:
it: Vari tipi specifici di pacchetti hanno particolari sub-politiche e rispettive pratiche e regole per la pacchettizzazione:

source: Perl related packages have a <ulink url="&url-perl-policy;">Perl policy</ulink>, some examples of packages following that policy are <systemitem role="package">libdbd-pg-perl</systemitem> (binary perl module) or <systemitem role="package">libmldbm-perl</systemitem> (arch independent perl module).
it: I relativi pacchetti Perl hanno una <ulink url="&url-perl-policy;">Perl policy</ulink>, alcuni esempi di pacchetti che seguono tale policy sono <systemitem role="package">libdbd-pg-perl</systemitem> (modulo binario perl) o <systemitem role="package">libmldbm-perl</systemitem> (modulo perl indipendente dall'architettura).

source: Python related packages have their python policy; see &file-python-policy; in the <systemitem role="package">python</systemitem> package.
it: I relativi pacchetti Python hanno la loro policy python; si consulti &file-python-policy; nel pacchetto <systemitem role="package">python</systemitem>.

source: Emacs related packages have the <ulink url="&url-emacs-policy;">emacs policy</ulink>.
it: I relativi pacchetti Emacs hanno la <ulink url="&url-emacs-policy;">emacs policy</ulink>.

source: Java related packages have their <ulink url="&url-java-policy;">java policy</ulink>.
it: I relativi pacchetti Java hanno la loro <ulink url="&url-java-policy;">java policy</ulink>.

source: Ocaml related packages have their own policy, found in &file-ocaml-policy; from the <systemitem role="package">ocaml</systemitem> package. A good example is the <systemitem role="package">camlzip</systemitem> source package.
it: I relativi pacchetti Ocaml hanno la loro politica, che si trova in &file-ocaml-policy; del pacchetto <systemitem role="package">ocaml</systemitem>. Un buon esempio è il pacchetto dei sorgenti di <systemitem role="package">camlzip</systemitem>.

source: Packages providing XML or SGML DTDs should conform to the recommendations found in the <systemitem role="package">sgml-base-doc</systemitem> package.
it: I pacchetti che forniscono XML o SGML DTD devono essere conformi alle indicazioni fornite nel pacchetto <systemitem role="package">sgml-base-doc</systemitem>.

source: Lisp packages should register themselves with <systemitem role="package">common-lisp-controller</systemitem>, about which see &file-lisp-controller;.
it: I pacchetti Lisp si devono registrare con il <systemitem role="package">common-lisp-controller</systemitem>, a proposito del quale si veda &file-lisp-controller;.

source: Architecture-independent data
it: Dati indipendenti dall'architettura

source: It is not uncommon to have a large amount of architecture-independent data packaged with a program. For example, audio files, a collection of icons, wallpaper patterns, or other graphic files. If the size of this data is negligible compared to the size of the rest of the package, it's probably best to keep it all in a single package.
it: Non è raro avere una grande quantità di dati indipendenti dall'architettura pacchettizzati con un programma. Ad esempio, i file audio, una collezione di icone, modelli di wallpaper, o altri file grafici. Se la dimensione di questi dati è trascurabile rispetto alle dimensioni del resto del pacchetto, probabilmente è meglio tenere il tutto in un unico pacchetto.

source: However, if the size of the data is considerable, consider splitting it out into a separate, architecture-independent package (<filename>_all.deb</filename>). By doing this, you avoid needless duplication of the same data into eleven or more .debs, one per each architecture. While this adds some extra overhead into the <filename>Packages</filename> files, it saves a lot of disk space on Debian mirrors. Separating out architecture-independent data also reduces processing time of <command>lintian</command> (see <xref linkend="tools-lint"/>) when run over the entire Debian archive.
it: Tuttavia, se la dimensione dei dati è notevole, si consideri di dividere in un pacchetto separato, indipendente dall'architettura (<filename>_all.deb</filename>). In questo modo, si evitano inutili duplicazioni degli stessi dati in undici o più .debs, uno per ogni architettura. Mentre questo aggiunge un po' di overhead ai file dei <filename>Pacchetti</filename>, fa risparmiare molto spazio su disco sui mirror Debian. Separare i dati indipendenti dall'architettura riduce anche il tempo di elaborazione di <command>lintian</command> (si consulti <xref linkend="tools-lint"/>) quando lanciato sull'intero archivio Debian.

source: Needing a certain locale during build
it: Aver bisogno di una particolare localizzazione durante la compilazione

source: If you need a certain locale during build, you can create a temporary file via this trick:
it: Se si ha bisogno di una certa localizzazione durante la compilazione, si può creare un file temporaneo con questo trucco:

source: If you set <varname>LOCPATH</varname> to the equivalent of <filename>/usr/lib/locale</filename>, and <varname>LC_ALL</varname> to the name of the locale you generate, you should get what you want without being root. Something like this:
it: Se si imposta <varname>LOCPATH</varname> all'equivalente di <filename>/usr/lib/locale</filename> e <varname>LC_ALL</varname> al nome del locale che si genera, si dovrebbe ottenere ciò che si desidera senza essere root. Qualcosa di simile a questo:

source: Make transition packages deborphan compliant
it: Rendere i pacchetti di transizione conformi a deborphan

source: Deborphan is a program for helping users to detect which packages can safely be removed from the system, i.e. the ones that have no packages depending on them. The default operation is to search only within the libs and oldlibs sections, to hunt down unused libraries. But when passed the right argument, it tries to catch other useless packages.
it: Deborphan è un programma per aiutare gli utenti ad individuare quali pacchetti possono essere tranquillamente rimossi dal sistema, vale a dire quelli che non hanno pacchetti dipendenti da loro. Il funzionamento predefinito è di cercare solo all'interno delle sezioni libs e oldlibs, per dare la caccia a librerie inutilizzate. Ma quando viene passato l'argomento giusto, cerca di catturare altri pacchetti inutili.

source: For example, with <literal>--guess-dummy</literal>, <command>deborphan</command> tries to search all transitional packages which were needed for upgrade but which can now safely be removed. For that, it looks for the string dummy or transitional in their short description.
it: Ad esempio, con <literal>--guess-dummy</literal>, <command>deborphan</command> prova a cercare tutti i pacchetti di transizione che sono stati necessari per l'aggiornamento, ma che ora possono tranquillamente essere rimossi. Per questo, esso cerca la stringa dummy or transitional nella loro descrizione breve.

source: So, when you are creating such a package, please make sure to add this text to your short description. If you are looking for examples, just run: <command>apt-cache search .|grep dummy</command> or <command>apt-cache search .|grep transitional</command>.
it: Quindi, quando si crea un pacchetto di questo tipo, ci si assicuri di aggiungere il testo alla descrizione breve. Se si è alla ricerca di esempi, basta eseguire:<command>apt-cache search.| grep dummy</command> o <command>apt-cache search | grep transitional</command>.

source: Also, it is recommended to adjust its section to <literal>oldlibs</literal> and its priority to <literal>extra</literal> in order to ease <command>deborphan</command>'s job.
it: Inoltre, è raccomandato modificare la sua sezione in <literal>oldlibs</literal> e la sua priorità in <literal>extra</literal> in modo da cancellare il compito di <command>deborphan</command>.

source: Best practices for <filename>.orig.tar.{gz,bz2,xz}</filename> files
it: Buone pratiche per i file <filename>.orig.tar.{gz,bz2,xz}</filename>

source: There are two kinds of original source tarballs: Pristine source and repackaged upstream source.
it: Ci sono due tipi di tarball dei sorgenti originali: sorgente puro e sorgente originale ripacchettizzato.

source: Pristine source
it: Sorgente puro

source: We cannot prevent upstream authors from changing the tarball they distribute without also incrementing the version number, so there can be no guarantee that a pristine tarball is identical to what upstream <emphasis>currently</emphasis> distributing at any point in time. All that can be expected is that it is identical to something that upstream once <emphasis>did</emphasis> distribute. If a difference arises later (say, if upstream notice that they weren't using maximal compression in their original distribution and then re-<command>gzip</command> it), that's just too bad. Since there is no good way to upload a new <filename>.orig.tar.{gz,bz2,xz}</filename> for the same version, there is not even any point in treating this situation as a bug.
it: Non possiamo impedire agli autori originali di cambiare il tarball che distribuiscono senza anche incrementare il numero di versione, quindi non ci può essere alcuna garanzia che in qualsiasi momento un tarball puro sia identico a quello di upstream <emphasis>attualmente</emphasis> in distribuzione. Tutto ciò che ci si può aspettare è che sia identico a qualcosa che l'autore originale una volta <emphasis>ha</emphasis> distribuito. Se una differenza dovesse emergere in seguito (ad esempio, se l'upstream si accorgesse che non stava usando la massima compressione nella distribuzione originale e dunque di comprimerlo nuovamente con <command>gzip</command>), semplicemente non è una buona cosa. Poiché non vi è alcun buon modo per caricare un nuovo <filename>.orig.tar.{gz,bz2,xz}</filename> per la stessa versione, non c'è nemmeno alcuna indicazione se trattare questa situazione come un bug.

source: The defining characteristic of a pristine source tarball is that the <filename>.orig.tar.{gz,bz2,xz}</filename> file is byte-for-byte identical to a tarball officially distributed by the upstream author.<placeholder type="footnote" id="0"/> This makes it possible to use checksums to easily verify that all changes between Debian's version and upstream's are contained in the Debian diff. Also, if the original source is huge, upstream authors and others who already have the upstream tarball can save download time if they want to inspect your packaging in detail.
it: La caratteristica distintiva di un tarball sorgente incontaminato è che il <filename>.orig.tar.{gz,bz2,xz}</filename> è byte-per-byte identico a un tarball ufficialmente distribuito dall'autore originale. <placeholder type="footnote" id="0"/> Questo rende possibile l'utilizzo di checksum per verificare facilmente che tutte le modifiche tra la versione di Debian e quella originale siano contenute nel Debian diff. Inoltre, se il sorgente originale è enorme, gli autori originali e chiunque possieda già l'archivio originale possono risparmiare tempo di download, se vogliono ispezionare il pacchetto in dettaglio.

source: There is no universally accepted guidelines that upstream authors follow regarding to the directory structure inside their tarball, but <command>dpkg-source</command> is nevertheless able to deal with most upstream tarballs as pristine source. Its strategy is equivalent to the following:
it: Non ci sono linee guida universalmente accettate che gli autori originali seguono per quanto riguarda la struttura delle cartelle all'interno del loro tarball, ma <command>dpkg-source</command> è tuttavia in grado di affrontare la maggior parte delle tarball originali come sorgente puro. La sua strategia è equivalente alla seguente:

source: It unpacks the tarball in an empty temporary directory by doing
it: Si scompatta l'archivio in una cartella temporanea vuota facendo

source: If, after this, the temporary directory contains nothing but one directory and no other files, <command>dpkg-source</command> renames that directory to <filename><replaceable>packagename</replaceable>-<replaceable>upstream-version</replaceable>(.orig)</filename>. The name of the top-level directory in the tarball does not matter, and is forgotten.
it: Se, dopo questo, la cartella temporanea non contiene nulla, ma una sola cartella e nessun altro file, <command>dpkg-source</command> rinomina quella cartella in <filename><replaceable>packagename</replaceable>-<replaceable>upstream-version</replaceable> (.orig)</filename>. Il nome della più alta cartella nella tarball non ha importanza, ed è tralasciata.

source: Otherwise, the upstream tarball must have been packaged without a common top-level directory (shame on the upstream author!). In this case, <command>dpkg-source</command> renames the temporary directory <emphasis>itself</emphasis> to <filename><replaceable>packagename</replaceable>-<replaceable>upstream-version</replaceable>(.orig)</filename>.
it: In caso contrario, l'archivio originale deve essere stato confezionato senza una comune cartella di livello alto (vergogna sull'autore originale!). In questo caso, <command>dpkg-source</command> rinomina la cartella temporanea <emphasis>stessa</emphasis> in <filename><replaceable>packagename</replaceable>-<replaceable>upstream-version</replaceable> (.orig)</filename>.

source: Repackaged upstream source
it: Sorgente originale ripacchettizzato

source: You <emphasis role="strong">should</emphasis> upload packages with a pristine source tarball if possible, but there are various reasons why it might not be possible. This is the case if upstream does not distribute the source as gzipped tar at all, or if upstream's tarball contains non-DFSG-free material that you must remove before uploading.
it: <emphasis role="strong">Si dovrebbe</emphasis> caricare i pacchetti con un tarball sorgente puro, se possibile, ma ci sono vari motivi per cui potrebbe non essere possibile. Questo è il caso in cui se l'autore originale non distribuisce il sorgente come non completamente compresso in formato tar, o se il tarball originale contiene materiale non DFSG-free che è necessario rimuovere prima di caricare.

source: In these cases the developer must construct a suitable <filename>.orig.tar.{gz,bz2,xz}</filename> file themselves. We refer to such a tarball as a repackaged upstream source. Note that a repackaged upstream source is different from a Debian-native package. A repackaged source still comes with Debian-specific changes in a separate <filename>.diff.gz</filename> or <filename>.debian.tar.{gz,bz2,xz}</filename> and still has a version number composed of <replaceable>upstream-version</replaceable> and <replaceable>debian-version</replaceable>.
it: In questi casi, lo sviluppatore deve costruirsi un <filename>.orig.tar.{gz,bz2,xz}</filename> adatto. Ci si riferisce a un tale tarball come sorgente originale ripacchettizato. Si noti che un sorgente originale ripacchettizato è diverso da un pacchetto Debian nativo. Un sorgente originale ripacchettizato con modifiche specifiche per Debian ancora viene distribuito in un separato <filename>.diff.gz</filename> o <filename>.debian.tar.{gz,bz2,xz}</filename> e ha ancora un numero di versione composto da <replaceable>upstream-version</replaceable> e <replaceable>debian-version</replaceable>.

source: There may be cases where it is desirable to repackage the source even though upstream distributes a <filename>.tar.{gz,bz2,xz}</filename> that could in principle be used in its pristine form. The most obvious is if <emphasis>significant</emphasis> space savings can be achieved by recompressing the tar archive or by removing genuinely useless cruft from the upstream archive. Use your own discretion here, but be prepared to defend your decision if you repackage source that could have been pristine.
it: Ci possono essere casi in cui è auspicabile pacchettizzare nuovamente il sorgente anche se l'autore originale distribuisce un <filename>.tar.{gz,bz2,xz}</filename> che potrebbe in linea di principio essere utilizzato nella sua forma originaria. Il più ovvio è se un <emphasis>significativo</emphasis> risparmio di spazio può essere ottenuto ricomprimendo l'archivio tar o rimuovendo genuinamente dell'inutile fuffa dall'archivio originale. Si usi la propria discrezione qui, ma si sia pronti a difendere la propria decisione se si pacchettizza nuovamente il sorgente che poteva esser puro.

source: A repackaged <filename>.orig.tar.{gz,bz2,xz}</filename>
it: Un <filename>.orig.tar.{gz,bz2,xz}</filename> ripacchettizzato
