Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: New maintainers usually have certain difficulties creating Debian packages — this is quite understandable. They will do mistakes. That's why sponsoring a brand new package into Debian requires a thorough review of the Debian packaging. Sometimes several iterations will be needed until the package is good enough to be uploaded to Debian. Thus being a sponsor implies being a mentor.
it: I nuovi maintainer di solito hanno alcune difficoltà nel creare pacchetti Debian - questo è abbastanza comprensibile. Faranno errori. Ecco perché sponsorizzare un nuovo pacchetto in Debian richiede una profonda conoscenza della pacchettizzazione in Debian. A volte saranno necessarie diverse iterazioni fino a quando il pacchetto sarà abbastanza buono per essere caricato in Debian. Quindi essere uno sponsor implica essere un mentore.

source: Don't ever sponsor a new package without reviewing it. The review of new packages done by ftpmasters mainly ensures that the software is really free. Of course, it happens that they stumble on packaging problems but they really should not. It's your task to ensure that the uploaded package complies with the Debian Free Software Guidelines and is of good quality.
it: Non bisogna mai sponsorizzare un nuovo pacchetto senza revisionarlo. La revisione dei nuovi pacchetti realizzata da ftpmasters assicura principalmente che il software sia veramente libero. Certo, capita che inciampino sui problemi di pacchettizzazione, ma in realtà non dovrebbero. È il proprio compito garantire che il pacchetto caricato sia conforme alle Free Software Guidelines di Debian e sia di buona qualità.

source: You can find more checks in the wiki where several developers share their own <ulink url="https://wiki.debian.org/SponsorChecklist">sponsorship checklists</ulink>.
it: Si possono trovare altri controlli nella wiki nella quale diversi sviluppatori condividono le proprie <ulink url="http://wiki.debian.org/SponsorChecklist">liste di sponsorizzazione</ulink>.

source: Building the package and testing the software is part of the review, but it's also not enough. The rest of this section contains a non-exhaustive list of points to check in your review. <placeholder type="footnote" id="0"/>
it: La compilazione del pacchetto e il testare il software è parte della revisione, ma non è anche sufficiente. Il resto di questa sezione contiene un elenco non esaustivo dei punti da controllare nella vostra revisione. <placeholder type="footnote" id="0"/>

source: Verify that the upstream tarball provided is the same that has been distributed by the upstream author (when the sources are repackaged for Debian, generate the modified tarball yourself).
it: Verificare che il tarball originale fornito sia lo stesso che è stato distribuito dall'autore principale (quando i sorgenti sono stati ripacchettizzati per Debian, generare da soli la tarball modificata).

source: Run <command>lintian</command> (see <xref linkend="lintian"/>). It will catch many common problems. Be sure to verify that any <command>lintian</command> overrides setup by the maintainer is fully justified.
it: Eseguire <command>lintian</command> (si consulti <xref linkend="lintian"/>). Troverà molti problemi comuni. Assicurarsi di verificare che qualsiasi <command>lintian</command> che sovrascriva la configurazione fatta dal maintainer sia pienamente giustificata.

source: Run <command>licensecheck</command> (part of <xref linkend="devscripts"/>) and verify that <filename>debian/copyright</filename> seems correct and complete. Look for license problems (like files with “All rights reserved” headers, or with a non-DFSG compliant license). <command>grep -ri</command> is your friend for this task.
it: Eseguire <command>licensecheck</command> (parte di <xref linkend="devscripts"/>) e verificare che <filename>debian/copyright</filename> sia corretto e completo. Cercare i problemi di licenza (come i file con intestazioni del tipo “All rights reserved”, o con una licenza non compatibile con DFSG). <command>grep -ri</command> è un amico per questo compito.

source: Build the package with <command>pbuilder</command> (or any similar tool, see <xref linkend="pbuilder"/>) to ensure that the build-dependencies are complete.
it: Compilare il pacchetto con <command>pbuilder</command> (o qualsiasi strumento simile, vedi <xref linkend="pbuilder"/>) per garantire che le dipendenze di compilazione siano soddisfatte.

source: Proofread <filename>debian/control</filename>: does it follow the best practices (see <xref linkend="bpp-debian-control"/>)? Are the dependencies complete?
it: Correggere <filename>debian/control</filename>: segue le buone pratiche (si consulti <xref linkend="bpp-debian-control"/>)? Sono soddisfatte le dipendenze?

source: Proofread <filename>debian/rules</filename>: does it follow the best practices (see <xref linkend="bpp-debian-rules"/>)? Do you see some possible improvements?
it: Correggere <filename>debian/rules</filename>: rispecchia le buone pratiche (si consulti <xref linkend="bpp-debian-rules"/>)? Vedete alcuni possibili miglioramenti?

source: Proofread the maintainer scripts (<filename>preinst</filename>, <filename>postinst</filename>, <filename>prerm</filename>, <filename>postrm</filename>, <filename>config</filename>): will the <filename>preinst</filename>/<filename>postrm</filename> work when the dependencies are not installed? Are all the scripts idempotent (i.e. can you run them multiple times without consequences)?
it: Correggere gli script del maintainer (<filename>preinst</filename>, <filename>postinst</filename>, <filename>prerm</filename>, <filename>postrm</filename>, <filename>config</filename>): <filename>preinst</filename>/<filename>postrm</filename> funzioneranno quando le dipendenze non sono installate? Tutti gli script sono idempotenti (cioè si possono eseguire più volte senza conseguenze)?

source: Review any change to upstream files (either in <filename>.diff.gz</filename>, or in <filename>debian/patches/</filename> or directly embedded in the <filename>debian</filename> tarball for binary files). Are they justified? Are they properly documented (with <ulink url="&url-dep3;">DEP-3</ulink> for patches)?
it: Controllare ogni modifica ai file originali (sia in <filename>.diff.gz</filename>, o in <filename>debian/patches/</filename> o direttamente incluse nella tarball <filename>debian</filename> dei file binari). Sono giustificate? Sono adeguatamente documentate (con <ulink url="&url-dep3;">DEP-3</ulink> per le patch)?

source: For every file, ask yourself why the file is there and whether it's the right way to achieve the desired result. Is the maintainer following the best packaging practices (see <xref linkend="best-pkging-practices"/>)?
it: Per ogni file, ci si chieda perché il file è lì e se è il modo giusto per ottenere il risultato desiderato. Il maintainer sta seguendo le best practices per la pacchettizzazione (si consulti <xref linkend="best-pkging-practices"/>)?

source: Build the packages, install them and try the software. Ensure you can remove and purge the packages. Maybe test them with <command>piuparts</command>.
it: Compilare i pacchetti, installarli e provare il software. Assicurarsi di poter rimuovere ed eliminare i pacchetti. Forse provarli con <command>piuparts</command>.

source: If the audit did not reveal any problem, you can build the package and upload it to Debian. Remember that even if you're not the maintainer, as a sponsor you are still responsible for what you upload to Debian. That's why you're encouraged to keep up with the package through the <xref linkend="pkg-tracker"/>.
it: Se il controllo non ha evidenziato alcun problema, si può compilare il pacchetto e caricarlo su Debian. Ricordare che, anche se non si è il maintainer, in qualità di sponsor si è ancora responsabile per ciò che si carica in Debian. Ecco perché si è incoraggiati a tenere il passo con il pacchetto attraverso il <xref linkend="pkg-tracker"/>.

source: Note that you should not need to modify the source package to put your name in the <filename>changelog</filename> or in the <filename>control</filename> file. The <literal>Maintainer</literal> field of the <filename>control</filename> file and the <filename>changelog</filename> should list the person who did the packaging, i.e. the sponsoree. That way they will get all the BTS mail.
it: Si noti che non dovrebbe essere necessario modificare il pacchetto sorgente per inserire il proprio nome nella <filename>changelog</filename> o nel file di <filename>control</filename>. Il campo <literal>Maintainer</literal> del file <filename>control</filename> e del file <filename>changelog</filename> dovrebbe elencare la persona che ha fatto la pacchettizzazione, ossia la persona sponsorizzata. In questo modo riceveranno tutta la posta BTS.

source: Instead you should instruct <command>dpkg-buildpackage</command> to use your key for the signature. You do that with the <literal>-k</literal> option:
it: Invece di dovrebbe istruire <command>dpkg-buildpackage</command> ad usare la propria chiave per la firma. Lo si fa con l'opzione <literal>-k</literal>:

source: If you use <command>debuild</command> and <command>debsign</command>, you can even configure it permanently in <filename>~/.devscripts</filename>:
it: Se si usa <command>debuild</command> e <command>debsign</command>, si può anche configurarlo in modo permanente in <filename>~/devscripts</filename>.:

source: Sponsoring an update of an existing package
it: Sponsorizzare un aggiornamento di un pacchetto esistente

source: You will usually assume that the package has already gone through a full review. So instead of doing it again, you will carefully analyze the difference between the current version and the new version prepared by the maintainer. If you have not done the initial review yourself, you might still want to have a more deeper look just in case the initial reviewer was sloppy.
it: Normalmente si presupporrà che il pacchetto sia già passato attraverso una revisione completa. Così, invece di farlo di nuovo, si analizzerà attentamente la differenza tra la versione attuale e la nuova versione preparata dal maintainer. Se non si è fatta da soli la revisione iniziale, si potrebbe anche voler dare uno sguardo più profondo nel caso in cui il revisore iniziale fosse stato sciatto.

source: To be able to analyze the difference you need both versions. Download the current version of the source package (with <command>apt-get source</command>) and rebuild it (or download the current binary packages with <command>aptitude download</command>). Download the source package to sponsor (usually with <command>dget</command>).
it: Per essere in grado di analizzare la differenza è necessario avere entrambe le versioni. Scaricare la versione attuale del pacchetto sorgente (con <command>apt-get source</command>) e ricompilarlo (o scaricare gli attuali pacchetti binari con <command>aptitude download</command>). Scaricare il pacchetto sorgente da sponsorizzare (di solito con <command>dget</command>).

source: Read the new changelog entry, it should tell you what to expect during the review. The main tool you will use is <command>debdiff</command> (provide by the <systemitem role="package">devscripts</systemitem> package), you can run it with two source packages (<filename>.dsc</filename> files), or two binary packages, or two <filename>.changes</filename> files (it will then compare all the binary packages listed in the <filename>.changes</filename>).
it: Leggere la nuova voce del changelog, dovrebbe dire cosa aspettarsi durante la revisione. Il principale strumento che si utilizzerà è <command>debdiff</command> (fornito con il pacchetto <systemitem role="package">devscripts</systemitem>), lo si può eseguire con due pacchetti sorgente (i file <filename>.dsc</filename>), o due file <filename>.changes</filename> (allora confronterà tutti i pacchetti binari elencati nel file <filename>.changes</filename>).

source: If you compare the source packages (excluding upstream files in the case of a new upstream version, for example by filtering the output of <command>debdiff</command> with <command>filterdiff -i '*/debian/*'</command>), you must understand all the changes you see and they should be properly documented in the Debian changelog.
it: Se si confrontano i pacchetti sorgente (esclusi i file originali nel caso di una nuova versione, ad esempio filtrando l'output di <command>debdiff</command> con <command>filterdiff-i '*/debian/*'</command>), è necessario capire tutti i cambiamenti che vedrete e che devono essere adeguatamente documentati nel changelog Debian.

source: If everything is fine, build the package and compare the binary packages to verify that the changes on the source package have no unexpected consequences (like some files dropped by mistake, missing dependencies, etc.).
it: Se tutto va bene, compilare il pacchetto e confrontare i pacchetti binari per verificare che le modifiche sul pacchetto sorgente non abbiano conseguenze inattese (come alcuni file cancellati per errore, le dipendenze non soddisfatte, etc).

source: You might want to check out the Package Tracking System (see <xref linkend="pkg-tracker"/>) to verify if the maintainer has not missed something important. Maybe there are translations updates sitting in the BTS that could have been integrated. Maybe the package has been NMUed and the maintainer forgot to integrate the changes from the NMU into their package. Maybe there's a release critical bug that they have left unhandled and that's blocking migration to <literal>testing</literal>. If you find something that they could have done (better), it's time to tell them so that they can improve for next time, and so that they have a better understanding of their responsibilities.
it: Si potrebbe controllare il Package Tracking System (si consulti <xref linkend="pkg-tracker"/>) per verificare se il maintainer non abbia perso qualcosa di importante. Magari ci sono aggiornamenti di traduzioni che stanziano nel BTS e che sarebbero potute essere integrate. Forse il pacchetto è stato NMUed e il maintainer ha dimenticato di integrare le modifiche nel loro pacchetto dal NMU. Forse c'è un rilascio per un bug critico che hanno lasciato non gestito e che sta bloccando la migrazione in <literal>testing</literal>. Se si trova qualcosa che avrebbero potuto fare (meglio), è il momento di dirglielo in modo che per la prossima volta possano migliorare e in modo che abbiano una migliore comprensione delle loro responsabilità.

source: If you have found no major problem, upload the new version. Otherwise ask the maintainer to provide you a fixed version.
it: Se non si è trovato alcun grande problema, caricare la nuova versione. In caso contrario, chiedere al maintainer di fornire una versione corretta.

source: Advocating new developers
it: Promuovere nuovi sviluppatori

source: See the page about <ulink url="&url-newmaint-advocate;">advocating a prospective developer</ulink> at the Debian web site.
it: Consultare la pagina <ulink url="&url-newmaint-advocate;">Promuovere nuovi sviluppatori</ulink> sul sito web di Debian.

source: Handling new maintainer applications
it: Gestire nuove candidature di maintainer

source: Please see <ulink url="&url-newmaint-amchecklist;">Checklist for Application Managers</ulink> at the Debian web site.
it: Consultare la <ulink url="&url-newmaint-amchecklist;">Checklist per i Gestori delle Candidature</ulink> sul sito web di Debian.

source: Debian Developer's Duties
it: Doveri di un Debian Developer

source: Package Maintainer's Duties
it: Doveri di un maintainer di pacchetti

source: As a package maintainer, you're supposed to provide high-quality packages that are well integrated in the system and that adhere to the Debian Policy.
it: Come un maintainer di un pacchetto, si suppone che si forniranno pacchetti di alta qualità che siano ben integrati nel sistema e che aderiscano alla Policy di Debian.

source: Work towards the next <literal>stable</literal> release
it: Lavorare per il prossimo rilascio <literal>stable</literal>

source: Providing high-quality packages in <literal>unstable</literal> is not enough, most users will only benefit from your packages when they are released as part of the next <literal>stable</literal> release. You are thus expected to collaborate with the release team to ensure your packages get included.
it: Fornire pacchetti di alta qualità in <literal>unstable</literal> non è abbastanza, la maggior parte degli utenti beneficeranno dei vostri pacchetti solo quando sono rilasciati come parte del prossimo rilascio <literal>stable</literal>. Si è quindi tenuti a collaborare con il gruppo di rilascio per essere sicuri che i vostri pacchetti vengano inclusi.

source: More concretely, you should monitor whether your packages are migrating to <literal>testing</literal> (see <xref linkend="testing"/>). When the migration doesn't happen after the test period, you should analyze why and work towards fixing this. It might mean fixing your package (in the case of release-critical bugs or failures to build on some architecture) but it can also mean updating (or fixing, or removing from <literal>testing</literal>) other packages to help complete a transition in which your package is entangled due to its dependencies. The release team might provide you some input on the current blockers of a given transition if you are not able to identify them.
it: Più concretamente, si dovrà controllare che i pacchetti stiano migrando verso <literal>testing</literal> (si consulti <xref linkend="testing"/>). Quando la migrazione non avviene dopo il periodo di prova, si deve analizzare il motivo e lavorare per correggerlo. Potrebbe significare correggere il pacchetto (nel caso dei bug critici per il rilascio o di fallimenti nella compilazione su alcune architetture), ma potrebbe anche significare l'aggiornamento (o di correzione, o di rimozione da <literal>testing</literal>) di altri pacchetti per aiutare il completamento di una transizione in cui il proprio pacchetto è incastrato a causa delle sue dipendenze. Il team di rilascio potrebbe fornire alcuni input sugli attuali blocchi di una data transizione, se non si è in grado di identificarli.

source: Maintain packages in <literal>stable</literal>
it: Mantenere i pacchetti in <literal>stable</literal>

source: Most of the package maintainer's work goes into providing updated versions of packages in <literal>unstable</literal>, but their job also entails taking care of the packages in the current <literal>stable</literal> release.
it: La maggior parte del lavoro del maintainer del pacchetto è fornire versioni aggiornate dei pacchetti in <literal>unstable</literal>, ma il loro lavoro comporta anche prendersi cura dei pacchetti nell'attuale rilascio <literal>stable</literal>.

source: While changes in <literal>stable</literal> are discouraged, they are possible. Whenever a security problem is reported, you should collaborate with the security team to provide a fixed version (see <xref linkend="bug-security"/>). When bugs of severity important (or more) are reported against the <literal>stable</literal> version of your packages, you should consider providing a targeted fix. You can ask the <literal>stable</literal> release team whether they would accept such an update and then prepare a <literal>stable</literal> upload (see <xref linkend="upload-stable"/>).
it: Mentre i cambiamenti in <literal>stable</literal> sono scoraggiati, sono comunque possibili. Ogni volta che un problema di sicurezza è segnalato, si dovrebbe collaborare con il team di sicurezza per fornire una versione corretta (si veda <xref linkend="bug-security"/>). Quando i bug di gravità importante (o più) vengono segnalati per la versione <literal>stable</literal> dei propri pacchetti, si dovrebbe valutare la possibilità di fornire una correzione mirata. Si potrà chiedere al team di rilascio <literal>stable</literal> se accettano tale tipo di aggiornamento e poi preparare un caricamento <literal>stable</literal> (si consulti <xref linkend="upload-stable"/>).

source: Manage release-critical bugs
it: Gestire i bug critici per il rilascio

source: Generally you should deal with bug reports on your packages as described in <xref linkend="bug-handling"/>. However, there's a special category of bugs that you need to take care of — the so-called release-critical bugs (RC bugs). All bug reports that have severity <literal>critical</literal>, <literal>grave</literal> or <literal>serious</literal> make the package unsuitable for inclusion in the next <literal>stable</literal> release. They can thus delay the Debian release (when they affect a package in <literal>testing</literal>) or block migrations to <literal>testing</literal> (when they only affect the package in <literal>unstable</literal>). In the worst scenario, they will lead to the package's removal. That's why these bugs need to be corrected as quickly as possible.
it: In generale si dovrebbe affrontare le segnalazioni di bug sui propri pacchetti come è descritto in <xref linkend="bug-handling"/>. Tuttavia, c'è una categoria speciale di bug di cui vi dovrete prendere cura - i cosiddetti bug critici per il rilascio (RC bug). Tutte le segnalazioni di bug che hanno gravità <literal>critical</literal>, <literal>grave</literal> o <literal>serious</literal> rendono il pacchetto non adatto per l'inclusione nel prossimo rilascio <literal>stable</literal>. Quindi possono ritardare il rilascio di Debian (quando riguardano un pacchetto in <literal>testing</literal>) o bloccare migrazioni in <literal>testing</literal> (quando influiscono solo sul pacchetto in <literal>unstable</literal >). Nello scenario peggiore, procederanno alla rimozione del pacchetto. Ecco perché questi bug devono essere corretti al più presto.

source: If, for any reason, you aren't able fix an RC bug in a package of yours within 2 weeks (for example due to time constraints, or because it's difficult to fix), you should mention it clearly in the bug report and you should tag the bug <literal>help</literal> to invite other volunteers to chime in. Be aware that RC bugs are frequently the targets of Non-Maintainer Uploads (see <xref linkend="nmu"/>) because they can block the <literal>testing</literal> migration of many packages.
it: Se, per qualsiasi motivo, non potete risolvere un bug RC in uno dei vostri pacchetti entro 2 settimane (per esempio a causa di vincoli di tempo, o perché è difficile da correggere), si dovrebbe accennarlo chiaramente nel bug report e si dovrebbe contrassegnare il bug come <literal>help</literal> in modo da invitare altri volontari a partecipare alla sua risoluzione. Si sia consapevoli che i bug RC sono spesso bersaglio di Non-Maintainer Uploads (si consulti <xref linkend="nmu"/>) perché in grado di bloccare la migrazione in <literal>testing</literal> di molti pacchetti.

source: Lack of attention to RC bugs is often interpreted by the QA team as a sign that the maintainer has disappeared without properly orphaning their package. The MIA team might also get involved, which could result in your packages being orphaned (see <xref linkend="mia-qa" />).
it: La mancanza di attenzione per i bug RC è spesso interpretata dal team QA come un segno che il maintainer è scomparso senza aver correttamente reso orfano il suo pacchetto. Il team MIA potrebbe anche mettersi in gioco, che potrebbe concretizzarsi nel rendere orfani i vostri pacchetti (si consulti <xref linkend="mia-qa" />).

source: Coordination with upstream developers
it: Coordinamento con gli sviluppatori originali
