Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: Best Packaging Practices
it: Buone pratiche per la pacchettizzazione

source: Debian's quality is largely due to the <ulink url="&url-debian-policy;">Debian Policy</ulink>, which defines explicit baseline requirements which all Debian packages must fulfill. Yet there is also a shared history of experience which goes beyond the Debian Policy, an accumulation of years of experience in packaging. Many very talented people have created great tools, tools which help you, the Debian maintainer, create and maintain excellent packages.
it: La qualità della distribuzione Debian è in gran parte dovuta alla <ulink url="&url-debian-policy;">Debian Policy</ulink>, che definisce i requisiti di base espliciti che tutti i pacchetti Debian devono soddisfare. Ma vi è anche una storia condivisa di esperienza che va oltre la policy Debian, un accumulo di anni di esperienza nella pacchettizzazione. Molte persone di grande talento hanno creato grandi strumenti, strumenti che aiutano voi, i maintainer di Debian, a creare e mantenere ottimi pacchetti.

source: This chapter provides some best practices for Debian developers. All recommendations are merely that, and are not requirements or policy. These are just some subjective hints, advice and pointers collected from Debian developers. Feel free to pick and choose whatever works best for you.
it: Questo capitolo fornisce alcune buone pratiche per gli sviluppatori Debian. Tutte le raccomandazioni sono solo tali, e non sono requisiti o policy. Questi sono solo alcuni spunti soggettivi, i consigli e i punti raccolti da sviluppatori Debian. Ci si senta liberi di scegliere quello che funziona meglio.

source: Best practices for <filename>debian/rules</filename>
it: Buone pratiche per <filename>debian/rules</filename>

source: The following recommendations apply to the <filename>debian/rules</filename> file. Since <filename>debian/rules</filename> controls the build process and selects the files which go into the package (directly or indirectly), it's usually the file maintainers spend the most time on.
it: Le seguenti raccomandazioni si applicano al file <filename>debian/rules</filename>. Dal momento che il <filename>debian/rules</filename> controlla il processo di generazione e seleziona i file da inglobare nel pacchetto (direttamente o indirettamente), è normale che i maintainer del file spendano molto tempo su di esso.

source: Helper scripts
it: Script di supporto

source: The rationale for using helper scripts in <filename>debian/rules</filename> is that they let maintainers use and share common logic among many packages. Take for instance the question of installing menu entries: you need to put the file into <filename>/usr/share/menu</filename> (or <filename>/usr/lib/menu</filename> for executable binary menufiles, if this is needed), and add commands to the maintainer scripts to register and unregister the menu entries. Since this is a very common thing for packages to do, why should each maintainer rewrite all this on their own, sometimes with bugs? Also, supposing the menu directory changed, every package would have to be changed.
it: L'idea nell'utilizzo degli script di aiuto in <filename>debian/rules</filename> è che essi hanno consentito ai maintainer di usare e condividere la logica comune tra molti pacchetti. Si prenda per esempio la questione dell'installazione delle voci di menu: è necessario mettere il file in <filename>/usr/share/menu</filename> (o <filename>/usr/lib/menu</filename> per gli eseguibili binari dei menufile, se questo è necessario), e aggiungere i comandi agli script del maintainer per registrare ed annullare la registrazione delle voci di menu. Dal momento che questa è una cosa molto comune da fare con i pacchetti, perché ogni maintainer dovrebbe riscrivere tutto questo da solo, a volte con bug? Inoltre, supponendo che la cartella menu cambi, ogni pacchetto dovrebbe essere cambiato.

source: Helper scripts take care of these issues. Assuming you comply with the conventions expected by the helper script, the helper takes care of all the details. Changes in policy can be made in the helper script; then packages just need to be rebuilt with the new version of the helper and no other changes.
it: Gli script di supporto si occupano di questi problemi. Supponendo che ci si attenga alle convenzioni previste dallo script di supporto, quest'ultimo si prende cura di tutti i dettagli. Cambiamenti nella policy possono essere effettuati nello script helper; successivamente i pacchetti avranno solo bisogno di essere ricompilati con la nuova versione dell'helper e nessuna ulteriore modifica.

source: <xref linkend="tools"/> contains a couple of different helpers. The most common and best (in our opinion) helper system is <systemitem role="package">debhelper</systemitem>. Previous helper systems, such as <systemitem role="package">debmake</systemitem>, were monolithic: you couldn't pick and choose which part of the helper you found useful, but had to use the helper to do everything. <systemitem role="package">debhelper</systemitem>, however, is a number of separate little <command>dh_*</command> programs. For instance, <command>dh_installman</command> installs and compresses man pages, <command>dh_installmenu</command> installs menu files, and so on. Thus, it offers enough flexibility to be able to use the little helper scripts, where useful, in conjunction with hand-crafted commands in <filename>debian/rules</filename>.
it: <xref linkend="tools"/> contiene un paio di diversi script di supporto. Il sistema di supporto più comune e migliore (a nostro parere) è <systemitem role="package">debhelper</systemitem>. I sistemi di supporto precedenti, come <systemitem role="package">debmake</systemitem>, erano monolitici: non si poteva scegliere quale parte dell'helper si riteneva utile, ma si doveva usare l'helper per fare tutto. <systemitem role="package">debhelper</systemitem>, invece, è una serie di programmi piccoli e separati <command>dh_*</command>. Per esempio, <command>dh_installman</command> installa e comprime le pagine man, <command>dh_installmenu</command> installa i file di menu, e così via. Così, si offre sufficiente flessibilità per essere in grado di utilizzare i piccoli script di aiuto, dove utile, in abbinamento con i comandi manuali in <filename>debian/rules</filename>.

source: You can get started with <systemitem role="package">debhelper</systemitem> by reading <citerefentry> <refentrytitle>debhelper</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, and looking at the examples that come with the package. <command>dh_make</command>, from the <systemitem role="package">dh-make</systemitem> package (see <xref linkend="dh-make"/>), can be used to convert a vanilla source package to a <systemitem role="package">debhelper</systemitem>ized package. This shortcut, though, should not convince you that you do not need to bother understanding the individual <command>dh_*</command> helpers. If you are going to use a helper, you do need to take the time to learn to use that helper, to learn its expectations and behavior.
it: Si può iniziare con <systemitem role="package">debhelper</systemitem> leggendo <citerefentry> <refentrytitle>debhelper</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, e guardando gli esempi distribuiti con il pacchetto. <command>dh_make</command>, dal pacchetto <systemitem role="package">dh-make</systemitem> (si consulti <xref linkend="dh-make"/>), può essere utilizzato per convertire un pacchetto sorgente normale in un pacchetto <systemitem role="package">debhelper</systemitem>izzato. Questa scorciatoia, però, non deve convincere che non è necessario preoccuparsi di capire i singoli script <command>dh_ *</command>. Se si ha intenzione di utilizzare uno script di supporto, ci si deve concedere il tempo necessario per imparare ad usare quello script, per imparare le sue previsioni e il suo comportamento.

source: Separating your patches into multiple files
it: Separare le proprie patch in più file

source: Big, complex packages may have many bugs that you need to deal with. If you correct a number of bugs directly in the source, and you're not careful, it can get hard to differentiate the various patches that you applied. It can get quite messy when you have to update the package to a new upstream version which integrates some of the fixes (but not all). You can't take the total set of diffs (e.g., from <filename>.diff.gz</filename>) and work out which patch sets to back out as a unit as bugs are fixed upstream.
it: Pacchetti grandi e complessi possono avere molti bug con cui ci si deve rapportare. Se si corregge una serie di bug direttamente nel sorgente, e non si sta attenti, può diventare difficile distinguere le varie patch che si sono applicate. Può essere abbastanza caotico quando è necessario aggiornare il pacchetto ad una nuova versione che integra alcune delle correzioni (ma non tutte). Non si può prendere l'intero insieme di diff (ad esempio, da <filename>.diff.gz</filename>) e capire quali patch occorrono per tornare indietro di una unità man mano che i bug vengono corretti nel sorgente originale.

source: Fortunately, with the source format “3.0 (quilt)” it is now possible to keep patches separate without having to modify <filename>debian/rules</filename> to setup a patch system. Patches are stored in <filename>debian/patches/</filename> and when the source package is unpacked patches listed in <filename>debian/patches/series</filename> are automatically applied. As the name implies, patches can be managed with <command>quilt</command>.
it: Fortunatamente, con il formato sorgente «3.0 (quilt)» è ora possibile mantenere le patch separate senza dover modificare <filename>debian/rules</filename> per impostare un sistema di patch. Le patch vengono memorizzate in <filename>debian/patches/</filename> e quando il pacchetto sorgente è spacchettato le patch elencate nel <filename>debian/patches/series</filename> vengono applicate automaticamente. Come suggerisce il nome, le patch possono essere gestite con <command>quilt</command>.

source: When using the older source “1.0”, it's also possible to separate patches but a dedicated patch system must be used: the patch files are shipped within the Debian patch file (<filename>.diff.gz</filename>), usually within the <filename>debian/</filename> directory. The only difference is that they aren't applied immediately by <command>dpkg-source</command>, but by the <literal>build</literal> rule of <filename>debian/rules</filename>, through a dependency on the <literal>patch</literal> rule. Conversely, they are reverted in the <literal>clean</literal> rule, through a dependency on the <literal>unpatch</literal> rule.
it: Quando si utilizza il più anziano sorgente «1.0», è anche possibile separare le patch, ma un sistema di patch dedicato deve essere utilizzato: i file di patch sono distribuiti all'interno del file di patch Debian (<filename>diff.gz</filename>.), di solito nella cartella <filename>debian/</filename>. L'unica differenza è che non vengono applicate immediatamente da <command>dpkg-source</command>, ma dalla regola <literal>build</literal> di <filename>debian/rules</filename>, attraverso una dipendenza dalla regola <literal>patch</literal>. Al contrario, essi sono annullati nella regola <literal>clean</literal>, attraverso una dipendenza dalla regola <literal>unpatch</literal>.

source: <command>quilt</command> is the recommended tool for this. It does all of the above, and also allows to manage patch series. See the <systemitem role="package">quilt</systemitem> package for more information.
it: <command>quilt</command> è lo strumento consigliato per questo. Fa tutto quanto detto precedentemente e permette anche di gestire le serie di patch. Si veda il pacchetto <systemitem role="package">quilt</systemitem> per ulteriori informazioni.

source: There are other tools to manage patches, like <command>dpatch</command>, and the patch system integrated with <systemitem role="package">cdbs</systemitem>.
it: Ci sono altri strumenti per gestire le patch, come <command>dpatch</command> e il sistema di patch integrato con <systemitem role="package">cdbs</systemitem>.

source: Multiple binary packages
it: Pacchetti binari multipli

source: A single source package will often build several binary packages, either to provide several flavors of the same software (e.g., the <systemitem role="package">vim</systemitem> source package) or to make several small packages instead of a big one (e.g., so the user can install only the subset needed, and thus save some disk space).
it: Un singolo pacchetto sorgente costruirà spesso diversi pacchetti binari, sia per fornire diverse versioni dello stesso software (ad esempio, il pacchetto sorgente <systemitem role="package">vim</systemitem>) o per fare diversi piccoli pacchetti invece di uno grande (ad esempio, in modo che l'utente possa installare solo il sottoinsieme necessario e quindi di risparmiare spazio su disco).

source: The second case can be easily managed in <filename>debian/rules</filename>. You just need to move the appropriate files from the build directory into the package's temporary trees. You can do this using <command>install</command> or <command>dh_install</command> from <systemitem role="package">debhelper</systemitem>. Be sure to check the different permutations of the various packages, ensuring that you have the inter-package dependencies set right in <filename>debian/control</filename>.
it: Il secondo caso può essere facilmente gestito in <filename>debian/rules</filename>. Bisogna solo spostare i file appropriati dalla cartella di compilazione in alberi temporanei del pacchetto. È possibile farlo utilizzando <command>install</command> o <command>dh_install</command> da <systemitem role="package">debhelper</systemitem>. Ci si assicuri di controllare le diverse permutazioni dei vari pacchetti, assicurandosi di avere il corretto insieme di dipendenze tra pacchetti in <filename>debian/control</filename>.

source: The first case is a bit more difficult since it involves multiple recompiles of the same software but with different configuration options. The <systemitem role="package">vim</systemitem> source package is an example of how to manage this using an hand-crafted <filename>debian/rules</filename> file.
it: Il primo caso è un po' più difficile in quanto comporta molteplici ricompilazioni dello stesso software, ma con diverse opzioni di configurazione. Il pacchetto sorgente <systemitem role="package">vim</systemitem> è un esempio di come gestirlo utilizzando un file <filename>debian/rules</filename> scritto a mano.

source: Best practices for <filename>debian/control</filename>
it: Buone pratiche per <filename>debian/control</filename>

source: The following practices are relevant to the <filename>debian/control</filename> file. They supplement the <ulink url="&url-debian-policy;ch-binary.html#s-descriptions">Policy on package descriptions</ulink>.
it: Le seguenti pratiche sono rilevanti per il file<filename>debian/control</filename>. Esse integrano la <ulink url="&url-debian-policy;ch-binary.html#s-descriptions">Policy sulla descrizione dei pacchetti</ulink>.

source: The description of the package, as defined by the corresponding field in the <filename>control</filename> file, contains both the package synopsis and the long description for the package. <xref linkend="bpp-desc-basics"/> describes common guidelines for both parts of the package description. Following that, <xref linkend="bpp-pkg-synopsis"/> provides guidelines specific to the synopsis, and <xref linkend="bpp-pkg-desc"/> contains guidelines specific to the description.
it: La descrizione del pacchetto, come definito dal corrispondente campo nel file <filename>control</filename>, contiene sia la sinossi del pacchetto sia la descrizione lunga del pacchetto. <xref linkend="bpp-desc-basics"/> descrive le linee guida comuni ad entrambe le parti della descrizione del pacchetto. In seguito, <xref linkend="bpp-pkg-synopsis"/> fornisce specifiche linee guida per la sinossi e <xref linkend="bpp-pkg-desc"/> contiene specifiche linee guida per la descrizione.

source: General guidelines for package descriptions
it: Linee guida generali per le descrizioni dei pacchetti

source: The package description should be written for the average likely user, the average person who will use and benefit from the package. For instance, development packages are for developers, and can be technical in their language. More general-purpose applications, such as editors, should be written for a less technical user.
it: La descrizione del pacchetto dovrebbe essere scritta probabilmente per l'utente medio, la persona media che utilizzerà ed avrà benefici dal pacchetto. Per esempio, pacchetti di sviluppo sono per gli sviluppatori e possono essere di natura tecnica nella loro linguaggio. Applicazioni più generiche, come gli editor, dovrebbero essere scritte per un utente meno tecnico.

source: Our review of package descriptions lead us to conclude that most package descriptions are technical, that is, are not written to make sense for non-technical users. Unless your package really is only for technical users, this is a problem.
it: La nostra analisi delle descrizioni dei pacchetti ci porta a concludere che la maggior parte delle descrizioni dei pacchetti sono di natura tecnica, cosi è, non sono scritte per avere senso per gli utenti non tecnici. A meno che il proprio pacchetto non sia realmente solo per utenti tecnici, questo costituisce un problema.

source: How do you write for non-technical users? Avoid jargon. Avoid referring to other applications or frameworks that the user might not be familiar with — GNOME or KDE is fine, since users are probably familiar with these terms, but GTK+ is probably not. Try not to assume any knowledge at all. If you must use technical terms, introduce them.
it: Come si scrive per gli utenti non tecnici? Si eviti il gergo. Evitare di riferirsi ad altre applicazioni o framework che l'utente potrebbe non conoscere - GNOME o KDE va bene, dal momento che gli utenti hanno probabilmente familiarità con questi termini, ma GTK+ probabilmente non lo è. Cercare di ipotizzare nessuna conoscenza a priori. Se è necessario utilizzare termini tecnici, spiegarli.

source: Be objective. Package descriptions are not the place for advocating your package, no matter how much you love it. Remember that the reader may not care about the same things you care about.
it: Si sia obiettivi. Le descrizioni dei pacchetti non sono il posto per promuovere il proprio pacchetto, non importa quanto lo si ami. Ricordare che il lettore potrebbe non essere interessato alle stesse cose che vi interessano.

source: References to the names of any other software packages, protocol names, standards, or specifications should use their canonical forms, if one exists. For example, use X Window System, X11, or X; not X Windows, X-Windows, or X Window. Use GTK+, not GTK or gtk. Use GNOME, not Gnome. Use PostScript, not Postscript or postscript.
it: I riferimenti ai nomi di eventuali altri pacchetti software, nomi di protocollo, standard o specifiche dovrebbero utilizzare la forma canonica, se ne esiste una. Ad esempio, utilizzare X Window System, X11 o X, non X Windows, X-Windows o X Window. Utilizzare GTK +, non GTK o gtk. Usare GNOME, non Gnome. Utilizzare PostScript, non Postscript o postscript.

source: If you are having problems writing your description, you may wish to send it along to &email-debian-l10n-english; and request feedback.
it: Se si hanno problemi di scrittura della descrizione, si potrebbe desiderare di inviarla all'indirizzo di posta elettronica &email-debian-l10n-english; richiedendo un parere.

source: The package synopsis, or short description
it: La sinossi del pacchetto, o una breve descrizione

source: Policy says the synopsis line (the short description) must be concise, not repeating the package name, but also informative.
it: La policy dice che la linea di sinossi (la breve descrizione) deve essere concisa ma anche informativa, non ripetendo il nome del pacchetto.

source: The synopsis functions as a phrase describing the package, not a complete sentence, so sentential punctuation is inappropriate: it does not need extra capital letters or a final period (full stop). It should also omit any initial indefinite or definite article — "a", "an", or "the". Thus for instance:
it: Le sinossi funziona come una frase che descrive il pacchetto, non una frase completa, perciò la punteggiatura è inappropriata: non ha bisogno di lettere maiuscole in più o un punto finale (punto). Dovrebbe anche omettere qualsiasi iniziale articolo indefinito o definito - «a», «un» o «il». Così, per esempio:

source: Package: libeg0 Description: exemplification support library
it: Package: libeg0 Description: esempio di libreria di supporto

source: Technically this is a noun phrase minus articles, as opposed to a verb phrase. A good heuristic is that it should be possible to substitute the package <replaceable>name</replaceable> and <replaceable>synopsis</replaceable> into this formula:
it: Tecnicamente si tratta di un sintagma nominale senza articoli, al contrario di una frase verbale. Una buona euristica è che dovrebbe essere possibile sostituire il <replaceable>nome</replaceable> e la <replaceable>sinossi</replaceable> del pacchetto in questa formula:

source: The package <replaceable>name</replaceable> provides {a,an,the,some} <replaceable>synopsis</replaceable>.
it: Il pacchetto <replaceable>name</replaceable> fornisce {a, un, il, alcuni} <replaceable>sinossi</replaceable>.

source: Sets of related packages may use an alternative scheme that divides the synopsis into two parts, the first a description of the whole suite and the second a summary of the package's role within it:
it: Insiemi di pacchetti correlati possono utilizzare uno schema alternativo che divide la sinossi in due parti, la prima una descrizione di tutta la suite e la seconda una sintesi del ruolo del pacchetto all'interno di essa:

source: These synopses follow a modified formula. Where a package "<replaceable>name</replaceable>" has a synopsis "<replaceable>suite</replaceable> (<replaceable>role</replaceable>)" or "<replaceable>suite</replaceable> - <replaceable>role</replaceable>", the elements should be phrased so that they fit into the formula:
it: Queste sinossi seguono una formula modificata. Quando un pacchetto «<replaceable>name</replaceable>» ha una «<replaceable>suite</replaceable> di sinossi (<replaceable>role</replaceable>) » o «<replaceable>suite</replaceable> - <replaceable>role</replaceable>», gli elementi devono essere formulati in modo che si inseriscano nella formula:

source: The package <replaceable>name</replaceable> provides {a,an,the} <replaceable>role</replaceable> for the <replaceable>suite</replaceable>.
it: Il <replaceable>name</replaceable> del pacchetto fornisce {a, un, il} <replaceable>role</replaceable> per la <replaceable>suite</replaceable>.

source: The long description
it: La descrizione lunga

source: The long description is the primary information available to the user about a package before they install it. It should provide all the information needed to let the user decide whether to install the package. Assume that the user has already read the package synopsis.
it: La descrizione lunga è la principale informazione sul pacchetto disponibile agli utenti prima che lo si installi. Essa dovrebbe fornire tutte le informazioni necessarie per permettere all'utente di decidere se installare il pacchetto. Si supponga che l'utente abbia già letto la sinossi del pacchetto.

source: The long description should consist of full and complete sentences.
it: La descrizione lunga deve essere composta da frasi complete ed esaustive.
