Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: The first and most important thing is to respond quickly to bug or issues raised by porters. Please treat porters with courtesy, as if they were in fact co-maintainers of your package (which, in a way, they are). Please be tolerant of succinct or even unclear bug reports; do your best to hunt down whatever the problem is.
it: La prima e la più importante cosa è quella di rispondere rapidamente a bug o problemi sollevati dagli autori di port. Trattare gli autori di port con cortesia, come se fossero nei fatti co-maintainer del pacchetto (cosa che, in un certo senso, sono). Si sia tolleranti nei confronti di segnalazioni di bug scarne o addirittura non chiare; fare del prorpio meglio per dare la caccia a qualsiasi problema.

source: By far, most of the problems encountered by porters are caused by <emphasis>packaging bugs</emphasis> in the source packages. Here is a checklist of things you should check or be aware of.
it: Di gran lunga, la maggior parte dei problemi incontrati dagli autori di port sono causati da <emphasis>bug di pacchettizzazione</emphasis> dei pacchetti sorgente. Ecco una lista di cose che dovreste controllare o di cui dovreste essere a conoscenza.

source: Make sure that your <literal>Build-Depends</literal> and <literal>Build-Depends-Indep</literal> settings in <filename>debian/control</filename> are set properly. The best way to validate this is to use the <systemitem role="package">debootstrap</systemitem> package to create an <literal>unstable</literal> chroot environment (see <xref linkend="debootstrap"/>). Within that chrooted environment, install the <systemitem role="package">build-essential</systemitem> package and any package dependencies mentioned in <literal>Build-Depends</literal> and/or <literal>Build-Depends-Indep</literal>. Finally, try building your package within that chrooted environment. These steps can be automated by the use of the <command>pbuilder</command> program which is provided by the package of the same name (see <xref linkend="pbuilder"/>).
it: Si verifichi che le impostazioni di <literal>Build-Depends</literal> e <literal>Build-Depends-Indip</literal> in <filename>debian/control</filename> siano impostate correttamente. Il modo migliore per verificarlo è usare il pacchetto <systemitem role="package">debootstrap</systemitem> per creare un ambiente chroot <literal>unstable</literal> (si consulti <xref linkend="debootstrap"/>). All'interno di tale ambiente chroot, si installi il pacchetto <systemitem role="package">build-essential</systemitem> e tutte le dipendenze dei pacchetti citate in <literal>Build-Depends</literal> o in<literal>Build-Depends-Indep</literal>. Infine, si provi a compilare il pacchetto all'interno di tale ambiente chroot. Queste operazioni possono essere automatizzate con l'uso del programma <command>pbuilder</command> che è fornito dal pacchetto omonimo (si consulti <xref linkend="pbuilder"/>).

source: If you can't set up a proper chroot, <command>dpkg-depcheck</command> may be of assistance (see <xref linkend="dpkg-depcheck"/>).
it: Se non è possibile impostare una corretta chroot, <command>dpkg-depcheck</command> può essere di aiuto (si consulti <xref linkend="dpkg-depcheck"/>).

source: See the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> for instructions on setting build dependencies.
it: Si consulti il <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> per le istruzioni su come impostare le dipendenze di compilazione.

source: Don't set architecture to a value other than <literal>all</literal> or <literal>any</literal> unless you really mean it. In too many cases, maintainers don't follow the instructions in the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>. Setting your architecture to only one architecture (such as <literal>i386</literal> or <literal>amd64</literal>) is usually incorrect.
it: Non si imposti l'architettura a un valore diverso da <literal>all</literal> o <literal>any</literal> a meno che non si voglia veramente farlo. In troppi casi, i maintainer non seguono le istruzioni del <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>. Impostare l'architettura ad una sola (come ad esempio <literal>i386</literal> o <literal>amd64</literal>) è di solito non corretto.

source: Make sure your source package is correct. Do <literal>dpkg-source -x <replaceable>package</replaceable>.dsc</literal> to make sure your source package unpacks properly. Then, in there, try building your package from scratch with <command>dpkg-buildpackage</command>.
it: Assicurarsi che il proprio pacchetto dei sorgenti sia corretto. Si invochi <literal>dpkg-source -x <replaceable>pacchetto</replaceable>.dsc</literal> per assicurarsi che il pacchetto dei sorgenti si spacchetti correttamente. Poi, lì dentro, si provi a compilare il pacchetto da zero con <command>dpkg-buildpackage</command>.

source: Make sure you don't ship your source package with the <filename>debian/files</filename> or <filename>debian/substvars</filename> files. They should be removed by the <literal>clean</literal> target of <filename>debian/rules</filename>.
it: Assicuratevi di non distribuire il pacchetto sorgente con il <filename>debian/files</filename> o <filename>debian/substvars</filename>. Essi devono essere rimossi dal target <literal>clean</literal> di <filename>debian/rules</filename>.

source: Make sure you don't rely on locally installed or hacked configurations or programs. For instance, you should never be calling programs in <filename>/usr/local/bin</filename> or the like. Try not to rely on programs being setup in a special way. Try building your package on another machine, even if it's the same architecture.
it: Assicuratevi di non basarvi su configurazioni o programmi installati localmente o modificati. Per esempio, non si dovrebbe mai invocare programmi presenti in <filename>/usr/local/bin</filename> o simili. Si cerchi di non fare affidamento su programmi configurati in modo particolare. Si provi a compilare il proprio pacchetto su un'altra macchina, anche se è la stessa architettura.

source: Don't depend on the package you're building being installed already (a sub-case of the above issue). There are, of course, exceptions to this rule, but be aware that any case like this needs manual bootstrapping and cannot be done by automated package builders.
it: Non dipendere dal fatto che il pacchetto che si sta compilando sia già installato (un sotto-caso del problema di cui sopra). Ci sono, naturalmente, eccezioni a questa regola, ma si sia consapevoli che qualsiasi caso come questo necessita di bootstrap manuale e dagli strumenti per compilazione automatica dei pacchetti.

source: Don't rely on the compiler being a certain version, if possible. If not, then make sure your build dependencies reflect the restrictions, although you are probably asking for trouble, since different architectures sometimes standardize on different compilers.
it: Non fate affidamento su una particolare versione del compilatore, se possibile. In caso contrario, assicurarsi che le dipendenze di compilazione rispecchino le restrizioni, anche se probabilmente si andrà incontro a guai, poiché diverse architetture a volte si standardizzano su compilatori diversi.

source: Make sure your <filename>debian/rules</filename> contains separate <literal>binary-arch</literal> and <literal>binary-indep</literal> targets, as the Debian Policy Manual requires. Make sure that both targets work independently, that is, that you can call the target without having called the other before. To test this, try to run <command>dpkg-buildpackage -B</command>.
it: Assicurarsi che il proprio <filename>debian/rules</filename> contenga target separati per <literal>binary-arch</literal> e <literal>binary-indep</literal>, come richiede il Debian Policy Manual. Assicurarsi che entrambi i target lavorino indipendentemente, cioè, che sia possibile chiamare il target senza aver prima chiamato l'altro. Per verificarlo, provate ad eseguire <command>dpkg-buildpackage -B</command>.

source: Guidelines for porter uploads
it: Linee guida per i caricamenti degli autori di port

source: If the package builds out of the box for the architecture to be ported to, you are in luck and your job is easy. This section applies to that case; it describes how to build and upload your binary package so that it is properly installed into the archive. If you do have to patch the package in order to get it to compile for the other architecture, you are actually doing a source NMU, so consult <xref linkend="nmu-guidelines"/> instead.
it: Se il pacchetto si compila senza modifiche per l'architettura per la quale si sta facendo il port, si è fortunati e il proprio compito è semplice. Questa sezione si applica a questo caso, descrive come compilare e caricare il pacchetto binario in modo che sia correttamente installato nell'archivio. Se c'è bisogno di creare una patch per il pacchetto in modo da farlo compilare per le altre architetture, si sta effettivamente facendo un NMU di un sorgente, dunque si consultino le <xref linkend="nmu-guidelines"/>.

source: For a porter upload, no changes are being made to the source. You do not need to touch any of the files in the source package. This includes <filename>debian/changelog</filename>.
it: Per un caricamento effettuato da un autore di port, nessuna modifica deve essere stata fatta al sorgente. Non è necesssario toccare alcun file nel pacchetto sorgente. Questo include <filename>debian/changelog</filename>.

source: The way to invoke <command>dpkg-buildpackage</command> is as <literal>dpkg-buildpackage -B -m<replaceable>porter-email</replaceable></literal>. Of course, set <replaceable>porter-email</replaceable> to your email address. This will do a binary-only build of only the architecture-dependent portions of the package, using the <literal>binary-arch</literal> target in <filename>debian/rules</filename>.
it: Il modo per richiamare <command> dpkg-buildpackage </command> è come <literal>dpkg-buildpackage -B -m<replaceable>porter-mail</replaceable></literal>. Naturalmente, si indichi in <replaceable>porter-mail</replaceable> la propria email. Questo farà una compilazione binaria delle sole parti del pacchetto dipendenti dall'architettura, utilizzando il target <literal>binary-arch</literal> in <filename>debian/rules</filename>.

source: If you are working on a Debian machine for your porting efforts and you need to sign your upload locally for its acceptance in the archive, you can run <command>debsign</command> on your <filename>.changes</filename> file to have it signed conveniently, or use the remote signing mode of <command>dpkg-sig</command>.
it: Se si sta lavorando su una macchina Debian per fare il port e si ha bisogno di firmare il proprio caricamento localmente per la sua accettazione nell'archivio, è possibile eseguire <command>debsign</command> sul proprio file <filename>.changes</filename> per averlo comodamente firmato, oppure si utilizzi la modalità di firma remota <command>dpkg-sig</command>.

source: Recompilation or binary-only NMU
it: Ricompilazione o NMU dei soli binari

source: Sometimes the initial porter upload is problematic because the environment in which the package was built was not good enough (outdated or obsolete library, bad compiler, etc.). Then you may just need to recompile it in an updated environment. However, you have to bump the version number in this case, so that the old bad package can be replaced in the Debian archive (<command>dak</command> refuses to install new packages if they don't have a version number greater than the currently available one).
it: A volte il primo caricamento di un autore di port è problematico perché l'ambiente in cui il pacchetto è stato compilato non era abbastanza buono (librerie datate o obsolete, un compilatore non buono, etc.). Allora si può solo aver necessità di ricompilarlo in un ambiente aggiornato. Tuttavia, è necessario incrementare il numero della versione, in questo caso, in modo che il vecchio non buono pacchetto possa essere sostituito nell'archivio Debian (<command>dak</command> si rifiuta di installare nuovi pacchetti, se non hanno un numero di versione maggiore di quella attualmente disponibile).

source: You have to make sure that your binary-only NMU doesn't render the package uninstallable. This could happen when a source package generates arch-dependent and arch-independent packages that have inter-dependencies generated using dpkg's substitution variable <literal>$(Source-Version)</literal>.
it: Si deve fare in modo che il proprio NMU di soli binari non renda il pacchetto non installabile. Questo potrebbe accadere quando un pacchetto sorgente genera pacchetti dipendenti e non dall'architettura che possiedono inter-dipendenze generate utilizzando la variabile di sostituzione di dpkg <literal>$(Source-Version)</literal>.

source: Despite the required modification of the changelog, these are called binary-only NMUs — there is no need in this case to trigger all other architectures to consider themselves out of date or requiring recompilation.
it: Nonostante la modifica necessaria del changelog, questi sono chiamati NMU di soli binari: non è necessario in questo caso far sì che tutte le altre architetture si considerino non aggiornate o con necessità di ricompilazione.

source: Such recompilations require special ``magic'' version numbering, so that the archive maintenance tools recognize that, even though there is a new Debian version, there is no corresponding source update. If you get this wrong, the archive maintainers will reject your upload (due to lack of corresponding source code).
it: Tali ricompilazioni richiedono un particolare numero di versione «magico», in modo che gli strumenti di manutenzione dell'archivio riconoscano che, anche se vi è una nuova versione di Debian, non vi è alcun aggiornamento di sorgenti corrispondente. Se si sbaglia, i manutentori dell'archivio respingeranno il proprio caricamento (per mancanza del corrispondente codice sorgente).

source: In the past, such NMUs used the third-level number on the Debian part of the revision to denote their recompilation-only status; however, this syntax was ambiguous with native packages and did not allow proper ordering of recompile-only NMUs, source NMUs, and security NMUs on the same package, and has therefore been abandoned in favor of this new syntax.
it: In passato, tali NMU utilizzarono il numero di terzo livello della parte della revisione di Debian per indicare solo la loro ricompilazione; tuttavia, questa sintassi era ambigua con i pacchetti nativi e non ha permesso una corretta ordinazione delle sole ricompilazioni NMU, NMU sorgente, e NMU di sicurezza sullo stesso package, ed è stata abbandonata in favore di questa nuova sintassi.

source: The ``magic'' for a recompilation-only NMU is triggered by using a suffix appended to the package version number, following the form <literal>b<replaceable>number</replaceable></literal>. For instance, if the latest version you are recompiling against was version <literal>2.9-3</literal>, your binary-only NMU should carry a version of <literal>2.9-3+b1</literal>. If the latest version was <literal>3.4+b1</literal> (i.e, a native package with a previous recompilation NMU), your binary-only NMU should have a version number of <literal>3.4+b2</literal>.<placeholder type="footnote" id="0"/>
it: Il «magico» per un NMU con sola ricompilazione viene attivato utilizzando un suffisso aggiunto al numero di versione del pacchetto, seguendo la forma <literal>b<replaceable>numero</replaceable></literal>. Per esempio, se l'ultima versione sulla quale si sta ricompilando era la versione <literal>2.9-3</literal>, l'NMU solo binario dovrebbe avere la versione <literal>2.9-3+b1</literal>. Se l'ultima versione era <literal>3.4+b1</literal> (cioè un pacchetto nativo con un precedente NMU con ricompilazione), il proprio NMU solo binario dovrebbe avere un numero di versione <literal>3.4+b2</literal>.<placeholder type="footnote" id="0"/>

source: Similar to initial porter uploads, the correct way of invoking <command>dpkg-buildpackage</command> is <literal>dpkg-buildpackage -B</literal> to only build the architecture-dependent parts of the package.
it: In modo simile ai caricamenti iniziali dell'autore del port, il modo corretto di invocare <command>dpkg-buildpackage</command> è <literal>dpkg-buildpackage -B</literal> per compilare solo le parti del pacchetto dipendenti dell'architettura.

source: When to do a source NMU if you are a porter
it: Quando fare un NMU del sorgente se si è un autore di port

source: Porters doing a source NMU generally follow the guidelines found in <xref linkend="nmu"/>, just like non-porters. However, it is expected that the wait cycle for a porter's source NMU is smaller than for a non-porter, since porters have to cope with a large quantity of packages. Again, the situation varies depending on the distribution they are uploading to. It also varies whether the architecture is a candidate for inclusion into the next stable release; the release managers decide and announce which architectures are candidates.
it: Gli autori di port generalmente nel fare un NMU del sorgente seguono le linee guida presenti in <xref linkend="nmu"/>, proprio come i non-porter. Tuttavia, ci si aspetta che il ciclo di attesa per un NMU del sorgente di un autore di port sia minore di quello per chi non è autore di port, poiché i gli autori di port devono gestire una grande quantità di pacchetti. Di nuovo, la situazione varia a seconda della distribuzione sulla quale si stanno effettuando i caricamenti. Essa varia anche se l'architettura è candidata ad essere inclusa nel prossimo rilascio stabile; i gestori dei rilasci decidono e annunciano quali architetture sono candidate.

source: If you are a porter doing an NMU for <literal>unstable</literal>, the above guidelines for porting should be followed, with two variations. Firstly, the acceptable waiting period — the time between when the bug is submitted to the BTS and when it is OK to do an NMU — is seven days for porters working on the <literal>unstable</literal> distribution. This period can be shortened if the problem is critical and imposes hardship on the porting effort, at the discretion of the porter group. (Remember, none of this is Policy, just mutually agreed upon guidelines.) For uploads to <literal>stable</literal> or <literal>testing</literal>, please coordinate with the appropriate release team first.
it: Se si è un autore di port che fa un NMU per <literal>unstable</literal>, le linee guida di cui sopra per la portabilità dovrebbero essere seguite, con due varianti. In primo luogo, il periodo di attesa accettabile, il tempo tra quando il bug è presentato al BTS e quando è considerato valido per fare un NMU, è di sette giorni per gli autori di port che lavorano sulla distribuzione <literal>unstable</literal>. Questo periodo può essere abbreviato se il problema è critico e crea difficoltà sul lavoro di creazione dei port, a discrezione del gruppo di lavoro sui port. (Ricordate, niente di tutto ciò è Policy, ma solo linee guida stabilite di comune accordo.) Per caricamenti su <literal>stable</literal> o su <literal>testing</literal>, coordinarsi prima con l'appropriato team di rilascio.

source: Secondly, porters doing source NMUs should make sure that the bug they submit to the BTS should be of severity <literal>serious</literal> or greater. This ensures that a single source package can be used to compile every supported Debian architecture by release time. It is very important that we have one version of the binary and source package for all architectures in order to comply with many licenses.
it: In secondo luogo, gli autori di port che fanno NMU di sorgenti dovrebbero assicurarsi che il bug presentato al BTS dovrebbe essere di gravità <literal>serious</literal> o superiore. Questo assicura che un singolo pacchetto sorgente possa essere usato per compilare ogni architettura supportata da Debian al momento del rilascio. È molto importante avere una versione del pacchetto binario e di quello del sorgente per tutte le architetture al fine di conformarsi con molte licenze.

source: Porters should try to avoid patches which simply kludge around bugs in the current version of the compile environment, kernel, or libc. Sometimes such kludges can't be helped. If you have to kludge around compiler bugs and the like, make sure you <literal>#ifdef</literal> your work properly; also, document your kludge so that people know to remove it once the external problems have been fixed.
it: Gli autori dei port dovrebbero cercare di evitare le patch che semplicemente aggirano i bug nella versione attuale dell'ambiente di compilazione, kernel, oppure libc. A volte tali stratagemmi non possono essere evitati. Se è necessario aggirare bug del compilatore e simili, assicurarsi di <literal>#ifdef</literal> il proprio lavoro correttamente; inoltre, documentare le modifiche fatte per aggirare i bug in modo che la gente sappia di rimuoverli una volta che i problemi esterni siano stati corretti.

source: Porters may also have an unofficial location where they can put the results of their work during the waiting period. This helps others running the port have the benefit of the porter's work, even during the waiting period. Of course, such locations have no official blessing or status, so buyer beware.
it: Gli autori di port possono anche avere un luogo non ufficiale dove possono mettere i risultati del loro lavoro durante il periodo di attesa. Questo aiuta gli altri che utilizzano il port ad avere il vantaggio del lavoro del suo autore, anche durante il periodo di attesa. Naturalmente, tali luoghi non hanno alcuna benedizione o status ufficiale, quindi stare attenti.

source: Porting infrastructure and automation
it: Infrastrutture e automazione per il port

source: There is infrastructure and several tools to help automate package porting. This section contains a brief overview of this automation and porting to these tools; see the package documentation or references for full information.
it: C'è un'infrastruttura e diversi strumenti per aiutare ad automatizzare il port dei pacchetti. Questa sezione contiene una breve panoramica di questi strumenti di automazione e di port; si consulti la documentazione dei pacchetti o i riferimenti per informazioni complete.

source: Mailing lists and web pages
it: Mailing list e pagine web

source: Web pages containing the status of each port can be found at <ulink url="&url-debian-ports;"></ulink>.
it: Le pagine Web che contengono lo stato di ogni porto sono disponibili all'indirizzo <ulink url="&url-debian-ports;"></ulink>.

source: Each port of Debian has a mailing list. The list of porting mailing lists can be found at <ulink url="&url-debian-port-lists;"></ulink>. These lists are used to coordinate porters, and to connect the users of a given port with the porters.
it: Ogni port di Debian ha una mailing list. L'elenco delle mailing list dedicate ai port può essere trovato su <ulink url="&url-debian-port-lists;"></ulink>. Questi elenchi vengono utilizzati per coordinare gli autori di port, e per collegare gli utenti di un dato port con gli autori.

source: Porter tools
it: Strumenti per gli autori di port

source: Descriptions of several porting tools can be found in <xref linkend="tools-porting"/>.
it: Le descrizioni di diversi strumenti per il port si possono trovare su <xref linkend="tools-porting"/>.
