Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: In your removal request, you have to detail the reasons justifying the request. This is to avoid unwanted removals and to keep a trace of why a package has been removed. For example, you can provide the name of the package that supersedes the one to be removed.
it: Nella vostra richiesta di rimozione, è necessario dettagliare le ragioni che giustificano la richiesta. Questo per evitare rimozioni indesiderate e per tenere traccia del perché un pacchetto è stato rimosso. Ad esempio, è possibile specificare il nome del pacchetto che sostituisce quello che deve essere rimosso.

source: Usually you only ask for the removal of a package maintained by yourself. If you want to remove another package, you have to get the approval of its maintainer. Should the package be orphaned and thus have no maintainer, you should first discuss the removal request on &email-debian-qa;. If there is a consensus that the package should be removed, you should reassign and retitle the <literal>O:</literal> bug filed against the <literal>wnpp</literal> package instead of filing a new bug as removal request.
it: Di solito si chiede solo per la rimozione di un pacchetto che si sta mentenendo. Se si desidera rimuovere un altro pacchetto, è necessario ottenere l'approvazione del suo maintainer. Se il pacchetto resta orfano e quindi non ha un maintainer, si deve prima discutere la richiesta di rimozione su &email-debian-qa;. Se c'è un consenso sul fatto che il pacchetto debba essere rimosso, è necessario riassegnare e rinominare la segnalazione del bug <literal>O:</literal> presentato sul pacchetto <literal>wnpp</literal> invece di presentare un nuovo bug come richiesta di rimozione.

source: Further information relating to these and other package removal related topics may be found at <ulink url="https://wiki.debian.org/ftpmaster_Removals"></ulink> and <ulink url="&url-debian-qa;howto-remove.html"></ulink>.
it: Ulteriori informazioni relative a questi ed altri argomenti correlati alla rimozione di un pacchetto possono essere trovate in <ulink url="http://wiki.debian.org/ftpmaster_Removals"></ulink> e <ulink url="&url-debian-qa;howto-remove.html"></ulink>.

source: If in doubt concerning whether a package is disposable, email &email-debian-devel; asking for opinions. Also of interest is the <command>apt-cache</command> program from the <systemitem role="package">apt</systemitem> package. When invoked as <literal>apt-cache showpkg <replaceable>package</replaceable></literal>, the program will show details for <replaceable>package</replaceable>, including reverse depends. Other useful programs include <command>apt-cache rdepends</command>, <command>apt-rdepends</command>, <command>build-rdeps</command> (in the <systemitem role="package">devscripts</systemitem> package) and <command>grep-dctrl</command>. Removal of orphaned packages is discussed on &email-debian-qa;.
it: In caso di dubbio concernente il fatto che un pacchetto sia usa e getta, si mandi una email a &email-debian-devel; chiedendo pareri. Interessante è anche il programma <command>apt-cache</command> dal pacchetto <systemitem role="package">apt</systemitem>. Quando invocato come <literal>apt-cache showpkg <replaceable>package</replaceable></literal>, il programma mostrerà i dettagli per <replaceable>package</replaceable>, incluse le dipendenze revocate. Altri programmi utili sono <command>apt-cache rdepends</command>, <command>apt-rdepends</command>, <command>build-rdeps</command> (nel pacchetto <systemitem role="package">devscripts</systemitem>) e <command>grep-dctrl</command>. La rimozione di pacchetti orfani è discussa su &email-debian-qa;.

source: Once the package has been removed, the package's bugs should be handled. They should either be reassigned to another package in the case where the actual code has evolved into another package (e.g. <literal>libfoo12</literal> was removed because <literal>libfoo13</literal> supersedes it) or closed if the software is simply no longer part of Debian. When closing the bugs, to avoid marking the bugs as fixed in versions of the packages in previous Debian releases, they should be marked as fixed in the version <literal>&lt;most-recent-version-ever-in-Debian&gt;+rm</literal>.
it: Una volta che il pacchetto è stato rimosso, i bug del pacchetto devono essere gestiti. Essi dovrebbero essere riassegnati ad un altro pacchetto nel caso in cui il codice vero e proprio si sia evoluto in un altro pacchetto (ad esempio <literal>libfoo12</literal> è stato rimosso perché <literal>libfoo13</literal> lo sostituisce) o chiuso, se il software semplicemente non fa più parte di Debian. Quando si chiude il bug, per evitare di segnare i bug corretti in versioni di pacchetti di rilasci precedenti di Debian, dovrebbero essere contrassegnati come corretti nella versione <literal>&lt;most-recent-version-ever-in-Debian&gt;+rm</literal>.

source: Removing packages from <filename>Incoming</filename>
it: Rimozione di pacchetti da <filename>Incoming</filename>

source: In the past, it was possible to remove packages from <filename>incoming</filename>. However, with the introduction of the new incoming system, this is no longer possible. Instead, you have to upload a new revision of your package with a higher version than the package you want to replace. Both versions will be installed in the archive but only the higher version will actually be available in <literal>unstable</literal> since the previous version will immediately be replaced by the higher. However, if you do proper testing of your packages, the need to replace a package should not occur too often anyway.
it: In passato, è stato possibile rimuovere i pacchetti da <filename>incoming</filename>. Tuttavia, con l'introduzione del nuovo sistema di gestione dei caricamenti, questo non è più possibile. Invece, è necessario caricare una nuova revisione del pacchetto con una versione superiore rispetto a quello che si desidera sostituire. Entrambe le versioni saranno installate in archivio, ma solo la versione più alta sarà effettivamente disponibile in <literal>unstable</literal> dal momento che la versione precedente verrà immediatamente sostituita dalla più alta. Tuttavia, se si fa una corretta analisi dei pacchetti, la necessità di sostituire un pacchetto non dovrebbe avvenire troppo spesso comunque.

source: Replacing or renaming packages
it: La sostituzione o la ridenominazione dei pacchetti

source: When the upstream maintainers for one of your packages chose to rename their software (or you made a mistake naming your package), you should follow a two-step process to rename it. In the first step, change the <filename>debian/control</filename> file to reflect the new name and to replace, provide and conflict with the obsolete package name (see the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> for details). Please note that you should only add a <literal>Provides</literal> relation if all packages depending on the obsolete package name continue to work after the renaming. Once you've uploaded the package and the package has moved into the archive, file a bug against <systemitem role="package">&ftp-debian-org;</systemitem> asking to remove the package with the obsolete name (see <xref linkend="removing-pkgs"/>). Do not forget to properly reassign the package's bugs at the same time.
it: Quando i maintainer originali a causa di uno dei propri pacchetti hanno scelto di rinominare il loro software (o si è commesso un errore nel nominare il proprio pacchetto), si dovrebbe seguire un processo in due fasi per rinominarlo. Nella prima fase, modificare il file <filename>debian/control</filename> affinché rifletta il nuovo nome e per sostituire, prevedete e risolvete eventuali conflitti con il nome del pacchetto obsoleto (si consulti <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> per i dettagli). Si tenga presente che si deve solo aggiungere una relazione <literal>Provides</literal> se tutti i pacchetti dipendenti dall'obsoleto nome del pacchetto continuano a funzionare dopo la ridenominazione. Una volta caricato il pacchetto e il pacchetto è spostato nell'archivio, si apra un bug nei confronti di <systemitem role="package">&ftp-debian-org;</systemitem> chiedendo di rimuovere il pacchetto con il nome obsoleto (si veda <xref linkend="removing-pkgs"/>). Non si dimentichi allo stesso tempo di riassegnare correttamente i bug del pacchetto.

source: At other times, you may make a mistake in constructing your package and wish to replace it. The only way to do this is to increase the version number and upload a new version. The old version will be expired in the usual manner. Note that this applies to each part of your package, including the sources: if you wish to replace the upstream source tarball of your package, you will need to upload it with a different version. An easy possibility is to replace <filename>foo_1.00.orig.tar.gz</filename> with <filename>foo_1.00+0.orig.tar.gz</filename> or <filename>foo_1.00.orig.tar.bz2</filename>. This restriction gives each file on the ftp site a unique name, which helps to ensure consistency across the mirror network.
it: Altre volte, si può fare un errore nella compilazione del proprio pacchetto e si vuole sostituirlo. L'unico modo per farlo è aumentare il numero di versione e caricarlo. La vecchia versione scadrà nel modo consueto. Si noti che questo vale per ogni parte del proprio pacchetto, compresi i sorgenti: se si desidera sostituire l'archivio dei sorgenti originali del proprio pacchetto, è necessario caricarlo con una versione diversa. Un modo semplice è quello di sostituire <filename> foo_1.00.orig.tar.gz </filename> con <filename>foo_1.00+0.orig.tar.gz</filename> o <filename>foo_1.00.orig.tar.bz2</filename>. Questa restrizione dà ad ogni file sul sito FTP un nome unico, che contribuisce a garantire la coerenza tra i mirror.

source: Orphaning a package
it: Pacchetto orfano

source: If you can no longer maintain a package, you need to inform others, and see that the package is marked as orphaned. You should set the package maintainer to <literal>Debian QA Group &orphan-address;</literal> and submit a bug report against the pseudo package <systemitem role="package">wnpp</systemitem>. The bug report should be titled <literal>O: <replaceable>package</replaceable> -- <replaceable>short description</replaceable></literal> indicating that the package is now orphaned. The severity of the bug should be set to <literal>normal</literal>; if the package has a priority of standard or higher, it should be set to important. If you feel it's necessary, send a copy to &email-debian-devel; by putting the address in the X-Debbugs-CC: header of the message (no, don't use CC:, because that way the message's subject won't indicate the bug number).
it: Se non è più possibile mantenere un pacchetto, è necessario informare gli altri, e controllare che il pacchetto sia contrassegnato come orfano. È necessario impostare il maintainer del pacchetto a <literal>Debian QA Group &orphan-address;</literal> e inviare una segnalazione di bug per lo pseudo pacchetto <systemitem role="package">wnpp</systemitem>. La segnalazione deve essere intitolata <literal>O: <replaceable>package</replaceable> --<replaceable>breve descrizione</replaceable> </literal> che indica che il pacchetto è ormai orfano. La gravità del bug dovrebbe essere impostata su <literal>normal</literal>, se il pacchetto ha una priorità di livello standard o superiore, deve essere impostato su important. Se si ritiene necessario, inviare una copia a &email-debian-devel;, mettendo l'indirizzo nell'intestazione X-Debbugs-CC: del messaggio (no, non usare CC:, perché in questo modo l'oggetto del messaggio non indicherà il numero di bug).

source: If you just intend to give the package away, but you can keep maintainership for the moment, then you should instead submit a bug against <systemitem role="package">wnpp</systemitem> and title it <literal>RFA: <replaceable>package</replaceable> -- <replaceable>short description</replaceable></literal>. <literal>RFA</literal> stands for <literal>Request For Adoption</literal>.
it: Se proprio si ha intenzione di abbandonare il pacchetto, ma è possibile mantenerlo temporaneamente, allora si dovrebbe invece presentare un bug su <systemitem role="package">wnpp</systemitem> ed inserire come titolo <literal>RFA: <replaceable>package</replaceable> -- <replaceable>breve descrizione</replaceable></literal>. <literal>RFA</literal> è l'acronimo di <literal>Request For Adoption</literal>.

source: More information is on the <ulink url="&url-wnpp;">WNPP web pages</ulink>.
it: Maggiori informazioni si possono trovare nelle <ulink url="&url-wnpp;">pagine web di WNPP</ulink>.

source: Adopting a package
it: L'adozione di un pacchetto

source: A list of packages in need of a new maintainer is available in the <ulink url="&url-wnpp;">Work-Needing and Prospective Packages list (WNPP)</ulink>. If you wish to take over maintenance of any of the packages listed in the WNPP, please take a look at the aforementioned page for information and procedures.
it: Un elenco di pacchetti che necessitano di un nuovo maintainer è disponibile nella <ulink url="&url-wnpp;">Work-Needing and Prospective Packages list(WNPP)</ulink>. Se si desidera prendere in consegna la manutenzione di uno qualsiasi dei pacchetti elencati nella WNPP, si prega di dare un'occhiata alla pagina di cui sopra per informazioni e procedure.

source: It is not OK to simply take over a package that you feel is neglected — that would be package hijacking. You can, of course, contact the current maintainer and ask them if you may take over the package. If you have reason to believe a maintainer has gone AWOL (absent without leave), see <xref linkend="mia-qa"/>.
it: Non è appropriato rilevare semplicemente un pacchetto che si immagina sia trascurato: ciò sarebbe un furto di un pacchetto. È possibile, ovviamente, contattare il maintainer attuale e chiedere se si può prendere in consegna il pacchetto. Se si ha motivo di credere che un maintainer abbia abbandonato il lavoro senza avvisare (AWOL), si consulti <xref linkend="mia-qa"/>.

source: Generally, you may not take over the package without the assent of the current maintainer. Even if they ignore you, that is still not grounds to take over a package. Complaints about maintainers should be brought up on the developers' mailing list. If the discussion doesn't end with a positive conclusion, and the issue is of a technical nature, consider bringing it to the attention of the technical committee (see the <ulink url="&url-tech-ctte;">technical committee web page</ulink> for more information).
it: In generale, non si può prendere in consegna il pacchetto senza il consenso dell'attuale maintainer. Anche se si è ignorati, ciò non è ancora un motivo sufficiente per adottare un pacchetto. Le segnalazioni riguardanti i maintainer devono essere fatte sulla mailing list degli sviluppatori. Se la discussione non termina con una conclusione positiva, e la questione è di natura tecnica, si consideri di portarla all'attenzione del comitato tecnico (si consulti per maggiori informazioni la <ulink url="&url-tech-ctte;">pagina web del comitato tecnico</ulink>).

source: If you take over an old package, you probably want to be listed as the package's official maintainer in the bug system. This will happen automatically once you upload a new version with an updated <literal>Maintainer</literal> field, although it can take a few hours after the upload is done. If you do not expect to upload a new version for a while, you can use <xref linkend="pkg-tracker"/> to get the bug reports. However, make sure that the old maintainer has no problem with the fact that they will continue to receive the bugs during that time.
it: Se si rileva un vecchio pacchetto, probabilmente si vuole essere elencati come maintainer ufficiale del pacchetto nel sistema di tracciamento dei bug. Questo avverrà automaticamente una volta che si carica una nuova versione con un campo <literal>Maintainer</literal> aggiornato, anche se può richiedere alcune ore dopo che il caricamento sia stato fatto. Se non si prevede di caricare una nuova versione per un po', è possibile utilizzare <xref linkend="pkg-tracker"/> per ottenere le segnalazioni di bug. Tuttavia, ci si assicuri che il vecchio maintainer non abbia alcun problema con il fatto che in quel periodo continuerà a ricevere le segnalazioni dei bug.

source: Reintroducing packages
it: Reintrodurre pacchetti

source: Packages are often removed due to release-critical bugs, absent maintainers, too few users or poor quality in general. While the process of reintroduction is similar to the initial packaging process, you can avoid some pitfalls by doing some historical research first.
it: I pacchetti sono spesso rimossi a causa di bug critici, manutentori assenti, troppo pochi utenti o di scarsa qualità in generale. Mentre il processo di reintroduzione è simile al processo di pacchettizzazione iniziale, è possibile evitare alcune insidie facendo prima qualche ricerca storica.

source: You should check why the package was removed in the first place. This information can be found in the removal item in the news section of the PTS page for the package or by browsing the log of <ulink url="https://&ftp-master-host;/#removed">removals</ulink>. The removal bug will tell you why the package was removed and will give some indication of what you will need to work on in order to reintroduce the package. It may indicate that the best way forward is to switch to some other piece of software instead of reintroducing the package.
it: Si dovrebbe verificare il motivo per cui il pacchetto è stato rimosso, in primo luogo. Queste informazioni si possono trovare nella voce rimozione nella sezione news della pagina PTS per il pacchetto o sfogliando il registro di<ulink url="https://&ftp-master-host;/#removed">rimossi</ulink>. Il bug rimozione vi dirà il motivo per cui il pacchetto è stato rimosso e darà qualche indicazione di ciò che è necessario correggere al fine di reintrodurre il pacchetto. Può indicare che il modo migliore di procedere è quello di passare a qualche altro pezzo di software, invece di reintrodurre il pacchetto.

source: It may be appropriate to contact the former maintainers to find out if they are working on reintroducing the package, interested in co-maintaining the package or interested in sponsoring the package if needed.
it: Può essere opportuno contattare gli ex manutentori per scoprire se si sta lavorando per reintrodurre il pacchetto, interessati a co-mantenimento del pacchetto o interessati a sponsorizzare il pacchetto, se necessario.

source: You should do all the things required before introducing new packages (<xref linkend="newpackage"/>).
it: Si dovrebbe fare tutto ciò di necessario prima di introdurre nuovi pacchetti (<xref linkend="newpackage"/>).

source: You should base your work on the latest packaging available that is suitable. That might be the latest version from <literal>unstable</literal>, which will still be present in the <ulink url="http://&snap-debian-org;/">snapshot archive</ulink>.
it: Si dovrebbe basare il proprio lavoro sull'ultimo pacchetto disponibile. Questo potrebbe essere l'ultima versione da <literal>unstable</literal>, che sarà ancora presente nella <ulink url="&snap-debian-org;">archivio snapshot</ulink>.

source: The version control system used by the previous maintainer might contain useful changes, so it might be a good idea to have a look there. Check if the <filename>control</filename> file of the previous package contained any headers linking to the version control system for the package and if it still exists.
it: Il sistema di controllo della versione utilizzata dal manutentore precedente potrebbe modifiche utili, quindi potrebbe essere una buona idea dare un'occhiata lì. Controllare se il file <filename>controllo</filename> del pacchetto precedente conteneva intestazioni di collegamento al sistema di controllo della versione per il pacchetto e se esiste ancora.

source: Package removals from <literal>unstable</literal> (not <literal>testing</literal>, <literal>stable</literal> or <literal>oldstable</literal>) trigger the closing of all bugs related to the package. You should look through all the closed bugs (including archived bugs) and unarchive and reopen any that were closed in a version ending in <literal>+rm</literal> and still apply. Any that no longer apply should be marked as fixed in the correct version if that is known.
it: La rimozione di pacchetti da <literal>unstable</literal> (not <literal>testing</literal>, <literal>stable</literal> or <literal>oldstable</literal>) fa scattare la chiusura di tutti i bug relativi al pacchetto . Si dovrebbe guardare attraverso tutti i bug chiusi (compresi bug archiviati) ed estrarre e riaprire qualunque sia stato chiuso in una versione che termina in <literal>+rm</literal> e applicare nuovamente. Qualunque che non si applichi deve essere contrassegnato come risolto nella versione corretta se si è a conoscenza.

source: Porting and being ported
it: Fare port e port del proprio lavoro

source: Debian supports an ever-increasing number of architectures. Even if you are not a porter, and you don't use any architecture but one, it is part of your duty as a maintainer to be aware of issues of portability. Therefore, even if you are not a porter, you should read most of this chapter.
it: Debian supporta un numero sempre crescente di architetture. Anche se non si è un autore di port, e si utilizza una sola architettura, è parte del dovere di un maintainer essere a conoscenza dei problemi di portabilità. Pertanto, anche se non si è un porter, si consiglia di leggere la maggior parte di questo capitolo.

source: Porting is the act of building Debian packages for architectures that are different from the original architecture of the package maintainer's binary package. It is a unique and essential activity. In fact, porters do most of the actual compiling of Debian packages. For instance, when a maintainer uploads a (portable) source packages with binaries for the <literal>i386</literal> architecture, it will be built for each of the other architectures, amounting to &number-of-arches; more builds.
it: Fare un port significa creare pacchetti Debian per architetture diverse dall'architettura originale del pacchetto binario del maintainer. È un'attività unica ed essenziale. In realtà, gli autori di port effettuano la maggior parte della compilazione dei pacchetti Debian. Per esempio, quando un maintainer carica un pacchetto di sorgenti (portabili) con i binari per l'architettura <literal>i386</literal>, sarà compilato per ciascuna delle altre architetture, pari ad altre &number-of-arches; compilazioni.

source: Being kind to porters
it: Siate gentili con gli autori di port

source: Porters have a difficult and unique task, since they are required to deal with a large volume of packages. Ideally, every source package should build right out of the box. Unfortunately, this is often not the case. This section contains a checklist of ``gotchas'' often committed by Debian maintainers — common problems which often stymie porters, and make their jobs unnecessarily difficult.
it: Gli autori di port hanno un compito difficile e unico, poiché sono necessari per affrontare una grande mole di pacchetti. Idealmente, ogni pacchetto sorgente dovrebbe potersi compilare così come è. Purtroppo, spesso questo non è vero. Questa sezione contiene un elenco di «cose da tenere d'occhio» spesso committitate dai maintainer Debian: problemi comuni che spesso ostacolano gli autori di port, e rendono il loro lavoro inutilmente difficile.
