Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: A big part of your job as Debian maintainer will be to stay in contact with the upstream developers. Debian users will sometimes report bugs that are not specific to Debian to our bug tracking system. You have to forward these bug reports to the upstream developers so that they can be fixed in a future upstream release.
it: Grande parte del proprio lavoro come maintainer Debian sarà quello di restare in contatto con gli sviluppatori originali. Gli utenti Debian a volte segnaleranno al nostro sistema di bug-tracking bug che non sono specifici di Debian. Dovrete inoltrare tali segnalazioni di bug agli sviluppatori originali in modo che possano essere corrette in una futura versione originale.

source: While it's not your job to fix non-Debian specific bugs, you may freely do so if you're able. When you make such fixes, be sure to pass them on to the upstream maintainers as well. Debian users and developers will sometimes submit patches to fix upstream bugs — you should evaluate and forward these patches upstream.
it: Anche se non è il proprio lavoro correggere i bug specifici non-Debian, si può liberamente farlo se ne si ha la possibilità. Quando si effettuano queste correzioni, ci si assicuri di trasmetterle anche ai maintainer originali. Utenti e sviluppatori Debian a volte invieranno patch che correggono bug dei sorgenti originali: si dovrebbe valutare e trasmettere queste patch allo sviluppatore originale.

source: If you need to modify the upstream sources in order to build a policy compliant package, then you should propose a nice fix to the upstream developers which can be included there, so that you won't have to modify the sources of the next upstream version. Whatever changes you need, always try not to fork from the upstream sources.
it: Se si necessita di modificare i sorgenti originali al fine di costruire un pacchetto conforme alla policy, allora si dovrebbe proporre una soluzione accurata agli sviluppatori originali che può essere li applicata, in modo da non dover modificare i sorgenti della prossima versione originale. Qualunque cambiamento necessiti, cerca sempre di non effettuare il fork dai sorgenti originali.

source: If you find that the upstream developers are or become hostile towards Debian or the free software community, you may want to re-consider the need to include the software in Debian. Sometimes the social cost to the Debian community is not worth the benefits the software may bring.
it: Se si scopre che gli sviluppatori originali sono o diventano ostili verso Debian o la comunità del software libero, si potrebbe riconsiderare la necessità di includere il software in Debian. A volte il costo sociale per la comunità Debian non vale i benefici che il software può portare.

source: Administrative Duties
it: Doveri amministrativi

source: A project of the size of Debian relies on some administrative infrastructure to keep track of everything. As a project member, you have some duties to ensure everything keeps running smoothly.
it: Un progetto delle dimensioni di Debian si basa su alcune infrastrutture amministrative per tenere traccia di tutto. Come membro del progetto, si hanno alcuni doveri che assicurano che il tutto continui a funzionare senza problemi.

source: Maintaining your Debian information
it: Gestire le vostre informazioni Debian

source: There's a LDAP database containing information about Debian developers at <ulink url="&url-debian-db;"></ulink>. You should enter your information there and update it as it changes. Most notably, make sure that the address where your debian.org email gets forwarded to is always up to date, as well as the address where you get your debian-private subscription if you choose to subscribe there.
it: C'è un database LDAP contenente le informazioni relative agli sviluppatori Debian su <ulink url="&url-debian-db;"></ulink>. Si dovrebbe immettere le informazioni li ed aggiornarle appena cambiano. Più in particolare, fare in modo che l'indirizzo al quale la propria email debian.org viene inoltrata sia sempre aggiornato, così come l'indirizzo in cui si hanno le proprie iscrizioni debian private se si sceglie di sottoscriverle.

source: For more information about the database, please see <xref linkend="devel-db"/>.
it: Per ulteriori informazioni sul database, si consulti <xref linkend="devel-db"/>.

source: Maintaining your public key
it: Mantenere la vostra chiave pubblica

source: Be very careful with your private keys. Do not place them on any public servers or multiuser machines, such as the Debian servers (see <xref linkend="server-machines"/>). Back your keys up; keep a copy offline. Read the documentation that comes with your software; read the <ulink url="&url-pgp-faq;">PGP FAQ</ulink>.
it: Si sia molto attenti con le vostre chiavi private. Non le si metta su qualsiasi server pubblico o macchine multiutente, come ad esempio il server Debian (si consulti <xref linkend="server-machines"/>). Eseguire copie delle chiavi; si conservi una copia offline. Leggere la documentazione fornita con il software; leggere la <ulink url="&url-pgp-faq;">PGP FAQ</ulink>.

source: You need to ensure not only that your key is secure against being stolen, but also that it is secure against being lost. Generate and make a copy (best also in paper form) of your revocation certificate; this is needed if your key is lost.
it: È necessario garantire non solo che la vostra chiave è sicura contro il furto, ma anche che è protetta in caso di smarrimento. Generare e fare una copia (meglio anche se in forma cartacea) del certificato di revoca; questo è necessario se la chiave viene persa.

source: If you add signatures to your public key, or add user identities, you can update the Debian key ring by sending your key to the key server at <literal>&keyserver-host;</literal>.
it: Se aggiungete firme alla vostra chiave pubblica, o aggiungete identità di utenti, è possibile aggiornare il portachiavi Debian inviando la vostra chiave al server delle chiavi all'indirizzo <literal>&keyserver-host;</literal>.

source: If you need to add a completely new key or remove an old key, you need to get the new key signed by another developer. If the old key is compromised or invalid, you also have to add the revocation certificate. If there is no real reason for a new key, the Keyring Maintainers might reject the new key. Details can be found at <ulink url="http://&keyserver-host;/replacing_keys.html"></ulink>.
it: Se è necessario aggiungere una nuova chiave o rimuovere una vecchia, è necessario che la nuova chiave sia firmata da un altro sviluppatore. Se la vecchia chiave è compromessa o non valida, si deve anche aggiungere il certificato di revoca. Se non vi è alcun motivo reale per una nuova chiave, i Keyring Maintainer potrebbero rifiutare la nuova chiave. Dettagli possono essere trovati presso <ulink url="http://&keyserver-host;/replacing_keys.html"></ulink>.

source: The same key extraction routines discussed in <xref linkend="registering"/> apply.
it: Si applichino le stesse routine di estrazione di chiavi discusse nel <xref linkend="registering"/>.

source: You can find a more in-depth discussion of Debian key maintenance in the documentation of the <systemitem role="package">debian-keyring</systemitem> package.
it: Si può trovare una più approfondita discussione sulla manutenzione delle chiavi Debian nella documentazione del pacchetto <systemitem role="package">debian-keyring</systemitem>.

source: Voting
it: Votare

source: Even though Debian isn't really a democracy, we use a democratic process to elect our leaders and to approve general resolutions. These procedures are defined by the <ulink url="&url-constitution;">Debian Constitution</ulink>.
it: Anche se Debian non è davvero una democrazia, usiamo un processo democratico per eleggere i nostri leader e ad approvare risoluzioni generali. Queste procedure sono definite dalla <ulink url="&url-constitution;">Costituzione Debian</ulink>.

source: Other than the yearly leader election, votes are not routinely held, and they are not undertaken lightly. Each proposal is first discussed on the &email-debian-vote; mailing list and it requires several endorsements before the project secretary starts the voting procedure.
it: Oltre all'annuale elezione del leader, le votazioni non sono tenute regolarmente e non sono intraprese con leggerezza. Ogni proposta è prima discussa sulla mailing list &email-debian-vote; e richiede diverse approvazioni prima che il segretario del progetto inizii la procedura di voto.

source: You don't have to track the pre-vote discussions, as the secretary will issue several calls for votes on &email-debian-devel-announce; (and all developers are expected to be subscribed to that list). Democracy doesn't work well if people don't take part in the vote, which is why we encourage all developers to vote. Voting is conducted via GPG-signed/encrypted email messages.
it: Non dovete monitorare le discussioni pre-voto, considerato che il segretario effettuerà diverse chiamate di votazione su &email-debian-devel-announce; (e tutti gli sviluppatori dovrebbero essere iscritti a questa lista). La democrazia non funziona bene se le persone non prendono parte al voto, è per questo che invitiamo tutti gli sviluppatori a votare. Le votazioni sono condotte attraverso messaggi email GPG-signed/encrypted.

source: The list of all proposals (past and current) is available on the <ulink url="&url-vote;">Debian Voting Information</ulink> page, along with information on how to make, second and vote on proposals.
it: L'elenco di tutte le proposte (passate e presenti) è disponibile sul <ulink url="&url-vote;">Debian Voting Information</ulink> pagina, insieme a informazioni su come fare, supportare e votare proposte.

source: Going on vacation gracefully
it: Andare in vacanza con garbo

source: It is common for developers to have periods of absence, whether those are planned vacations or simply being buried in other work. The important thing to notice is that other developers need to know that you're on vacation so that they can do whatever is needed if a problem occurs with your packages or other duties in the project.
it: È comune per gli sviluppatori avere periodi di assenza, se queste sono le vacanze programmate o semplicemente se sono sepolti in altri lavori. La cosa importante da notare è che gli altri sviluppatori hanno bisogno di sapere che si è in vacanza in modo che possano fare tutto ciò che è necessario in caso di problemi con i propri pacchetti o altri obblighi nel progetto.

source: Usually this means that other developers are allowed to NMU (see <xref linkend="nmu"/>) your package if a big problem (release critical bug, security update, etc.) occurs while you're on vacation. Sometimes it's nothing as critical as that, but it's still appropriate to let others know that you're unavailable.
it: Di solito questo significa che altri sviluppatori sono consentiti NMU (si consulti <xref linkend="nmu"/>) per il proprio pacchetto se un grosso problema (bug critico per la release, aggiornamento della sicurezza, etc.), si verifica mentre si è in vacanza. A volte non è niente di così critico come quelli, ma è ancora il caso di far sapere agli altri che non si è disponibili.

source: This is so that the message can be easily filtered by people who don't want to read vacation notices.
it: Questo è come il messaggio può essere facilmente filtrato da persone che non vogliono leggere avvisi di vacanza.

source: In order to inform the other developers, there are two things that you should do. First send a mail to <email>debian-private@&lists-host;</email> with [VAC] prepended to the subject of your message<placeholder type="footnote" id="0"/> and state the period of time when you will be on vacation. You can also give some special instructions on what to do if a problem occurs.
it: Al fine di informare gli altri sviluppatori, ci sono due cose che si dovrebbero fare. In primo luogo inviare una email a <email>@debian-private e liste-host;</email> con [VAC] anteposto all'argomento del messaggio <placeholder type="footnote" id="0"/> e indicare il periodo di tempo in cui si sarà in vacanza. Si possono anche dare alcune speciali istruzioni su cosa fare in caso di problemi.

source: The other thing to do is to mark yourself as on vacation in the <link linkend="devel-db">Debian developers' LDAP database</link> (this information is only accessible to Debian developers). Don't forget to remove the on vacation flag when you come back!
it: L'altra cosa da fare è quella di segnare se stessi come in vacanza nel <link linkend="devel-db">Debian developers' LDAP database</link> (questa informazione è accessibile solo agli sviluppatori Debian). Non dimenticare di togliere il flag vacanza quando si torna!

source: Ideally, you should sign up at the <ulink url="&url-gpg-coord;">GPG coordination pages</ulink> when booking a holiday and check if anyone there is looking for signing. This is especially important when people go to exotic places where we don't have any developers yet but where there are people who are interested in applying.
it: Idealmente, si dovrebbe firmare la <ulink url="&url-gpg-coord;">GPG coordination pages</ulink> al momento della prenotazione di una vacanza e verificare se qualcuno ci sta cercando per la firma. Questo è particolarmente importante quando la gente va in luoghi esotici dove non abbiamo ancora degli sviluppatori, ma dove ci sono persone che sono interessati a presentare domanda.

source: Retiring
it: Congedarsi

source: If you choose to leave the Debian project, you should make sure you do the following steps:
it: Se si sceglie di lasciare il progetto Debian, è necessario assicurarsi di eseguire le seguenti operazioni:

source: Orphan all your packages, as described in <xref linkend="orphaning"/>.
it: rendete orfani tutti i pacchetti, come descritto in <xref linkend="orphaning"/>.

source: Send an gpg-signed email announcing your retirement to <email>debian-private@&lists-host;</email>.
it: Inviare una email gpg-firmata sul perché si sta lasciando il progetto a

source: Notify the Debian key ring maintainers that you are leaving by opening a ticket in Debian RT by sending a mail to &email-keyring; with the words 'Debian RT' somewhere in the subject line (case doesn't matter).
it: Comunicare ai keyring maintainer Debian che si sta lasciando con l'apertura di un ticket in Debian RT e con l'invio di una email all'indirizzo &email-keyring; con le parole «Debian RT» da qualche parte nella riga dell'oggetto (le maiuscole e minuscole non importano).

source: If you received mails via a @debian.org e-mail alias (e.g. press@debian.org) and would like to get removed, open a RT ticket for the Debian System Administrators. Just send an e-mail to &email-rt-dsa; with "Debian RT" somewhere in the subject stating from which aliases you'd like to get removed.
it: Se si ricevono mail da un alias e-mail di @debian.org (e.g: press@debian.org) e si desidera essere rimosso, aprire una segnalazione RT per gli Amministratori dei Sistemi Debian. Si invii una e-mail a &email-rt-dsa; con la dicitura "Debian RT" da qualche parte nel soggetto indicando da quali alias si desidera esseere rimossi.

source: It is important that the above process is followed, because finding inactive developers and orphaning their packages takes significant time and effort.
it: È importante che il processo di cui sopra sia seguito, perché trovare sviluppatori inattivi e rendere orfani i loro pacchetti richiede molto tempo e lavoro.

source: Returning after retirement
it: Ritornare dopo il congedo

source: A retired developer's account is marked as "emeritus" when the process in <xref linkend="s3.7"/> is followed, and "disabled" otherwise. Retired developers with an "emeritus" account can get their account re-activated as follows:
it: l'account di uno sviluppatore congedato è contrassegnato come «emerito» quando il processo in <xref linkend="s3.7"/> è seguito e «disabled» in caso contrario. Gli sviluppatori ritirati con un account «emerito» possono ottenere il loro account riattivato come segue:

source: Contact &email-debian-account-manager;.
it: Si contatti &email-debian-account-manager;.

source: Go through a shortened NM process (to ensure that the returning developer still knows important parts of P&amp;P and T&amp;S).
it: Si passi attraverso un processo di NM accorciato (per garantire che il committente tornando sappia ancora parti importanti della P&amp;P and T&amp;S).

source: Prove that they still control the GPG key associated with the account, or provide proof of identify on a new GPG key, with at least two signatures from other developers.
it: Si dimostri che ancora si controlla la chiave GPG associata all'account, o si fornisca la prova di identificazione su una nuova chiave GPG, con almeno due firme da altri sviluppatori.

source: Retired developers with a "disabled" account need to go through NM again.
it: Gli sviluppatori congedati con un account «disabilitato» necessitano nuovamente di passare attraverso NM.

source: en
it: it

source: <author> <othername>Developer's Reference Team</othername> &email-devel-ref; </author> <author> <firstname>Andreas</firstname> <surname>Barth</surname> </author> <author> <firstname>Adam</firstname> <surname>Di Carlo</surname> </author> <author> <firstname>Raphaël</firstname> <surname>Hertzog</surname> </author> <author> <firstname>Lucas</firstname> <surname>Nussbaum</surname> </author> <author> <firstname>Christian</firstname> <surname>Schwarz</surname> </author> <author> <firstname>Ian</firstname> <surname>Jackson</surname> </author>
it: <author> <othername>Developer's Reference Team</othername> &email-devel-ref; </author> <author> <firstname>Andreas</firstname> <surname>Barth</surname> </author> <author> <firstname>Adam</firstname> <surname>Di Carlo</surname> </author> <author> <firstname>Raphaël</firstname> <surname>Hertzog</surname> </author> <author> <firstname>Lucas</firstname> <surname>Nussbaum</surname> </author> <author> <firstname>Christian</firstname> <surname>Schwarz</surname> </author> <author> <firstname>Ian</firstname> <surname>Jackson</surname> </author> <othercredit> <firstname>Pierangelo</firstname><surname>Mancusi</surname><contrib>Traduzione italiana</contrib><email>pierangelo.mancusi@gmail.com</email> </othercredit>

source: Internationalization and Translations
it: Internazionalizzazione e traduzioni

source: Debian supports an ever-increasing number of natural languages. Even if you are a native English speaker and do not speak any other language, it is part of your duty as a maintainer to be aware of issues of internationalization (abbreviated i18n because there are 18 letters between the 'i' and the 'n' in internationalization). Therefore, even if you are ok with English-only programs, you should read most of this chapter.
it: Debian supporta un numero sempre crescente di lingue naturali. Anche se si è un madrelingua inglese e non si parla un'altra lingua, è parte del proprio dovere come maintainer essere a conoscenza delle problematiche di internazionalizzazione (i18n abbreviato perché ci sono 18 lettere tra la 'i' e la 'n' in internazionalizzazione). Pertanto, anche se non si hanno problemi con programmi solo inglesi, vi consigliamo di leggere la maggior parte di questo capitolo.

source: According to <ulink url="&url-i18n-intro;">Introduction to i18n</ulink> from Tomohiro KUBOTA, I18N (internationalization) means modification of a software or related technologies so that a software can potentially handle multiple languages, customs, and so on in the world, while L10N (localization) means implementation of a specific language for an already internationalized software.
it: Secondo l'<ulink url="&url-i18n-intro;">Introduzione a i18n</ulink> di Tomohiro KUBOTA, per i18n (internazionalizzazione) si intende la modifica di un software o di tecnologie correlate in modo che sia potenzialmente in grado di gestire più lingue, costumi e così via in tutto il mondo, mentre L10N (localizzazione) si intende l'attuazione di una determinata lingua per un software già internazionalizzato.

source: l10n and i18n are interconnected, but the difficulties related to each of them are very different. It's not really difficult to allow a program to change the language in which texts are displayed based on user settings, but it is very time consuming to actually translate these messages. On the other hand, setting the character encoding is trivial, but adapting the code to use several character encodings is a really hard problem.
it: l10n e i18n sono interconnessi, ma le difficoltà relative a ciascuno di essi sono molto diverse. Non è davvero difficile consentire ad un programma di cambiare la lingua in cui vengono visualizzati i testi sulla base di impostazioni utente, ma in realtà è molto dispendioso tradurre questi messaggi. D'altro canto, impostare la codifica dei caratteri è banale, ma adattare il codice per utilizzare diverse codifiche di carattere è un problema veramente difficile.

source: Setting aside the i18n problems, where no general guideline can be given, there is actually no central infrastructure for l10n within Debian which could be compared to the buildd mechanism for porting. So most of the work has to be done manually.
it: Lasciando da parte i problemi i18n, dove non è possibile dare alcuna linea guida generale, non vi è in realtà alcuna infrastruttura centrale per l10n in Debian che potrebbe essere confrontata con il meccanismo buildd per il porting. Così la maggior parte del lavoro deve essere fatto manualmente.

source: How translations are handled within Debian
it: Come le traduzioni sono effettuate in Debian

source: Handling translation of the texts contained in a package is still a manual task, and the process depends on the kind of text you want to see translated.
it: La gestione della traduzione dei testi contenuti in un pacchetto è ancora un compito manuale e il processo dipende dal tipo di testo che si desidera vedere tradotto.

source: For program messages, the gettext infrastructure is used most of the time. Most of the time, the translation is handled upstream within projects like the <ulink url="&url-l10n-tp;">Free Translation Project</ulink>, the <ulink url="&url-l10n-gnome;">Gnome translation Project</ulink> or the <ulink url="&url-l10n-kde;">KDE one</ulink>. The only centralized resource within Debian is the <ulink url="&url-l10n;">Central Debian translation statistics</ulink>, where you can find some statistics about the translation files found in the actual packages, but no real infrastructure to ease the translation process.
it: Per messaggi di programma, l'infrastruttura gettext viene usata il più delle volte. La maggior parte del tempo, la traduzione viene gestita originariamente all'interno di progetti come il <ulink url="&url-l10n-tp;">Free Translation Project</ulink>, il <ulink url="&url-l10n-gnome;">Gnome translation Project</ulink> o <ulink url="&url-l10n-kde;">quello KDE</ulink>. L'unica risorsa centralizzata di Debian è il <ulink url="&url-l10n;">Central Debian translation statistics</ulink>, dove si possono trovare alcune statistiche riguardanti i file di traduzione presenti nei pacchetti attuali, ma nessuna infrastruttura reale per facilitare il processo di traduzione.
