Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: If choices are translatable strings, the 'Choices' field may be marked as translatable by using <literal>__Choices</literal>. The double underscore will split out each choice in a separate string.
it: Se le scelte sono stringhe traducibili, il campo «Choices» può essere contrassegnato come traducibile utilizzando <literal>__Choices</literal>. La doppia sottolineatura suddividerà ogni scelta in una stringa separata.

source: The <command>po-debconf</command> system also offers interesting possibilities to only mark <emphasis role="strong">some</emphasis> choices as translatable. Example:
it: Il sistema <command>po-debconf</command> offre anche interessanti possibilità di marcare solamente <emphasis role="strong">alcune</emphasis> scelte come traducibili. Esempio:

source: In that example, only the 'Other' string is translatable while others are acronyms that should not be translated. The above allows only 'Other' to be included in PO and POT files.
it: In questo esempio, solo la stringa «Other» è traducibile, mentre altri sono acronimi che non devono essere tradotti. Quanto sopra esposto consente solo ad «Other» di essere inserito nei file PO e POT.

source: The debconf templates flag system offers many such possibilities. The <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> manual page lists all these possibilities.
it: I modelli debconf con sistema a flag offrono molte di queste possibilità. La pagina del manuale di <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> elenca tutte queste possibilità.

source: Like the select data type, except the user can choose any number of items from the choices list (or chose none of them).
it: Come per la selezione del tipo di dato, ad eccezione di quando l'utente può scegliere un qualsiasi numero di elementi dall'elenco delle scelte (o scegliere nessuno di loro).

source: note
it: nota

source: Rather than being a question per se, this datatype indicates a note that can be displayed to the user. It should be used only for important notes that the user really should see, since debconf will go to great pains to make sure the user sees it; halting the install for them to press a key, and even mailing the note to them in some cases.
it: Piuttosto che essere una questione di per sé, questo tipo di dato indica una nota che può essere visualizzata all'utente. Dovrebbe essere usato solo per le note importanti che l'utente in realtà dovrebbe vedere, dato che debconf andrà incontro a grandi dolori per assicurarsi che l'utente la veda; arrestando l'installazione per consentire loro di premere un tasto persino inviandogli la nota tramite posta elettronica in alcuni casi.

source: text
it: testo

source: This type is now considered obsolete: don't use it.
it: Questo tipo è ora considerato obsoleto: non usarlo.

source: error
it: errore

source: This type is designed to handle error messages. It is mostly similar to the note type. Frontends may present it differently (for instance, the dialog frontend of cdebconf draws a red screen instead of the usual blue one).
it: Questo tipo è progettato per gestire i messaggi di errore. È molto simile al tipo di nota. Le interfacce possono presentarlo in modo diverso (per esempio, la finestra di cdebconf disegna uno schermo rosso invece del solito blu).

source: It is recommended to use this type for any message that needs user attention for a correction of any kind.
it: Si consiglia di utilizzare questo tipo per ogni messaggio che necessita dell'attenzione dell'utente per una correzione di qualsiasi tipo.

source: Description: short and extended description
it: Descrizione: descrizione breve ed estesa

source: Template descriptions have two parts: short and extended. The short description is in the Description: line of the template.
it: Le descrizioni dei modelli constano di due parti: breve ed estesa. La descrizione breve è nella linea «Description:» del modello.

source: The short description should be kept short (50 characters or so) so that it may be accommodated by most debconf interfaces. Keeping it short also helps translators, as usually translations tend to end up being longer than the original.
it: La descrizione breve dovrebbe essere mantenuta breve (50 caratteri o giù di lì) in modo che possa essere accolta dalla maggior parte delle interfacce di debconf. Mantenerla breve aiuta anche i traduttori, considerato che normalmente le traduzioni tendono a finire per essere più lunghe rispetto all'originale.

source: The short description should be able to stand on its own. Some interfaces do not show the long description by default, or only if the user explicitely asks for it or even do not show it at all. Avoid things like What do you want to do?
it: La descrizione breve dovrebbe essere in grado di stare in piedi da sola. Alcune interfacce non mostrano la descrizione lunga di default, oppure solo se l'utente esplicitamente la chiede o addirittura non la mostrano affatto. Evitare cose come «cosa vuoi fare?»

source: The short description does not necessarily have to be a full sentence. This is part of the keep it short and efficient recommendation.
it: La descrizione breve non deve necessariamente essere un periodo completo. Questo fa parte della raccomandazione di mantenerla breve ed efficiente.

source: The extended description should not repeat the short description word for word. If you can't think up a long description, then first, think some more. Post to debian-devel. Ask for help. Take a writing class! That extended description is important. If after all that you still can't come up with anything, leave it blank.
it: La descrizione estesa non deve ripetere la descrizione breve parola per parola. Se non è possibile pensare ad una descrizione lunga, quindi primo, si pensi un po' di più. Si condivida in debian-devel. Si chieda aiuto. Ci si iscriva ad un corso di scrittura! La descrizione estesa è importante. Se dopo tutto questo non è ancora possibile trovare qualcosa, la si lasci vuota.

source: The extended description should use complete sentences. Paragraphs should be kept short for improved readability. Do not mix two ideas in the same paragraph but rather use another paragraph.
it: La descrizione estesa dovrebbe usare periodi completi. I paragrafi devono essere brevi per migliorare la leggibilità. Non mescolare due idee nello stesso punto, piuttosto si usi un altro paragrafo.

source: Don't be too verbose. User tend to ignore too long screens. 20 lines are by experience a border you shouldn't cross, because that means that in the classical dialog interface, people will need to scroll, and lot of people just don't do that.
it: Non si sia troppo prolissi. Gli utenti tendono a ignorare schermate troppo lunghe. 20 righe sono per esperienza un limite che non si dovrebbe oltrepassare, perché ciò significa che nella finestra di interfaccia classica, le persone avranno bisogno di scorrere e molte persone semplicemente non lo fanno.

source: The extended description should <emphasis role="strong">never</emphasis> include a question.
it: La descrizione estesa non dovrebbe <emphasis role="strong">mai</emphasis> includere una domanda.

source: For specific rules depending on templates type (string, boolean, etc.), please read below.
it: Per specifiche regole inerenti il tipo di template (string, boolean, etc), leggere qui di seguito.

source: Choices
it: Scelte

source: This field should be used for select and multiselect types. It contains the possible choices which will be presented to users. These choices should be separated by commas.
it: Questo campo dovrebbe essere utilizzato per la selezione singola e multipla dei tipi. Esso contiene le scelte possibili che verranno presentate agli

source: This field is optional. It contains the default answer for string, select and multiselect templates. For multiselect templates, it may contain a comma-separated list of choices.
it: Questo campo è facoltativo. Esso contiene la risposta predefinita per i modelli di periodi, di selezione singola e multipla. Per i modelli di selezione multipla, può contenere un elenco di scelte separate da virgole.

source: Templates fields specific style guide
it: Guida a specifici stili di modelli di campi

source: No specific indication except: use the appropriate type by referring to the previous section.
it: Nessuna indicazione specifica eccetto: utilizzare il tipo appropriato, facendo riferimento alla sezione precedente.

source: Description field
it: Il campo Description

source: Below are specific instructions for properly writing the Description (short and extended) depending on the template type.
it: Qui di seguito sono istruzioni specifiche per scrivere correttamente la descrizione (breve e lunga) a seconda del tipo di modello.

source: String/password templates
it: Modelli di string/password

source: The short description is a prompt and <emphasis role="strong">not</emphasis> a title. Avoid question style prompts (IP Address?) in favour of opened prompts (IP address:). The use of colons is recommended.
it: La descrizione breve è un suggerimento e <emphasis role="strong">non</emphasis> un titolo. Evitare domande in stile suggerimento (indirizzo IP?) a favore di suggerimenti aperti (indirizzo IP:). Si consiglia l'uso dei due punti.

source: The extended description is a complement to the short description. In the extended part, explain what is being asked, rather than ask the same question again using longer words. Use complete sentences. Terse writing style is strongly discouraged.
it: La descrizione estesa è un complemento della descrizione breve. Nella parte estesa, si spieghi ciò che viene chiesto, piuttosto che riproporre la stessa domanda con parole più lunghe. Utilizzare frasi complete. Una scrittura concisa è fortemente sconsigliata.

source: Boolean templates
it: Modelli booleani

source: The short description should be phrased in the form of a question which should be kept short and should generally end with a question mark. Terse writing style is permitted and even encouraged if the question is rather long (remember that translations are often longer than original versions).
it: La descrizione breve dovrebbe essere formulata in forma di una domanda che dovrebbe essere mantenuta breve e dovrebbe generalmente terminare con un traduzioni sono spesso più lunghe rispetto alle versioni originali).

source: Again, please avoid referring to specific interface widgets. A common mistake for such templates is if you answer Yes-type constructions.
it: Anche in questo caso, evitare il riferimento a specifici widget delle interfacce. Un errore comune per tali modelli è se si risponde con costrutti di tipo Yes.

source: Select/Multiselect
it: Selezione/Multiselezione

source: The short description is a prompt and <emphasis role="strong">not</emphasis> a title. Do <emphasis role="strong">not</emphasis> use useless Please choose... constructions. Users are clever enough to figure out they have to choose something...:)
it: La descrizione breve è un suggerimento e <emphasis role="strong">non</emphasis> un titolo. <emphasis role="strong">Non</emphasis> utilizzare inutili costrutti del tipo «Gentilmente scegliete...». Gli utenti sono abbastanza intelligenti da capire che devono scegliere qualcosa... :)

source: The extended description will complete the short description. It may refer to the available choices. It may also mention that the user may choose more than one of the available choices, if the template is a multiselect one (although the interface often makes this clear).
it: La descrizione estesa completerà la descrizione breve. Può far riferimento alle scelte disponibili. Può anche indicare che l'utente può scegliere più di una tra le scelte disponibili, se il modello è di tipo selezione multipla (l'interfaccia spesso rende chiaro tutto ciò).

source: The short description should be considered to be a <emphasis role="strong">title</emphasis>.
it: La descrizione breve dovrebbe essere considerata un <emphasis role="strong">titolo</emphasis>.

source: The extended description is what will be displayed as a more detailed explanation of the note. Phrases, no terse writing style.
it: La descrizione estesa è ciò che sarà visualizzato come una spiegazione più dettagliata della nota. Frasi, non scrittura sintetica.

source: <emphasis role="strong">Do not abuse debconf.</emphasis> Notes are the most common way to abuse debconf. As written in debconf-devel manual page: it's best to use them only for warning about very serious problems. The <filename>NEWS.Debian</filename> or <filename>README.Debian</filename> files are the appropriate location for a lot of notes. If, by reading this, you consider converting your Note type templates to entries in <filename>NEWS.Debian</filename> or <filename>README.Debian</filename>, plus consider keeping existing translations for the future.
it: <emphasis role="strong">Non abusare di debconf.</emphasis> Le note sono il modo più comune per abusare di debconf. Come scritto nella pagina di manuale di debconf-devel: è meglio usarle solo come avvertimento di problemi molto seri. I files <filename>NEWS.Debian</filename> o <filename>README.Debian</filename> sono il luogo appropriato per molte note. Se, leggendo questo manuale, si sta valutando di convertire i propri modelli di tipo Nota in voci di <filename>NEWS.Debian</filename> o <filename>README.Debian</filename>, si consideri anche di mantenere le traduzioni esistenti per il futuro.

source: Choices field
it: Campo Choises

source: If the Choices are likely to change often, please consider using the __Choices trick. This will split each individual choice into a single string, which will considerably help translators for doing their work.
it: Se le «Choises» sono suscettibili di cambiare spesso, considerare l'uso del trucco «__ Choices». Questo dividerà ogni singola scelta in una singola stringa, che aiuterà notevolmente i traduttori nel compiere il loro lavoro.

source: Default field
it: Campo Default

source: If the default value, for a select template, is likely to vary depending on the user language (for instance, if the choice is a language choice), please use the _Default trick.
it: Se il valore di default, per un modello di selezione, può variare a seconda della lingua dell'utente (per esempio, se la scelta è una scelta della lingua), utilizzare il trucco «_Default».

source: This special field allow translators to put the most appropriate choice according to their own language. It will become the default choice when their language is used while your own mentioned Default Choice will be used when using English.
it: Questo campo speciale permette ai traduttori di mettere la scelta più appropriata in base alla loro propria lingua. Diventerà la scelta di default quando sarà usato il loro linguaggio mentre la vostra «Scelta di Default» verrà usata quando si utilizza l'inglese.

source: Example, taken from the geneweb package templates:
it: Esempio, tratto dai modelli del pacchetto geneweb:

source: Note the use of brackets which allow internal comments in debconf fields. Also note the use of comments which will show up in files the translators will work with.
it: Si noti l'uso dei «cancelletti» che consentano i commenti interni nei campi di debconf. Da notare anche l'uso di commenti che appariranno nel file sui quali i traduttori lavoreranno.

source: The comments are needed as the _Default trick is a bit confusing: the translators may put their own choice
it: I commenti sono necessari dal momento che il trucco _Default genera un po' di confusione: i traduttori potranno mettere la propria scelta

source: Do NOT use empty default field. If you don't want to use default values, do not use Default at all.
it: NON usare un campo predefinito vuoto. Se non si desidera utilizzare i valori di Default, non usarli.

source: If you use po-debconf (and you <emphasis role="strong">should</emphasis>, see <xref linkend="s6.5.2.2"/>), consider making this field translatable, if you think it may be translated.
it: Se si utilizza po-debconf (e si <emphasis role="strong">dovrebbe</emphasis>, si consulti <xref linkend="s6.5.2.2"/>), si consideri di marcare questo campo come traducibile, se si pensa che possa essere tradotto.

source: If the default value may vary depending on language/country (for instance the default value for a language choice), consider using the special _Default type documented in <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry>.
it: Se il valore predefinito può variare a seconda della lingua/paese (ad esempio, il valore predefinito per una scelta della lingua), è possibile utilizzare il tipo speciale _Default documentato in <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry>.

source: Internationalization
it: Internazionalizzazione

source: This section contains global information for developers to make translators' life easier. More information for translators and developers interested in internationalization are available in the <ulink url="&url-i18n-l10n;">Internationalisation and localisation in Debian</ulink> documentation.
it: Questa sezione contiene le informazioni a livello generale per gli sviluppatori al fine di rendere più facile la vita dei traduttori. Maggiori informazioni per i traduttori e gli sviluppatori interessati alla internazionalizzazione sono disponibili nella documentazione <ulink url="&url-i18n-l10n;">Internazionalizzazione e localizzazione in Debian</ulink>.

source: Handling debconf translations
it: Gestione delle traduzioni debconf

source: Like porters, translators have a difficult task. They work on many packages and must collaborate with many different maintainers. Moreover, most of the time, they are not native English speakers, so you may need to be particularly patient with them.
it: Come gli autori di port, i traduttori hanno un compito difficile. Lavorano su molti pacchetti e devono collaborare con molti maintainer diversi. Inoltre, la maggior parte delle volte, non sono di madrelingua inglese, quindi si potrebbe dover essere particolarmente pazienti con loro.

source: The goal of <systemitem role="package">debconf</systemitem> was to make packages configuration easier for maintainers and for users. Originally, translation of debconf templates was handled with <command>debconf-mergetemplate</command>. However, that technique is now deprecated; the best way to accomplish <systemitem role="package">debconf</systemitem> internationalization is by using the <systemitem role="package">po-debconf</systemitem> package. This method is easier both for maintainer and translators; transition scripts are provided.
it: L'obbiettivo di <systemitem role="package">debconf</systemitem> era quello di rendere più facile la configurazione di pacchetti per i maintainer e per gli utenti. In origine, la traduzione di modelli debconf è stata gestita con <command>debconf-mergetemplate</command>. Tuttavia, tale tecnica è ormai deprecata, il modo migliore per realizzare una internazionalizzazione <systemitem role="package">debconf</systemitem> è quello di utilizzare il pacchetto <systemitem role="package">po-debconf</systemitem>. Questo metodo è più facile sia per il maintainer e sia per i traduttori; sono forniti script di transizione.

source: Using <systemitem role="package">po-debconf</systemitem>, the translation is stored in <filename>.po</filename> files (drawing from <command>gettext</command> translation techniques). Special template files contain the original messages and mark which fields are translatable. When you change the value of a translatable field, by calling <command>debconf-updatepo</command>, the translation is marked as needing attention from the translators. Then, at build time, the <command>dh_installdebconf</command> program takes care of all the needed magic to add the template along with the up-to-date translations into the binary packages. Refer to the <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> manual page for details.
it: Utilizzando <systemitem role="package">po-debconf</systemitem>, la traduzione è memorizzata in file <filename>.po</filename> (prese dalle tecniche di traduzione <command>gettext</command>). Speciali file di modello contengono i messaggi originali e marcano quali campi sono traducibili. Quando si modifica il valore di un campo traducibile, chiamando <command>debconf-updatepo</command>, la traduzione è contrassegnata come bisognosa di attenzione da parte dei traduttori. Poi, in fase di compilazione, il programma <command>dh_installdebconf</command> si prende cura di tutta la magia necessaria per aggiungere il modello con le traduzioni aggiornate nei pacchetti binari. Fare riferimento alla pagina del manuale di <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> per i dettagli.

source: Internationalized documentation
it: Documentazione internazionalizzata

source: Internationalizing documentation is crucial for users, but a lot of labor. There's no way to eliminate all that work, but you can make things easier for translators.
it: Internazionalizzare la documentazione è fondamentale per gli utenti, ma richiede molto lavoro. Non c'è modo di eliminare tutto quel lavoro, ma si possono rendere le cose più facili per i traduttori.

source: If you maintain documentation of any size, it is easier for translators if they have access to a source control system. That lets translators see the differences between two versions of the documentation, so, for instance, they can see what needs to be retranslated. It is recommended that the translated documentation maintain a note about what source control revision the translation is based on. An interesting system is provided by <ulink url="&url-i18n-doc-check;">doc-check</ulink> in the <systemitem role="package">debian-installer</systemitem> package, which shows an overview of the translation status for any given language, using structured comments for the current revision of the file to be translated and, for a translated file, the revision of the original file the translation is based on. You might wish to adapt and provide that in your VCS area.
it: Se si mantiene una documentazione di qualsiasi dimensione, è più facile per i traduttori se hanno accesso ad un sistema di controllo del codice sorgente. Ciò consente ai traduttori di vedere le differenze tra due versioni della documentazione, così, per esempio, si può vedere ciò che deve essere ritradotto. Si raccomanda che la documentazione tradotta mantenga una nota circa la versione del codice sulla quale è basata. Un sistema interessante è fornito dal <ulink url="&url-i18n-doc-check;">doc-check</ulink> nel pacchetto <systemitem role="package">debian-installer</systemitem>, che mostra una panoramica dello stato di traduzione per ogni lingua, utilizzando i commenti strutturati per la revisione in corso del file da tradurre e, per un file tradotto, la revisione del file originale della traduzione sulla quale si basa. Si potrebbe desiderare di adattarla e di fornirla nel proprio VCS.

source: If you maintain XML or SGML documentation, we suggest that you isolate any language-independent information and define those as entities in a separate file which is included by all the different translations. This makes it much easier, for instance, to keep URLs up to date across multiple files.
it: Se si mantiene la documentazione XML o SGML, vi consigliamo di isolare qualsiasi informazione indipendente dal linguaggio e definirla come entità in un file separato che è incluso da tutte le diverse traduzioni. Ciò rende molto più facile, per esempio, mantenere gli URL aggiornati in più file.
