Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: The bug submitter may have forgotten to provide some information, in which case you have to ask them for the required information. You may use the <literal>moreinfo</literal> tag to mark the bug as such. Moreover if you can't reproduce the bug, you tag it <literal>unreproducible</literal>. Anyone who can reproduce the bug is then invited to provide more information on how to reproduce it. After a few months, if this information has not been sent by someone, the bug may be closed.
it: Il mittente del bug potrebbe aver dimenticato di fornire alcune informazioni, nel qual caso si deve chiedergli le informazioni necessarie. A tal proposito è possibile marcare il bug con il tag <literal>moreinfo</literal>. Inoltre se non è possibile riprodurre il bug, lo si etichetta come <literal>unreproducible</literal>. Chiunque può riprodurre il bug è allora invitato a fornire ulteriori informazioni su come riprodurlo. Dopo pochi mesi, se queste informazioni non sono state inviate da nessuno, il bug può essere chiuso.

source: If the bug is related to the packaging, you just fix it. If you are not able to fix it yourself, then tag the bug as <literal>help</literal>. You can also ask for help on &email-debian-devel; or &email-debian-qa;. If it's an upstream problem, you have to forward it to the upstream author. Forwarding a bug is not enough, you have to check at each release if the bug has been fixed or not. If it has, you just close it, otherwise you have to remind the author about it. If you have the required skills you can prepare a patch that fixes the bug and send it to the author at the same time. Make sure to send the patch to the BTS and to tag the bug as <literal>patch</literal>.
it: Se il bug è legato alla pacchettizzazione, basta risolvere il problema. Se non si è in grado di risolverlo da soli, allora si contrassegni il bug come <literal>help</literal>. Si può anche chiedere aiuto su &email-debian-devel; o &email-debian-qa;. Se è un problema che riguarda il software originale, è necessario inoltrarlo all'autore originale. L'inoltro di un bug non è sufficiente, è necessario controllare ad ogni rilascio se il bug è stato risolto o meno. Se lo è, basta chiuderlo, altrimenti si deve ricordarlo all'autore. Se si hanno le competenze necessarie si può preparare una patch che corregge il bug e inviarla all'autore allo stesso tempo. Assicurarsi di inviare la patch al BTS e di contrassegnare il bug come <literal>patch</literal>.

source: If you have fixed a bug in your local copy, or if a fix has been committed to the VCS repository, you may tag the bug as <literal>pending</literal> to let people know that the bug is corrected and that it will be closed with the next upload (add the <literal>closes:</literal> in the <filename>changelog</filename>). This is particularly useful if you are several developers working on the same package.
it: Se è stato sistemato un errore nella copia locale, o se una correzione è stata committata nel repository VCS, è possibile identificare il bug come <literal>pending</literal>, per far sapere che il bug è stato corretto e che sarà chiuso con il prossimo caricamento (si aggiunga <literal>closes:</literal> nel <filename>changelog</filename>). Questo è particolarmente utile se si è in diversi sviluppatori che lavorano sullo stesso pacchetto.

source: Once a corrected package is available in the archive, the bug should be closed indicating the version in which it was fixed. This can be done automatically, read <xref linkend="upload-bugfix"/>.
it: Una volta che un pacchetto corretto è disponibile in archivio, il bug dovrebbe essere chiuso indicando la versione in cui è stato corretto. Questo può essere fatto automaticamente, si consulti <xref linkend="upload-bugfix"/>.

source: When bugs are closed by new uploads
it: Quando i bug vengono chiusi da nuovi upload

source: As bugs and problems are fixed in your packages, it is your responsibility as the package maintainer to close these bugs. However, you should not close a bug until the package which fixes the bug has been accepted into the Debian archive. Therefore, once you get notification that your updated package has been installed into the archive, you can and should close the bug in the BTS. Also, the bug should be closed with the correct version.
it: Cosi come bug e problemi sono corretti nei propri pacchetti, è responsabilità del maintainer del pacchetto chiudere questi bug. Tuttavia, non è necessario chiudere un bug fino a quando il pacchetto che corregge il bug è stato accettato nell'archivio Debian. Pertanto, una volta che si ottiene la notifica che il proprio pacchetto aggiornato è stato installato nell'archivio, si può e si deve chiudere il bug nel BTS. Inoltre, il bug dovrebbe essere chiuso con la versione corretta.

source: However, it's possible to avoid having to manually close bugs after the upload — just list the fixed bugs in your <filename>debian/changelog</filename> file, following a certain syntax, and the archive maintenance software will close the bugs for you. For example:
it: Tuttavia, è possibile evitare di dover chiudere manualmente i bug dopo il caricamento - basta elencare i bug corretti nel proprio file <filename>debian/changelog</filename>, seguendo una certa sintassi, e il software di manutenzione chiuderà il bug. Per esempio:

source: Technically speaking, the following Perl regular expression describes how bug closing changelogs are identified:
it: Tecnicamente parlando, la seguente espressione regolare Perl descrive come i changelog che chiudono dei bug sono identificati:

source: We prefer the <literal>closes: #<replaceable>XXX</replaceable></literal> syntax, as it is the most concise entry and the easiest to integrate with the text of the <filename>changelog</filename>. Unless specified different by the <literal>-v</literal>-switch to <command>dpkg-buildpackage</command>, only the bugs closed in the most recent changelog entry are closed (basically, exactly the bugs mentioned in the changelog-part in the <filename>.changes</filename> file are closed).
it: Noi preferiamo la sintassi <literal>closes: #<replaceable>XXX</replaceable></literal>, in quanto è la voce più concisa e più facile da integrare con il testo del <filename>changelog</filename>. Se non diversamente specificato dal parametro <literal>-v</literal>- di<command>dpkg-buildpackage</command>, solo i bug risolti nella più recente voce del changelog vengono chiusi (in pratica, esattamente i bug menzionati nella parte del changelog nel file <filename>.changes</filename> vengono chiusi).

source: Historically, uploads identified as <link linkend="nmu">non-maintainer upload (NMU)</link> were tagged <literal>fixed</literal> instead of being closed, but that practice was ceased with the advent of version-tracking. The same applied to the tag <literal>fixed-in-experimental</literal>.
it: Storicamente, i caricamenti individuati come <link linkend="nmu">non-maintainer upload (NMU)</link> sono stati contrassegnati come <literal>fixed</literal> invece di essere chiusi, ma questa pratica è stata cessata con l'avvento del versionamento. Lo stesso vale per il tag <literal>fixed-in-experimental</literal>.

source: If you happen to mistype a bug number or forget a bug in the changelog entries, don't hesitate to undo any damage the error caused. To reopen wrongly closed bugs, send a <literal>reopen <replaceable>XXX</replaceable></literal> command to the bug tracking system's control address, &email-bts-control;. To close any remaining bugs that were fixed by your upload, email the <filename>.changes</filename> file to <email><replaceable>XXX</replaceable>-done@&bugs-host;</email>, where <replaceable>XXX</replaceable> is the bug number, and put Version: <replaceable>YYY</replaceable> and an empty line as the first two lines of the body of the email, where <replaceable>YYY</replaceable> is the first version where the bug has been fixed.
it: Se capita di sbagliare un numero di bug o dimenticare un bug nel changelog, non esitare ad annullare qualsiasi danno causato dall'errore. Per riaprire bug erroneamente chiusi, inviare un comando <literal>reopen <replaceable>XXX</replaceable></literal> all'indirizzo del sistema di controllo dei bug, &email-bts-control;. Per chiudere ogni restante bug che è stato corretto dal proprio caricamento, inviare il file <filename>.changes</filename> per email a <email><replaceable>XXX</replaceable>-done@&bugs-host;</email>, dove <replaceable>XXX</replaceable> è il numero di bug, e mettere Version: <replaceable>YYY</replaceable> e una riga vuota come prime due righe del corpo della email, dove <replaceable>YYY </replaceable> è la prima versione nella quale è stato corretto il bug.

source: Bear in mind that it is not obligatory to close bugs using the changelog as described above. If you simply want to close bugs that don't have anything to do with an upload you made, do it by emailing an explanation to <email><replaceable>XXX</replaceable>-done@&bugs-host;</email>. Do <emphasis role="strong">not</emphasis> close bugs in the changelog entry of a version if the changes in that version of the package don't have any bearing on the bug.
it: Tenete a mente che non è obbligatorio chiudere i bug utilizzando il changelog come descritto sopra. Se si vuole semplicemente chiudere bug che non hanno nulla a che vedere con un caricamento che si è fatto, lo si faccia inviando tramite email una spiegazione a <email><replaceable>XXX</replaceable>-done@&bugs-host;</email>. <emphasis role="strong">Non</emphasis> chiudete bug nella voce del changelog di una versione se le modifiche in quella versione del pacchetto non hanno alcuna attinenza con il bug.

source: For general information on how to write your changelog entries, see <xref linkend="bpp-debian-changelog"/>.
it: Per informazioni generali su come scrivere i propri contenuti di changelog, si consulti <xref linkend="bpp-debian-changelog"/>.

source: Handling security-related bugs
it: Gestione di bug relativi alla sicurezza

source: Due to their sensitive nature, security-related bugs must be handled carefully. The Debian Security Team exists to coordinate this activity, keeping track of outstanding security problems, helping maintainers with security problems or fixing them themselves, sending security advisories, and maintaining <literal>security.debian.org</literal>.
it: A causa della loro natura sensibile, i bug relativi alla sicurezza devono essere maneggiati con cura. Esiste Debian Security Team per coordinare questa attività, tenendo traccia dei problemi di sicurezza in sospeso, aiutando i maintainer con problemi di sicurezza o sistemandoli loro stessi, inviando avvisi di sicurezza, e mantenendo <literal>security.debian.org</literal>.

source: When you become aware of a security-related bug in a Debian package, whether or not you are the maintainer, collect pertinent information about the problem, and promptly contact the security team by emailing &email-security-team;. If desired, email can be encrypted with the Debian Security Contact key, see <ulink url="https://www.debian.org/security/faq#contact"/> for details. <emphasis role="strong">DO NOT UPLOAD</emphasis> any packages for <literal>stable</literal> without contacting the team. Useful information includes, for example:
it: Quando si viene a conoscenza di un bug relativo alla sicurezza in un pacchetto Debian, anche se non si è il maintainer, si raccolga informazioni pertinenti in merito al problema, e si contatti immediatamente il team di sicurezza, preferibilmente presentando il ticket nella propria Request Tracker. Si consulti <ulink url="http://wiki.debian.org/rt.debian.org#Security_Team"> </ulink>. In alternativa si può mandare una email &email-security-team;. <emphasis role="strong">NON FARE L'UPLOAD</emphasis> di pacchetti per <literal>stable</literal> senza contattare il team. Le informazioni utili comprendono, per esempio:

source: Whether or not the bug is already public.
it: Se il bug è già di dominio pubblico.

source: Which versions of the package are known to be affected by the bug. Check each version that is present in a supported Debian release, as well as <literal>testing</literal> and <literal>unstable</literal>.
it: Quali versioni del pacchetto sono note per essere interessate dal bug. Si controlli ogni versione che è presente in un rilascio supportato di Debian, così come <literal>testing</literal> e <literal>unstable</literal>.

source: The nature of the fix, if any is available (patches are especially helpful)
it: La natura della correzione, se qualcuna è disponibile (patch sono particolarmente utili)

source: Any fixed packages that you have prepared yourself (send only the <filename>.diff.gz</filename> and <filename>.dsc</filename> files and read <xref linkend="bug-security-building"/> first)
it: Eventuali pacchetti sistemati che si sono preparati (si inviino solo i file <filename>.diff.gz</filename> and <filename>.dsc</filename> e si legga prima <xref linkend="bug-security-building"/>)

source: Any assistance you can provide to help with testing (exploits, regression testing, etc.)
it: Qualsiasi tipo di assistenza si è in grado di fornire per aiutare con i test (exploit, test di regressione, etc.)

source: Any information needed for the advisory (see <xref linkend="bug-security-advisories"/>)
it: Tutte le informazioni necessarie per la consulenza (si consulti <xref linkend="bug-security-advisories"/>)

source: As the maintainer of the package, you have the responsibility to maintain it, even in the stable release. You are in the best position to evaluate patches and test updated packages, so please see the sections below on how to prepare packages for the Security Team to handle.
it: Come maintainer del pacchetto, si ha la responsabilità di mantenerlo, anche nella versione stabile. Si è nella posizione migliore per valutare le patch e testare i pacchetti aggiornati, quindi consultare le sezioni di seguito su come preparare i pacchetti per il Security Team.

source: The security team maintains a central database, the <ulink url="https://security-tracker.debian.org/">Debian Security Tracker</ulink>. This contains all public information that is known about security issues: which packages and versions are affected or fixed, and thus whether stable, testing and/or unstable are vulnerable. Information that is still confidential is not added to the tracker.
it: Il team di sicurezza mantiene una banca dati centrale, il <ulink url="http://security-tracker.debian.org/">Debian Security Tracker</ulink>. Questa contiene tutte le informazioni pubbliche che sono note sui problemi di sicurezza: quali pacchetti e versioni sono interessate o corrette, e quindi se stable, testing e/o unstable sono vulnerabili. Informazioni che sono ancora confidenziali non vengono aggiunte al tracker.

source: You can search it for a specific issue, but also on package name. Look for your package to see which issues are still open. If you can, please provide more information about those issues, or help to address them in your package. Instructions are on the tracker web pages.
it: È possibile cercare per un problema specifico, ma anche sul nome del pacchetto. Cercare il proprio pacchetto per vedere quali problemi sono ancora aperti. Se è possibile, fornire ulteriori informazioni su questi problemi, o di aiutare ad indirizzarli nel proprio pacchetto. Le istruzioni si trovano sulle pagine web del tracker.

source: Confidentiality
it: Riservatezza

source: Unlike most other activities within Debian, information about security issues must sometimes be kept private for a time. This allows software distributors to coordinate their disclosure in order to minimize their users' exposure. Whether this is the case depends on the nature of the problem and corresponding fix, and whether it is already a matter of public knowledge.
it: A differenza di molte altre attività all'interno di Debian, le informazioni su problemi di sicurezza devono talvolta essere mantenute private per un certo tempo. Questo consente ai distributori di software di coordinare la loro divulgazione al fine di ridurre al minimo l'esposizione dei loro utenti. Se questo è il caso dipende dalla natura del problema e dalla correzione corrispondente, e se è già di dominio pubblico.

source: There are several ways developers can learn of a security problem:
it: Ci sono diversi modi con cui gli sviluppatori possono venire a conoscenza di problemi di sicurezza:

source: they notice it on a public forum (mailing list, web site, etc.)
it: è stato notato su un forum pubblico (mailing list, sito web, etc.)

source: someone files a bug report
it: qualcuno deposita una segnalazione di bug

source: someone informs them via private email
it: qualcuno li informa via email privata

source: In the first two cases, the information is public and it is important to have a fix as soon as possible. In the last case, however, it might not be public information. In that case there are a few possible options for dealing with the problem:
it: Nei primi due casi, l'informazione è pubblica ed è importante avere una correzione il più presto possibile. Nell'ultimo caso, tuttavia, potrebbe non essere una informazione pubblica. In questo caso ci sono alcune possibili opzioni per affrontare il problema:

source: If the security exposure is minor, there is sometimes no need to keep the problem a secret and a fix should be made and released.
it: Se l'esposizione di sicurezza è minore, talvolta non è necessario mantenere il problema un segreto e una correzione devrebbe essere fatta e rilasciata.

source: If the problem is severe, it is preferable to share the information with other vendors and coordinate a release. The security team keeps in contact with the various organizations and individuals and can take care of that.
it: Se il problema è grave, è preferibile condividere le informazioni con altri fornitori e coordinare un rilascio. Il team di sicurezza si mantiene in contatto con le varie organizzazioni e gli individui e può prendersi cura di questo.

source: In all cases if the person who reports the problem asks that it not be disclosed, such requests should be honored, with the obvious exception of informing the security team in order that a fix may be produced for a stable release of Debian. When sending confidential information to the security team, be sure to mention this fact.
it: In tutti i casi, se la persona che segnala il problema chiede di non divulgarlo, tali richieste devono essere onorate, con l'ovvia eccezione di informare il team di sicurezza in modo che una soluzione possa essere prodotta per un rilascio stabile di Debian. Quando si inviano informazioni riservate al team di sicurezza, ci si assicuri di indicare questo fatto.

source: Please note that if secrecy is needed you may not upload a fix to <literal>unstable</literal> (or anywhere else, such as a public VCS repository). It is not sufficient to obfuscate the details of the change, as the code itself is public, and can (and will) be examined by the general public.
it: Si tenga presente che se è necessaria la segretezza non si può caricare una correzione in <literal>unstable</literal> (o in qualsiasi altro luogo, come un repository pubblico VCS). Non è sufficiente offuscare i dettagli della modifica, dato che il codice stesso è pubblico, e può (e sarà) esaminato dal pubblico in generale.

source: There are two reasons for releasing information even though secrecy is requested: the problem has been known for a while, or the problem or exploit has become public.
it: Ci sono due motivi per il rilascio di informazioni anche se è richiesto il segreto: il problema è conosciuto da un po', o il problema o l'exploit è diventato pubblico.

source: The Security Team has a PGP-key to enable encrypted communication about sensitive issues. See the <ulink url="https://www.debian.org/security/faq#contact">Security Team FAQ</ulink> for details.
it: Il team di sicurezza ha un PGP-key per abilitare la comunicazione crittografata su questioni delicate. Si consulti la <ulink url="http://www.debian.org/security/faq#contact">Security Team FAQ</ulink> per i dettagli.

source: Security Advisories
it: Avvisi di sicurezza

source: Security advisories are only issued for the current, released stable distribution, and <emphasis>not</emphasis> for <literal>testing</literal> or <literal>unstable</literal>. When released, advisories are sent to the &email-debian-security-announce; mailing list and posted on <ulink url="&url-debian-security-advisories;">the security web page</ulink>. Security advisories are written and posted by the security team. However they certainly do not mind if a maintainer can supply some of the information for them, or write part of the text. Information that should be in an advisory includes:
it: Gli avvisi di sicurezza vengono rilasciati solo per la corrente, rilasciata distribuzione stabile, e <emphasis>non</emphasis> per <literal>testing</literal> o <literal>unstable</literal>. Quando viene rilasciata, gli avvisi vengono inviati alla mailing list &email-debian-security-announce; e pubblicate sulla <ulink url="&url-debian-security-advisories;">pagina web di sicurezza</ulink>. Gli avvisi di sicurezza sono scritti e pubblicati dal team di sicurezza. Ma di certo non ci restano male se un maintainer è in grado di fornirgli alcune delle informazioni, o scrivere una parte del testo. Le informazioni che devono essere presenti in un avviso comprendono:

source: A description of the problem and its scope, including:
it: Una descrizione del problema e il suo campo di applicazione, tra cui:

source: The type of problem (privilege escalation, denial of service, etc.)
it: Il tipo di problema (l'escalation dei privilegi, denial of service, etc.)

source: What privileges may be gained, and by whom (if any)
it: Quali privilegi possono essere acquisiti, e da chi (se alcuni)

source: How it can be exploited
it: Come può essere sfruttata

source: Whether it is remotely or locally exploitable
it: Se è sfruttabile da remoto o in locale

source: How the problem was fixed
it: Come è stato risolto il problema

source: This information allows users to assess the threat to their systems.
it: Queste informazioni consentono agli utenti di valutare la minaccia per i loro sistemi.

source: Version numbers of affected packages
it: Numeri di versione dei pacchetti coinvolti

source: Version numbers of fixed packages
it: Numeri di versione dei pacchetti corretti

source: Information on where to obtain the updated packages (usually from the Debian security archive)
it: Informazioni su dove ottenere i pacchetti aggiornati (di solito dall'archivio di sicurezza di Debian)

source: References to upstream advisories, <ulink url="https://cve.mitre.org">CVE</ulink> identifiers, and any other information useful in cross-referencing the vulnerability
it: I riferimenti agli avvisi originali, identificatori <ulink url="http://cve.mitre.org">CVE</ulink>, e ogni altra informazione utile nel documentare la vulnerabilità

source: Preparing packages to address security issues
it: Preparazione di pacchetti per indirizzare i problemi di sicurezza

source: One way that you can assist the security team in their duties is to provide them with fixed packages suitable for a security advisory for the stable Debian release.
it: Un modo con cui si può aiutare il team di sicurezza nei suoi compiti è quello di fornirgli pacchetti corretti adatti per un avviso di sicurezza per il rilascio stabile di Debian.
