Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: The <systemitem role="package">wanna-build</systemitem> system is used as a distributed, client-server build distribution system. It is usually used in conjunction with build daemons running the <systemitem role="package">buildd</systemitem> program. <literal>Build daemons</literal> are ``slave'' hosts which contact the central <systemitem role="package">wanna-build</systemitem> system to receive a list of packages that need to be built.
it: Il sistema <systemitem role="package">wanna-build</systemitem> viene utilizzato come sistema client-server distribuito per la distribuzione di compilazioni. Di solito è usato in combinazione con demoni per la compilazione che eseguono il programma <systemitem role="package">buildd</systemitem>. <literal>I demoni per la compilazione</literal> sono host «slave» che contattano il sistema centrale <systemitem role="package">wanna-build</systemitem> per ricevere una lista di pacchetti che hanno bisogno di essere compilati.

source: <systemitem role="package">wanna-build</systemitem> is not yet available as a package; however, all Debian porting efforts are using it for automated package building. The tool used to do the actual package builds, <systemitem role="package">sbuild</systemitem> is available as a package, see its description in <xref linkend="sbuild"/>. Please note that the packaged version is not the same as the one used on build daemons, but it is close enough to reproduce problems.
it: <systemitem role="package">wanna-build</systemitem> non è ancora disponibile come pacchetto; tuttavia, tutti gli sforzi per creare port di Debian lo utilizzano per la compilazione automatizzata dei pacchetti. Lo strumento utilizzato per fare l'effettiva compilazione dei pacchetti, <systemitem role="package">sbuild</systemitem> è disponibile come un pacchetto, si consulti la sua descrizione in <xref linkend="sbuild"/>. Si noti che la versione pacchettizzata non è la stessa di quella utilizzata dai demoni di compilazioni, ma è abbastanza vicina per riprodurne i problemi.

source: Most of the data produced by <systemitem role="package">wanna-build</systemitem> which is generally useful to porters is available on the web at <ulink url="&url-buildd;"></ulink>. This data includes nightly updated statistics, queueing information and logs for build attempts.
it: La maggior parte dei dati prodotti da <systemitem role="package">wanna-build</systemitem> che sono generalmente utili per gli autori di port è disponibile sul web all'indirizzo <ulink url="&url-buildd;"></ulink>. Questi dati includono le statistiche aggiornate ogni notte, informazioni sulle code e i log dei tentativi di compilazione.

source: We are quite proud of this system, since it has so many possible uses. Independent development groups can use the system for different sub-flavors of Debian, which may or may not really be of general interest (for instance, a flavor of Debian built with <command>gcc</command> bounds checking). It will also enable Debian to recompile entire distributions quickly.
it: Siamo molto orgogliosi di questo sistema, dal momento che ha tanti usi possibili. Gruppi di sviluppo indipendenti possono utilizzare il sistema per diverse sotto-versioni di Debian, che possono o non possono essere di interesse generale (per esempio, una versione di Debian compilata con il bound-checking di <command>gcc</command>). Essa consentirà inoltre a Debian di ricompilare intere distribuzioni rapidamente.

source: The wanna-build team, in charge of the buildds, can be reached at <literal>debian-wb-team@lists.debian.org</literal>. To determine who (wanna-build team, release team) and how (mail, BTS) to contact, refer to <ulink url="&url-wb-team;"></ulink>.
it: Il team di wanna-build, responsabile dei buildd, può essere raggiunto all'indirizzo <literal>debian-wb-team@lists.debian.org</literal>. Per determinare chi contattare (team di wanna-build, team del rilascio) e come (posta, BTS), si faccia riferimento a <ulink url="&url-wb-team;"></ulink>.

source: When requesting binNMUs or give-backs (retries after a failed build), please use the format described at <ulink url="&url-release-wb;"/>.
it: Quando si richiedono dei binNMUs o dei give-backs (un nuovo tentativo dopo una compilazione fallita), utilizzare il formato descritto in <ulink url="&url-release-wb;"/>.

source: When your package is <emphasis>not</emphasis> portable
it: Quando il pacchetto <emphasis>non</emphasis> è portabile

source: Some packages still have issues with building and/or working on some of the architectures supported by Debian, and cannot be ported at all, or not within a reasonable amount of time. An example is a package that is SVGA-specific (only available for <literal>i386</literal> and <literal>amd64</literal>), or uses other hardware-specific features not supported on all architectures.
it: Alcuni pacchetti hanno ancora problemi con la compilazione o con il funzionamento su alcune delle architetture supportate da Debian, ed è del tutto impossibile farne il port, o non entro un ragionevole lasso di tempo. Un esempio è un pacchetto che è SVGA-specifico (disponibile solo per <literal>i386</literal> e <literal>amd64</literal>), o che utilizzi altre caratteristiche specifiche dell'hardware non supportate su tutte le architetture.

source: In order to prevent broken packages from being uploaded to the archive, and wasting buildd time, you need to do a few things:
it: Al fine di evitare che pacchetti danneggiati vengano caricati nell'archivio, e sprecare tempo dei buildd, è necessario fare un paio di cose:

source: First, make sure your package <emphasis>does</emphasis> fail to build on architectures that it cannot support. There are a few ways to achieve this. The preferred way is to have a small testsuite during build time that will test the functionality, and fail if it doesn't work. This is a good idea anyway, as this will prevent (some) broken uploads on all architectures, and also will allow the package to build as soon as the required functionality is available.
it: In primo luogo, assicurarsi che il pacchetto <emphasis>fallisca</emphasis> la compilazione su architetture che non supporta. Ci sono alcuni modi per raggiungere questo obiettivo. Il modo migliore è quello di avere una piccola suite di test che ne verifichi le funzionalità durante la compilazione, e che fallirà se non funziona. Questa è comunque una buona idea, in modo da evitare (alcuni) caricamenti difettosi in tutte le architetture, e permetterà anche al pacchetto di compilarsi appena la funzionalità richiesta viene resa disponibile.

source: Additionally, if you believe the list of supported architectures is pretty constant, you should change <literal>any</literal> to a list of supported architectures in <filename>debian/control</filename>. This way, the build will fail also, and indicate this to a human reader without actually trying.
it: Inoltre, se si ritiene che l'elenco delle architetture supportate sia piuttosto costante, si dovrebbe cambiare <literal>any</literal> in un elenco delle architetture supportate in <filename>debian/control</filename>. In questo modo, anche la compilazione fallirà, e lo indicherà ad un lettore umano senza che realmente la si tenti.

source: In order to prevent autobuilders from needlessly trying to build your package, it must be included in <filename>Packages-arch-specific</filename>, a list used by the <command>wanna-build</command> script. The current version is available as <ulink url="&url-buildd-p-a-s;"/>; please see the top of the file for whom to contact for changes.
it: Al fine di evitare che gli strumenti di compilazione automatica cerchino dal cercare inutilmente di compilare il pacchetto, deve essere incluso in <filename>Packages-arch-specific</filename>, un elenco utilizzato dallo script <command>wanna-build</command>. L'attuale versione è disponibile come <ulink url="&url-buildd-p-a-s;"/>; consultare la parte iniziale del file per chi contattare per le modifiche.

source: Please note that it is insufficient to only add your package to <filename>Packages-arch-specific</filename> without making it fail to build on unsupported architectures: A porter or any other person trying to build your package might accidently upload it without noticing it doesn't work. If in the past some binary packages were uploaded on unsupported architectures, request their removal by filing a bug against <systemitem role="package">ftp.debian.org</systemitem>.
it: Si noti che non è sufficiente aggiungere solo il pacchetto in <filename>Packages-arch-specific</filename>, senza far fallire la compilazione sulle architetture non supportate: un autore di port o una qualsiasi altra persona che cerca di compilare il pacchetto potrebbe accidentalmente caricarlo senza notare che non funziona. Se in passato alcuni pacchetti binari sono stati caricati su architetture non supportate, si richieda la loro rimozione segnalando un bug su <systemitem role="package">ftp.debian.org</systemitem>.

source: Marking non-free packages as auto-buildable
it: Marcare i pacchetti non-free come compilabili automaticamente

source: By default packages from the <literal>non-free</literal> section are not built by the autobuilder network (mostly because the license of the packages could disapprove). To enable a package to be build you need to perform the following steps:
it: In modo definitivo i pacchetti della sezione <literal>non-free</literal> non sono compilati dalla rete di compilazione automatica (soprattutto perché la licenza dei pacchetti potrebbe non approvarlo). Per abilitare la compilazione di un pacchetto è necessario eseguire le seguenti operazioni:

source: Check whether it is legally allowed and technically possible to auto-build the package;
it: Si controlli se è legalmente consentito e tecnicamente possibile automatizzare la compilazione del pacchetto;

source: Add <literal>XS-Autobuild: yes</literal> into the header part of <filename>debian/control</filename>;
it: Si aggiunga <literal>XS-Autobuild: yes</literal> nell'intestazione di <filename>debian/control</filename>;

source: Send an email to &email-nonfree-release; and explain why the package can legitimately and technically be auto-built.
it: Si invii una email a &email-nonfree-release; e si spieghi perché il pacchetto può legittimamente e tecnicamente essere automaticamente compilato.

source: Non-Maintainer Uploads (NMUs)
it: Caricamenti dei Non-Maintainer (NMU)

source: Every package has one or more maintainers. Normally, these are the people who work on and upload new versions of the package. In some situations, it is useful that other developers can upload a new version as well, for example if they want to fix a bug in a package they don't maintain, when the maintainer needs help to respond to issues. Such uploads are called <emphasis>Non-Maintainer Uploads (NMU)</emphasis>.
it: Ogni pacchetto ha uno o più maintainer. Normalmente, queste sono le persone che ci lavorano e caricano nuove versioni del pacchetto. In alcune situazioni è utile che anche altri sviluppatori possano caricare una nuova versione, per esempio se vogliono risolvere un bug in un pacchetto che non mantengono, quando il maintainer ha bisogno di aiuto per rispondere alle segnalazioni. Tali aggiornamenti sono chiamati <emphasis>Non-Maintainer Upload (NMU)</emphasis>.

source: When and how to do an NMU
it: Quando e come fare un NMU

source: Before doing an NMU, consider the following questions:
it: Prima di fare un NMU, si considerino le seguenti domande:

source: Have you geared the NMU towards helping the maintainer? As there might be disagreement on the notion of whether the maintainer actually needs help on not, the DELAYED queue exists to give time to the maintainer to react and has the beneficial side-effect of allowing for independent reviews of the NMU diff.
it: Il proprio NMU davvero corregge i bug? Risolvere problemi superficiali o cambiare lo stile di pacchettizzazione è scoraggiato in una NMU.

source: Does your NMU really fix bugs? ("Bugs" means any kind of bugs, e.g. wishlist bugs for packaging a new upstream version, but care should be taken to minimize the impact to the maintainer.) Fixing cosmetic issues or changing the packaging style (e.g. switching from cdbs to dh) in NMUs is discouraged.
it: Si è concesso abbastanza tempo al maintainer? Quando è stato segnalato il bug su BTS? Essere occupato per una settimana o due non è insolito. Il bug è così grave che deve essere risolto in questo momento, o può aspettare ancora qualche giorno?

source: Did you give enough time to the maintainer? When was the bug reported to the BTS? Being busy for a week or two isn't unusual. Is the bug so severe that it needs to be fixed right now, or can it wait a few more days?
it: Quanto si è sicuri delle modifiche? Si ricordi il giuramento di Ippocrate: «Prima di tutto, non nuocere.» È meglio lasciare un pacchetto con un bug grave aperto che applicare una patch non funzionante, o una che nasconde il bug invece di risolverlo. Se non si è sicuri al 100% di quello che si è fatto, potrebbe essere una buona idea chiedere il parere di altri. Si ricordi che se si rompe qualcosa nel proprio NMU, molte persone saranno molto scontente al riguardo.

source: How confident are you about your changes? Please remember the Hippocratic Oath: "Above all, do no harm." It is better to leave a package with an open grave bug than applying a non-functional patch, or one that hides the bug instead of resolving it. If you are not 100% sure of what you did, it might be a good idea to seek advice from others. Remember that if you break something in your NMU, many people will be very unhappy about it.
it: Come si e sicuri sulle modifiche? Si ricorda il giuramento di Ippocrate: "Soprattutto, non nuocere". E' meglio lasciare un pacchetto con un grave bug aperto che applicare una patch non funzionante, o uno che nasconde il bug invece di risolverlo. Se non si è sicuri al 100% di quello che si è fatto, potrebbe essere una buona idea chiedere il parere di altri. Ricordate che se si rompe qualcosa nel proprio NMU, molte persone saranno molto infelici di questo.

source: Have you clearly expressed your intention to NMU, at least in the BTS? It is also a good idea to try to contact the maintainer by other means (private email, IRC).
it: Si è espressa chiaramente l'intenzione di un NMU, almeno nel BTS? È anche una buona idea cercare di contattare il maintainer con altri mezzi (posta privata, IRC).

source: If the maintainer is usually active and responsive, have you tried to contact them? In general it should be considered preferable that maintainers take care of an issue themselves and that they are given the chance to review and correct your patch, because they can be expected to be more aware of potential issues which an NMUer might miss. It is often a better use of everyone's time if the maintainer is given an opportunity to upload a fix on their own.
it: Se il maintainer è in genere attivo e reattivo, si è provato a contattarlo? Generalmente, dovrebbe essere considerato preferibile che i maintainer si prendano cura di un problema essi stessi e che abbiano la possibilità di rivedere e correggere la patch, in quanto sono più consapevoli dei potenziali problemi che un autore di NMU potrebbe non considerare. Spesso è un miglior uso del tempo di tutti se al maintainer viene data la possibilità di caricare una propria soluzione.

source: When doing an NMU, you must first make sure that your intention to NMU is clear. Then, you must send a patch with the differences between the current package and your proposed NMU to the BTS. The <command>nmudiff</command> script in the <systemitem role="package">devscripts</systemitem> package might be helpful.
it: Nel fare un NMU, è necessario assicurarsi che la propria intenzione di un NMU sia chiara. Quindi, è necessario inviare una patch al BTS con le differenze tra il pacchetto attuale e il proprio NMU. Lo script <command>nmudiff</command> nel pacchetto <systemitem role="package">devscripts</systemitem> potrebbe essere utile.

source: While preparing the patch, you should better be aware of any package-specific practices that the maintainer might be using. Taking them into account reduces the burden of integrating your changes into the normal package workflow and thus increases the chances that integration will happen. A good place where to look for for possible package-specific practices is <ulink url="&url-debian-policy;ch-source.html#s-readmesource"><filename>debian/README.source</filename></ulink>.
it: Mentre si prepara la patch, si dovrebbero conoscere bene tutte le pratiche specifiche del pacchetto che il maintainer potrebbe utilizzare. Tenerne conto riduce l'onere di integrare i propri cambiamenti nel normale flusso di lavoro del pacchetto e quindi aumenta la probabilità che l'integrazione avvenga. Un buon posto dove cercare per possibili pratiche specifiche sul pacchetto è <ulink url="&url-debian-policy;ch-source.html#s-readmesource"><filename>debian/README.source</filename></ulink>.

source: Unless you have an excellent reason not to do so, you must then give some time to the maintainer to react (for example, by uploading to the <literal>DELAYED</literal> queue). Here are some recommended values to use for delays:
it: A meno che non si disponga di un ottimo motivo per non farlo, è necessario quindi dare un po' di tempo al maintainer per reagire (per esempio, caricandolo nella coda <literal>DELAYED</literal>). Ecco alcuni valori consigliati da usare nei casi differiti:

source: Upload fixing only release-critical bugs older than 7 days, with no maintainer activity on the bug for 7 days and no indication that a fix is in progress: 0 days
it: Caricamento che risolve solo bug critici per il rilascio più vecchi di 7 giorni, senza alcuna attività del maintainer sul bug per 7 giorni e nessuna indicazione che si stia lavorando ad una soluzione: 0 giorni

source: Upload fixing only release-critical bugs older than 7 days: 2 days
it: Caricamento che risolve solo bug critici per il rilascio più vecchi di 7 giorni: 2 giorni

source: Upload fixing only release-critical and important bugs: 5 days
it: Caricamento che risolve solo bug critici per il rilascio e per bug importanti: 5 giorni

source: Other NMUs: 10 days
it: Altri NMU: 10 giorni

source: Those delays are only examples. In some cases, such as uploads fixing security issues, or fixes for trivial bugs that block a transition, it is desirable that the fixed package reaches <literal>unstable</literal> sooner.
it: Tali ritardi sono solo degli esempi. In alcuni casi, come ad esempio caricamenti di correzioni di problemi di sicurezza o di correzioni di bug banali che bloccano una transizione, è auspicabile che il pacchetto corretto raggiunga prima <literal>unstable</literal>.

source: Sometimes, release managers decide to allow NMUs with shorter delays for a subset of bugs (e.g release-critical bugs older than 7 days). Also, some maintainers list themselves in the <ulink url="&url-low-threshold-nmu;">Low Threshold NMU list</ulink>, and accept that NMUs are uploaded without delay. But even in those cases, it's still a good idea to give the maintainer a few days to react before you upload, especially if the patch wasn't available in the BTS before, or if you know that the maintainer is generally active.
it: A volte, i gestori dei rilasci decidono di permettere NMU con ritardi più brevi per un sottoinsieme di bug (ad esempio bug critici per il rilascio più vecchi di 7 giorni). Inoltre, alcuni maintainer si inseriscono nell'<ulink url="&url-low-threshold-nmu;">elenco Low Threshold NMU</ulink>, e accettano che questi NMU vengano caricati senza ritardo. Ma anche in questi casi, è sempre una buona idea concedere al maintainer un paio di giorni per reagire prima di fare il caricamento, soprattutto se la patch non era prima disponibile nel BTS, o se si sa che il maintainer è generalmente attivo.

source: After you upload an NMU, you are responsible for the possible problems that you might have introduced. You must keep an eye on the package (subscribing to the package on the PTS is a good way to achieve this).
it: Dopo aver caricato un NMU, si è responsabili per i possibili problemi che si potrebbe avere introdotto. È necessario tenere d'occhio il pacchetto (iscriversi al pacchetto sul PTS è un buon modo per raggiungere questo obiettivo).

source: This is not a license to perform NMUs thoughtlessly. If you NMU when it is clear that the maintainers are active and would have acknowledged a patch in a timely manner, or if you ignore the recommendations of this document, your upload might be a cause of conflict with the maintainer. You should always be prepared to defend the wisdom of any NMU you perform on its own merits.
it: Questa non è una licenza per eseguire NMU in modo sconsiderato. Se si effettua un NMU quando è chiaro che i maintainer sono attivi e avrebbero preso in considerazione una patch tempestivamente, oppure se si ignorano le raccomandazioni di questo documento, il caricamento potrebbe essere causa di conflitto con il maintainer. Si dovrebbe sempre essere pronti a difendere la saggezza di ogni NMU che si fa sulla base dei suoi meriti.

source: NMUs and <filename>debian/changelog</filename>
it: NMU e <filename>debian/changelog</filename>

source: Just like any other (source) upload, NMUs must add an entry to <filename>debian/changelog</filename>, telling what has changed with this upload. The first line of this entry must explicitely mention that this upload is an NMU, e.g.:
it: Proprio come qualsiasi altro caricamento (di sorgenti), gli NMU deveno aggiungere una voce a <filename>debian/changelog</filename>, descrivendo cosa è cambiato con questo caricamento. La prima riga di questa voce deve esplicitamente menzionare che questo caricamento è un NMU, ad esempio:

source: The way to version NMUs differs for native and non-native packages.
it: Il modo di assegnare versioni agli NMU è differente per i pacchetti nativi e per i non-nativi.

source: If the package is a native package (without a Debian revision in the version number), the version must be the version of the last maintainer upload, plus <literal>+nmu<replaceable>X</replaceable></literal>, where <replaceable>X</replaceable> is a counter starting at <literal>1</literal>. If the last upload was also an NMU, the counter should be increased. For example, if the current version is <literal>1.5</literal>, then an NMU would get version <literal>1.5+nmu1</literal>.
it: Se il pacchetto è un pacchetto nativo (senza una revisione Debian nel numero di versione), la versione deve essere la versione dell'ultimo caricamento del maintainer, più <literal>+nmu<replaceable>X</replaceable></literal>, dove <replaceable>X</replaceable> è un contatore a partire <literal>1</literal>. Se anche l'ultimo caricamento è stato un NMU, il contatore dovrebbe essere aumentato. Ad esempio, se la versione corrente è <literal>1.5</literal>, allora un NMU avrebbe la versione <literal>1.5+nmu1</literal>.
