Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: <emphasis role="strong">should</emphasis> be documented in the resulting source package. Detailed information on how the repackaged source was obtained, and on how this can be reproduced should be provided in <filename>debian/copyright</filename>. It is also a good idea to provide a <literal>get-orig-source</literal> target in your <filename>debian/rules</filename> file that repeats the process, as described in the Policy Manual, <ulink url="&url-debian-policy;ch-source.html#s-debianrules">Main building script: <filename>debian/rules</filename></ulink>.
it: <emphasis role="strong">dovrebbe</emphasis> essere documentata nel pacchetto sorgente risultante. Informazioni dettagliate su come è stato ottenuto il sorgente ripacchettizzato e su come questo può essere riprodotto dovrebbero essere fornite in <filename>debian/copyright</filename>. È anche una buona idea fornire un <literal>get-orig-source</literal> target nel proprio <filename>debian/rules</filename>, che ripete il processo, come descritto nel Policy Manual, <ulink url="&url-debian-policy;ch-source.html#s-debianrules">Script principale per la compilazione: <filename>debian/rules</filename></ulink>.

source: As a special exception, if the omission of non-free files would lead to the source failing to build without assistance from the Debian diff, it might be appropriate to instead edit the files, omitting only the non-free parts of them, and/or explain the situation in a <filename>README.source</filename> file in the root of the source tree. But in that case please also urge the upstream author to make the non-free components easier separable from the rest of the source.
it: Come eccezione, se l'omissione di file non liberi porterebbe il sorgente a fallire la compilazione senza assistenza da parte del Debian diff, potrebbe essere opportuno modificare invece i file, omettendo solo le loro parti non-free, o spiegare la situazione in un <filename>README.source</filename> nella radice dell'albero del sorgente. Ma anche in questo caso sollecitare l'autore originale affinché renda i componenti non liberi facilmente separabili dal resto del sorgente.

source: <emphasis role="strong">should not</emphasis> contain any file that does not come from the upstream author(s), or whose contents has been changed by you.<placeholder type="footnote" id="0"/>
it: <emphasis role="strong">non dovrebbe</emphasis> contenere qualsiasi tipo di file che non proviene dall'autore originale, o il cui contenuto è stato modificato. <placeholder type="footnote" id="0"/>

source: <emphasis role="strong">should</emphasis>, except where impossible for legal reasons, preserve the entire building and portablility infrastructure provided by the upstream author. For example, it is not a sufficient reason for omitting a file that it is used only when building on MS-DOS. Similarly, a <filename>Makefile</filename> provided by upstream should not be omitted even if the first thing your <filename>debian/rules</filename> does is to overwrite it by running a configure script.
it: <emphasis role="strong">dovrebbe</emphasis>, salvo che per motivi legali, preservare l'intera infrastruttura per la compilazione e per la portabilità fornita dall'autore originale. Ad esempio, non è una ragione sufficiente per omettere un file che viene utilizzato solo quando si compila su MS-DOS. Allo stesso modo, un <filename>Makefile</filename> fornito dall'autore originale non dovrebbe essere omesso anche se la prima cosa che il proprio <filename>debian/rules</filename> fa è sovrascriverlo eseguendo uno script di configurazione.

source: (<emphasis>Rationale:</emphasis> It is common for Debian users who need to build software for non-Debian platforms to fetch the source from a Debian mirror rather than trying to locate a canonical upstream distribution point).
it: (<emphasis>Motivazione:</emphasis> È comune per gli utenti Debian che hanno bisogno di compilare software per piattaforme non-Debian prendere il sorgente da uno dei mirror Debian piuttosto che cercare di individuare un punto canonico di distribuzione originale).

source: <emphasis role="strong">should</emphasis> use <filename><replaceable>packagename</replaceable>-<replaceable>upstream-version</replaceable>.orig</filename> as the name of the top-level directory in its tarball. This makes it possible to distinguish pristine tarballs from repackaged ones.
it: <emphasis role="strong">dovrebbe</emphasis> usare <filename><replaceable>packagename</replaceable>-<replaceable>upstream-version</replaceable>.orig</filename> come nome per la più alta cartella nel suo tarball. Ciò rende possibile distinguere tarball puri da quelli ripacchettizzati.

source: <emphasis role="strong">should</emphasis> be gzipped or bzipped with maximal compression.
it: <emphasis role="strong">dovrebbe</emphasis> essere compresso con gzip o bzip con la massima compressione.

source: Changing binary files
it: Modifica dei file binari

source: Sometimes it is necessary to change binary files contained in the original tarball, or to add binary files that are not in it. This is fully supported when using source packages in “3.0 (quilt)” format, see the <citerefentry><refentrytitle>dpkg-source</refentrytitle><manvolnum>1</manvolnum></citerefentry> manual page for details. When using the older format “1.0”, binary files can't be stored in the <filename>.diff.gz</filename> so you must store an <command>uuencode</command>d (or similar) version of the file(s) and decode it at build time in <filename>debian/rules</filename> (and move it in its official location).
it: A volte è necessario cambiare file binari contenuti nel tarball originale, o per aggiungere file binari che non vi sono contenuti. Questo è completamente supportato quando si usano pacchetti sorgente in formato «3.0 (quilt)», si consulti la pagina di manuale <citerefentry> <refentrytitle>dpkg-source</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> per i dettagli. Quando si utilizza il vecchio formato «1.0», i file binari non possono essere memorizzati nel <filename>.diff.gz</filename> quindi è necessario memorizzare un <command>uuencode</command>d (o simile) versione del file e decodificarlo in fase di compilazione in <filename>debian/rules</filename> (e spostarlo nella sua posizione ufficiale).

source: Best practices for debug packages
it: Buone pratiche per i pacchetti di debug

source: A debug package is a package with a name ending in -dbg, that contains additional information that <command>gdb</command> can use. Since Debian binaries are stripped by default, debugging information, including function names and line numbers, is otherwise not available when running <command>gdb</command> on Debian binaries. Debug packages allow users who need this additional debugging information to install it, without bloating a regular system with the information.
it: Un pacchetto di debug è un pacchetto con un nome che termina in -dbg, che contiene ulteriori informazioni che <command>gdb</command> può utilizzare. Poiché i binari di Debian vengono separati di default, le informazioni di debug, compresi i nomi delle funzioni e numeri di riga, non sono disponibili quando si esegue <command>gdb</command> su binari Debian. I pacchetti di debug consentono di installarli agli utenti che hanno bisogno di queste informazioni aggiuntive, senza appesantire un regolare sistema con queste informazioni.

source: It is up to a package's maintainer whether to create a debug package or not. Maintainers are encouraged to create debug packages for library packages, since this can aid in debugging many programs linked to a library. In general, debug packages do not need to be added for all programs; doing so would bloat the archive. But if a maintainer finds that users often need a debugging version of a program, it can be worthwhile to make a debug package for it. Programs that are core infrastructure, such as apache and the X server are also good candidates for debug packages.
it: Spetta al maintainer di un pacchetto se creare un pacchetto di debug o meno. I maintainer sono incoraggiati a creare i pacchetti di debug per i pacchetti di libreria, dal momento che questi possono aiutare nel debug di molti programmi legati ad una libreria. In generale, i pacchetti di debug non devono essere aggiunti per tutti i programmi, facendo così appesantire l'archivio. Ma se un maintainer ritiene che gli utenti spesso hanno bisogno di una versione di debug di un programma, può essere utile fare un pacchetto di debug. I programmi che fanno parte dell'infrastruttura di base, come ad esempio Apache e il server X sono anche dei buoni candidati per i pacchetti di debug.

source: Some debug packages may contain an entire special debugging build of a library or other binary, but most of them can save space and build time by instead containing separated debugging symbols that <command>gdb</command> can find and load on the fly when debugging a program or library. The convention in Debian is to keep these symbols in <filename>/usr/lib/debug/<replaceable>path</replaceable></filename>, where <replaceable>path</replaceable> is the path to the executable or library. For example, debugging symbols for <filename>/usr/bin/foo</filename> go in <filename>/usr/lib/debug/usr/bin/foo</filename>, and debugging symbols for <filename>/usr/lib/libfoo.so.1</filename> go in <filename>/usr/lib/debug/usr/lib/libfoo.so.1</filename>.
it: Alcuni pacchetti di debug possono contenere un completo e particolare versione di debug compilata di una libreria o di altro binario, ma la maggior parte di loro può risparmiare spazio e tempo di compilazione contenendo invece simboli di debug separati che <command>gdb</command> è in grado di trovare e caricare al volo quando si effettua il debug di un programma o di una libreria. La convenzione in Debian è quella di mantenere questi simboli in <filename>/usr/lib/debug/<replaceable>path</replaceable></filename>, dove <replaceable>path</replaceable> è il percorso al file eseguibile o alla libreria. Ad esempio, i simboli di debug per <filename>/usr/bin/foo</filename> vanno in <filename>/usr/lib/debug/usr/bin/foo</filename> e simboli di debug per <filename>/usr/lib/libfoo.so.1</filename> vanno in <filename>/usr/lib/debug/usr/lib/libfoo.so.1</filename>.

source: The debugging symbols can be extracted from an object file using <command>objcopy --only-keep-debug</command>. Then the object file can be stripped, and <command>objcopy --add-gnu-debuglink</command> used to specify the path to the debugging symbol file. <citerefentry> <refentrytitle>objcopy</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> explains in detail how this works.
it: I simboli di debug possono essere estratti da un file oggetto usando <command>objcopy - only-keep-debug</command>. Successivamente il file oggetto può essere spogliato e <command>objcopy - add-gnu-debuglink</command> è utilizzato per specificare il percorso del file di simboli di debug. <citerefentry> <refentrytitle>objcopy</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> spiega nel dettaglio come funziona questo processo.

source: The <command>dh_strip</command> command in <systemitem role="package">debhelper</systemitem> supports creating debug packages, and can take care of using <command>objcopy</command> to separate out the debugging symbols for you. If your package uses <systemitem role="package">debhelper</systemitem>, all you need to do is call <command>dh_strip --dbg-package=libfoo-dbg</command>, and add an entry to <filename>debian/control</filename> for the debug package.
it: Il comando <command>dh_strip</command> in <systemitem role="package">debhelper</systemitem> supporta la creazione di pacchetti di debug e può prendersi cura per voi di utilizzare <command>objcopy</command> per separare i simboli di debug. Se il pacchetto utilizza <systemitem role="package">debhelper</systemitem>, tutto quello che dovete fare è chiamare <command>dh_strip - DBG-package = libfoo-dbg</command>, ed aggiungere una voce al <filename>debian/control</filename> per il pacchetto di debug.

source: Note that the debug package should depend on the package that it provides debugging symbols for, and this dependency should be versioned. For example:
it: Si noti che il pacchetto di debug dovrebbe dipendere dal pacchetto per il quale fornisce i simboli di debug e questa dipendenza dovrebbe essere versionata. Per esempio:

source: Best practices for meta-packages
it: Buone pratiche per i metapacchetti

source: A meta-package is a mostly empty package that makes it easy to install a coherent set of packages that can evolve over time. It achieves this by depending on all the packages of the set. Thanks to the power of APT, the meta-package maintainer can adjust the dependencies and the user's system will automatically get the supplementary packages. The dropped packages that were automatically installed will be also be marked as removal candidates (and are even automatically removed by <command>aptitude</command>). <systemitem role="package">gnome</systemitem> and <systemitem role="package">linux-image-amd64</systemitem> are two examples of meta-packages (built by the source packages <systemitem role="package">meta-gnome2</systemitem> and <systemitem role="package">linux-latest</systemitem>).
it: Un metapacchetto è un pacchetto per lo più vuoto che rende facile installare un insieme coerente di pacchetti che possono evolvere nel tempo. Realizza ciò creando una dipendenza per tutti i pacchetti dell'insieme. Grazie alla potenza di APT, il maintainer del metapacchetto può sistemare le dipendenze e il sistema dell'utente otterrà automaticamente i pacchetti supplementari. I pacchetti eliminati che sono stati installati automaticamente verranno contrassegnati come candidati alla rimozione (e saranno anche rimossi automaticamente da <command>aptitude</command>). <systemitem role="package">gnome</systemitem> e <systemitem role="package">linux-image-amd64</systemitem> sono due esempi di metapacchetti (compilati dai pacchetti sorgente <systemitem role = "pacchetto ">meta-gnome2</systemitem> e <systemitem role="package">linux-latest</systemitem>).

source: The long description of the meta-package must clearly document its purpose so that the user knows what they will lose if they remove the package. Being explicit about the consequences is recommended. This is particularly important for meta-packages which are installed during initial installation and that have not been explicitly installed by the user. Those tend to be important to ensure smooth system upgrades and the user should be discouraged from uninstalling them to avoid potential breakages.
it: La descrizione lunga del metapacchetto deve documentare chiaramente il suo scopo in modo che l'utente sappia che cosa si perderà se rimuovono il pacchetto. È raccomandato essere chiari sulle conseguenze. Ciò è particolarmente importante per i metapacchetti che vengono installati durante l'installazione iniziale e che non sono stati installati esplicitamente dall'utente. Questi tendono ad essere importanti per garantire regolari aggiornamenti del sistema e l'utente dovrebbe essere disincentivato dal disinstallarli in modo da evitare potenziali rotture.

source: Beyond Packaging
it: Oltre la pacchettizzazione

source: Debian is about a lot more than just packaging software and maintaining those packages. This chapter contains information about ways, often really critical ways, to contribute to Debian beyond simply creating and maintaining packages.
it: Debian è molto più di un semplice software di confezionamento e di mantenimento di questi pacchetti. Questo capitolo contiene informazioni sui modi, modi spesso molto critici, per contribuire a Debian oltre la semplice creazione e la manutenzione dei pacchetti.

source: As a volunteer organization, Debian relies on the discretion of its members in choosing what they want to work on and in choosing the most critical thing to spend their time on.
it: Come organizzazione di volontariato, Debian si basa sulla discrezione dei suoi membri nella scelta di ciò su cui vogliono lavorare e nello scegliere la cosa più critica sulla quale trascorre la maggior parte del proprio tempo.

source: Bug reporting
it: Segnalare i bug

source: We encourage you to file bugs as you find them in Debian packages. In fact, Debian developers are often the first line testers. Finding and reporting bugs in other developers' packages improves the quality of Debian.
it: Si consiglia di notificare i bug appena li si trovi nei pacchetti Debian. In realtà, gli sviluppatori Debian sono spesso la prima linea di tester. L'individuazione e la segnalazione di bug nei pacchetti di altri sviluppatori migliora la qualità di Debian.

source: Read the <ulink url="&url-bts-report;">instructions for reporting bugs</ulink> in the Debian <ulink url="&url-bts;">bug tracking system</ulink>.
it: Si leggano le <ulink url="&url-bts-report;">istruzioni per la segnalazione di bug</ulink> nel <ulink url="&url-bts;">sistema di tracciamento dei bug</ulink> di Debian.

source: Try to submit the bug from a normal user account at which you are likely to receive mail, so that people can reach you if they need further information about the bug. Do not submit bugs as root.
it: Provare a presentare il bug da un account di un utente normale dove si preferisce ricevere la posta, in modo che le persone possano rintracciarvi se hanno bisogno di ulteriori informazioni sul bug. Non inviare bug come root.

source: You can use a tool like <citerefentry> <refentrytitle>reportbug</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> to submit bugs. It can automate and generally ease the process.
it: È possibile utilizzare uno strumento come <citerefentry> <refentrytitle>reportbug</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> per segnalare bug. È in grado di automatizzare e in generale facilitare il processo.

source: Make sure the bug is not already filed against a package. Each package has a bug list easily reachable at <literal>https://&bugs-host;/<replaceable>packagename</replaceable></literal>. Utilities like <citerefentry> <refentrytitle>querybts</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> can also provide you with this information (and <command>reportbug</command> will usually invoke <command>querybts</command> before sending, too).
it: Assicurarsi che il bug non sia già stato presentato per un pacchetto. Ogni pacchetto ha una lista di bug facilmente raggiungibile a <literal>http://&bugs-host;/<replaceable>nomepacchetto</replaceable> </literal>. Programmi di utilità come <citerefentry> <refentrytitle>querybts</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> possono anche fornire queste informazioni (e anche <command>reportbug</command> di solito invocherà querybts prima di inviare).

source: Try to direct your bugs to the proper location. When for example your bug is about a package which overwrites files from another package, check the bug lists for <emphasis>both</emphasis> of those packages in order to avoid filing duplicate bug reports.
it: Cercare di indirizzare i bug nella posizione corretta. Quando per esempio il proprio bug è relativo ad un pacchetto che sovrascrive i file appartenenti ad un altro pacchetto, controllare le liste di bug per <emphasis>entrambi</emphasis> questi pacchetti in modo da evitare di presentare duplicati di segnalazioni di bug.

source: For extra credit, you can go through other packages, merging bugs which are reported more than once, or tagging bugs `fixed' when they have already been fixed. Note that when you are neither the bug submitter nor the package maintainer, you should not actually close the bug (unless you secure permission from the maintainer).
it: Per maggior credito, si può passare attraverso altri pacchetti, unificando i bug che sono riportati più di una volta, o etichettando bug «fixed» quando sono già stati risolti. Si noti che quando non si è né il mittente del bug né il maintainer del pacchetto, non si dovrebbe in realtà chiudere il bug (a meno che non si ha il permesso del maintainer).

source: From time to time you may want to check what has been going on with the bug reports that you submitted. Take this opportunity to close those that you can't reproduce anymore. To find out all the bugs you submitted, you just have to visit <literal>https://&bugs-host;/from:<replaceable>your-email-addr</replaceable></literal>.
it: Di tanto in tanto si consiglia di controllare lo stato di avanzamento del bug che si è inviato. Cogliere l'occasione di chiudere quelli che non è possibile più riprodurre. Per scoprire tutti i bug che si sono inviati, è sufficiente visitare <literal>http://&bugs-host;/from:<replaceable>proprio-indirizzo-email</replaceable></literal>.

source: Reporting lots of bugs at once (mass bug filing)
it: Riportare molti bug in una sola volta (presentazione massiccia di bug)

source: Reporting a great number of bugs for the same problem on a great number of different packages — i.e., more than 10 — is a deprecated practice. Take all possible steps to avoid submitting bulk bugs at all. For instance, if checking for the problem can be automated, add a new check to <systemitem role="package">lintian</systemitem> so that an error or warning is emitted.
it: Segnalare un gran numero di bug per lo stesso problema su un gran numero di pacchetti differenti - vale a dire, più di 10 - è una pratica sconsigliata. Prendete tutte le misure possibili per evitare del tutto di sottoporre bug massicci. Per esempio, se il controllo per il problema può essere automatizzato, aggiungere un nuovo controllo per <systemitem role="package">lintian</systemitem> in modo che venga emesso un errore o un avviso.

source: If you report more than 10 bugs on the same topic at once, it is recommended that you send a message to &email-debian-devel; describing your intention before submitting the report, and mentioning the fact in the subject of your mail. This will allow other developers to verify that the bug is a real problem. In addition, it will help prevent a situation in which several maintainers start filing the same bug report simultaneously.
it: Se si riportano più di 10 bug sullo stesso argomento in una sola volta, si consiglia di inviare un messaggio a &email-debian-devel; dove descrivete la vostra intenzione prima di presentare il rapporto e di menzionarla nell'oggetto della mail. Questo permetterà ad altri sviluppatori di verificare che il bug sia un problema reale. Inoltre, aiuterà a prevenire una situazione in cui molti maintainer iniziano ad occuparsi simultaneamente dello stesso bug.

source: Please use the programs <command>dd-list</command> and if appropriate <command>whodepends</command> (from the package <systemitem role="package">devscripts</systemitem>) to generate a list of all affected packages, and include the output in your mail to &email-debian-devel;.
it: Utilizzare i programmi <command>dd-list</command> e se appropriato <command>whodepends</command> (dal pacchetto <systemitem role="package">devscripts</systemitem>) per generare un elenco di tutti i pacchetti interessati, ed includere l'output nella propria email indirizzata a &email-debian-devel;.

source: Note that when sending lots of bugs on the same subject, you should send the bug report to <email>maintonly@&bugs-host;</email> so that the bug report is not forwarded to the bug distribution mailing list.
it: Si noti che quando si inviano molti bug sullo stesso argomento, si dovrebbe inviare la segnalazione di bug a <email>maintonly@&bugs-host;</email> in modo che la segnalazione non venga inoltrata alla mailing list di distribuzione bug.

source: Usertags
it: Usertag
