Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: <systemitem role="package">debiandoc-sgml</systemitem> provides the DebianDoc SGML DTD, which is commonly used for Debian documentation, but is now deprecated (<systemitem role="package">docbook-xml</systemitem> should be used instead). It also provides scripts for building and styling the source to various output formats.
it: <systemitem role="package">debiandoc-sgml</systemitem> fornisce il DTD Debiandoc SGML, che è comunemente usato per la documentazione di Debian, ma ora è deprecato (al suo posto dovrebbe essere usato <systemitem role="package">docbook-xml</systemitem>). Fornisce anche gli script per applicare stili e creare dai sorgenti vari formati di output.

source: Documentation for the DTD can be found in the <systemitem role="package">debiandoc-sgml-doc</systemitem> package.
it: La documentazione per la DTD può essere trovata nel pacchetto <systemitem role="package">debiandoc-sgml-doc</systemitem>.

source: Contains the public GPG keys of Debian Developers and Maintainers. See <xref linkend="key-maint"/> and the package documentation for more information.
it: Contiene le chiavi pubbliche GPG e PGP degli sviluppatori Debian. Si consulti <xref linkend="key-maint"/> e la documentazione del pacchetto per ulteriori informazioni.

source: <systemitem role="package">debian-el</systemitem>
it: <systemitem role="package">debview</systemitem>

source: <systemitem role="package">debian-el</systemitem> provides an Emacs mode for viewing Debian binary packages. This lets you examine a package without unpacking it.
it: <systemitem role="package">debview</systemitem> fornisce una modalità Emacs per la visualizzazione dei pacchetti binari Debian. Questo consente di esaminare un pacchetto senza estrarlo.
