Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: The scripts that update the <literal>testing</literal> distribution are run twice each day, right after the installation of the updated packages; these scripts are called <literal>britney</literal>. They generate the <filename>Packages</filename> files for the <literal>testing</literal> distribution, but they do so in an intelligent manner; they try to avoid any inconsistency and to use only non-buggy packages.
it: Gli script che aggiornano la distribuzione <literal>testing</literal> vengono eseguiti due volte al giorno, subito dopo l'installazione dei pacchetti aggiornati; questi script si chiamano <literal>britney</literal>. Essi generano i file <filename>Packages</filename> per la distribuzione <literal>testing</literal>, ma lo fanno in modo intelligente; cercano di evitare qualsiasi incoerenza e di utilizzare solo i pacchetti senza bug.

source: The inclusion of a package from <literal>unstable</literal> is conditional on the following:
it: L'inclusione di un pacchetto da <literal>unstable</literal> è subordinata alle seguenti:

source: The package must have been available in <literal>unstable</literal> for 2, 5 or 10 days, depending on the urgency (high, medium or low). Please note that the urgency is sticky, meaning that the highest urgency uploaded since the previous <literal>testing</literal> transition is taken into account;
it: Il pacchetto deve essere stato disponibile in <literal>unstable</literal> per 2, 5 o 10 giorni, a seconda dell'urgenza (alta, media o bassa). Notare che l'urgenza è appiccicosa, il che significa che viene presa in considerazione la massima urgenza caricata dalla precedente transizione in <literal>testing</literal>;

source: It must not have new release-critical bugs (RC bugs affecting the version available in <literal>unstable</literal>, but not affecting the version in <literal>testing</literal>);
it: Non deve avere nuovi bug critici per il rilascio (bug RC che riguardano la versione disponibile in <literal>unstable</literal>, ma non intaccano la versione in <literal>testing</literal>);

source: It must be available on all architectures on which it has previously been built in <literal>unstable</literal>. <link linkend="dak-ls">dak ls</link> may be of interest to check that information;
it: Deve essere disponibile su tutte le architetture sulle quali è stato precedentemente compilato in <literal>unstable</literal>. <link linkend="dak-ls">dak ls</link> può essere utile per verificare queste informazioni;

source: It must not break any dependency of a package which is already available in <literal>testing</literal>;
it: Non deve rendere diffettosa alcuna dipendenza di un pacchetto che è già disponibile in <literal>testing</literal>;

source: The packages on which it depends must either be available in <literal>testing</literal> or they must be accepted into <literal>testing</literal> at the same time (and they will be if they fulfill all the necessary criteria);
it: I pacchetti da cui dipende devono essere disponibili in <literal>testing</literal> o devono essere accettati in <literal>testing</literal> nello stesso momento (e lo saranno se soddisfano tutti i criteri necessari);

source: The phase of the project. I.e. automatic transitions are turned off during the <emphasis>freeze</emphasis> of the <literal>testing</literal> distribution.
it: La fase del progetto. Cioè transizioni automatiche sono disattivate durante il <emphasis>freeze</emphasis> della distribuzione <literal>testing</literal>.

source: To find out whether a package is progressing into <literal>testing</literal> or not, see the <literal>testing</literal> script output on the <ulink url="&url-testing-maint;">web page of the testing distribution</ulink>, or use the program <command>grep-excuses</command> which is in the <systemitem role="package">devscripts</systemitem> package. This utility can easily be used in a <citerefentry> <refentrytitle>crontab</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> to keep yourself informed of the progression of your packages into <literal>testing</literal>.
it: Per sapere se un pacchetto è in fase di passaggio a <literal>testing</literal> o meno, si consulti il prodotto dello script di <literal>testing</literal> nella <ulink url="&url-testing-maint;">pagina web della distribuzione testing</ulink>, oppure si utilizzi il programma <command>grep-excuses</command>, che è nel pacchetto <systemitem role="package">devscripts</systemitem>. Questa utility può essere facilmente utilizzata in un <citerefentry><refentrytitle>crontab</refentrytitle><manvolnum>5</manvolnum></citerefentry> per tenersi informati sull'avanzamento dei propri pacchetti in <literal>testing</literal>.

source: The <filename>update_excuses</filename> file does not always give the precise reason why the package is refused; you may have to find it on your own by looking for what would break with the inclusion of the package. The <ulink url="&url-testing-maint;">testing web page</ulink> gives some more information about the usual problems which may be causing such troubles.
it: Il file <filename>update_excuses</filename> non sempre dà il motivo preciso per cui il pacchetto è stato rifiutato; potrebbe essere necessario trovarlo da soli, cercando ciò che sarebbe stato reso difettoso dall'inclusione. La <ulink url="&url-testing-maint;">pagina web di testing</ulink> dà qualche informazione in più sulle problematiche comuni che possono causare questi problemi.

source: Sometimes, some packages never enter <literal>testing</literal> because the set of interrelationship is too complicated and cannot be sorted out by the scripts. See below for details.
it: A volte, alcuni pacchetti non entrano mai in <literal>testing</literal>, perché l'insieme di interrelazioni è troppo complicato e non può essere risolto dagli script. Si veda sotto per i dettagli.

source: Some further dependency analysis is shown on <ulink url="https://release.debian.org/migration/"></ulink> — but be warned, this page also shows build dependencies which are not considered by britney.
it: Qualche ulteriore analisi delle dipendenze viene visualizzata su <ulink url="http://release.debian.org/migration/"></ulink>, ma attenzione, questa pagina mostra anche le dipendenze per la compilazione che non sono considerate da britney.

source: Out-of-date
it: Obsoleti

source: For the <literal>testing</literal> migration script, outdated means: There are different versions in <literal>unstable</literal> for the release architectures (except for the architectures in fuckedarches; fuckedarches is a list of architectures that don't keep up (in <filename>update_out.py</filename>), but currently, it's empty). outdated has nothing whatsoever to do with the architectures this package has in <literal>testing</literal>.
it: Per lo script di migrazione di <literal>testing</literal>, obsoleti significare che: ci sono versioni diverse in <literal>unstable</literal> per le architetture di rilascio (ad eccezione per le architetture fuckedarches; fuckedarches è un elenco di architetture che non tengono il passo (in <filename>update_out.py</filename>), ma attualmente, è vuoto). Obsoleto non ha nulla a che fare con le architetture che questo pacchetto ha in <literal>testing</literal>.

source: Consider this example:
it: Si consideri questo esempio:

source: The package is out of date on <literal>alpha</literal> in <literal>unstable</literal>, and will not go to <literal>testing</literal>. Removing the package would not help at all, the package is still out of date on <literal>alpha</literal>, and will not propagate to <literal>testing</literal>.
it: Il pacchetto non è aggiornato in <literal>alpha</literal> in <literal>unstable</literal>, e non andrà in <literal>testing</literal>. La rimozione del pacchetto non aiuterebbe affatto, il pacchetto è ancora obsoleto in <literal>alpha</literal>, e non passerà in <literal>testing</literal>.

source: However, if ftp-master removes a package in <literal>unstable</literal> (here on <literal>arm</literal>):
it: Tuttavia, se l'ftp-master rimuove un pacchetto in <literal>unstable</literal> (qui in <literal>arm</literal>):

source: In this case, the package is up to date on all release architectures in <literal>unstable</literal> (and the extra <literal>hurd-i386</literal> doesn't matter, as it's not a release architecture).
it: In questo caso, il pacchetto è aggiornato su tutte le architetture di rilascio in <literal>unstable</literal> (e quella aggiuntiva <literal>hurd-i386</literal> non importa, considerato che non è un'architettura inclusa nel rilascio).

source: Sometimes, the question is raised if it is possible to allow packages in that are not yet built on all architectures: No. Just plainly no. (Except if you maintain glibc or so.)
it: A volte, la questione che viene sollevata è se è possibile far avanzare pacchetti che non sono ancora stati compialti su tutte le architetture: No. Sempre e comunque no. (Tranne se si mantiene glibc o giù di lì.)

source: Removals from testing
it: Rimozioni da testing

source: Sometimes, a package is removed to allow another package in: This happens only to allow <emphasis>another</emphasis> package to go in if it's ready in every other sense. Suppose e.g. that <literal>a</literal> cannot be installed with the new version of <literal>b</literal>; then <literal>a</literal> may be removed to allow <literal>b</literal> in.
it: A volte, un pacchetto viene rimosso per consentire ad un altro pacchetto di entrare: questo accade solo per permettere ad <emphasis>un altro</emphasis> pacchetto di avanzare se è pronto sotto ogni altro aspetto. Supponiamo ad esempio che <literal>a</literal> non può essere installato con la nuova versione di <literal>b</literal>; allora <literal>a</literal> può essere rimosso per consentire a <literal>b</literal> di entrare.

source: Of course, there is another reason to remove a package from <literal>testing</literal>: It's just too buggy (and having a single RC-bug is enough to be in this state).
it: Naturalmente, c'è un altro motivo per rimuovere un pacchetto da <literal>testing</literal>: è troppo pieno di bug (e avere un unico bug RC è sufficiente per essere in questo stato).

source: Furthermore, if a package has been removed from <literal>unstable</literal>, and no package in <literal>testing</literal> depends on it any more, then it will automatically be removed.
it: Inoltre, se un pacchetto è stato rimosso da <literal>unstable</literal>, e nessun pacchetto in <literal>testing</literal> dipende più da esso, allora sarà automaticamente rimosso.

source: Circular dependencies
it: Dipendenze circolari

source: A situation which is not handled very well by britney is if package <literal>a</literal> depends on the new version of package <literal>b</literal>, and vice versa.
it: Una situazione che non è gestita molto bene da britney è se un pacchetto <literal>a</literal> dipende dalla nuova versione del pacchetto <literal>b</literal>, e viceversa.

source: An example of this is:
it: Un esempio di questo è:

source: Neither package <literal>a</literal> nor package <literal>b</literal> is considered for update.
it: Né il pacchetto <literal>a</literal>, né il pacchetto <literal>b</literal> sono considerati per l'aggiornamento.

source: Currently, this requires some manual hinting from the release team. Please contact them by sending mail to &email-debian-release; if this happens to one of your packages.
it: Attualmente, questo richiede qualche suggerimento manuale al team di rilascio. contattarli con l'invio di una email a &email-debian-release; se ciò dovesse accadere ad uno dei propri pacchetti.

source: Influence of package in testing
it: Influenza del pacchetto in testing

source: Generally, there is nothing that the status of a package in <literal>testing</literal> means for transition of the next version from <literal>unstable</literal> to <literal>testing</literal>, with two exceptions: If the RC-bugginess of the package goes down, it may go in even if it is still RC-buggy. The second exception is if the version of the package in <literal>testing</literal> is out of sync on the different arches: Then any arch might just upgrade to the version of the source package; however, this can happen only if the package was previously forced through, the arch is in fuckedarches, or there was no binary package of that arch present in <literal>unstable</literal> at all during the <literal>testing</literal> migration.
it: In generale, non c'è nulla nello stato di un pacchetto in <literal>testing</literal> che influenzi il passaggio della prossima versione da <literal>unstable</literal> a <literal>testing</literal>, con due eccezioni: se il numero di bug RC del pacchetto diminuisce, il pacchetto potrebbe entrare anche se ha ancora bug RC. La seconda eccezione è se la versione del pacchetto in <literal>testing</literal> è fuori sincrono sulle diverse architetture: allora ogni architettura potrebbe semplicemente eseguire l'aggiornamento alla versione dei sorgenti del pacchetto; ma questo può avvenire solo se il pacchetto è stato precedentemente forzato, se l'architettura è in fuckedarches, o se non c'era nessun pacchetto binario di quell'architettura presente in <literal>unstable</literal> durante la migrazione su <literal>testing</literal>.

source: In summary this means: The only influence that a package being in <literal>testing</literal> has on a new version of the same package is that the new version might go in easier.
it: In sintesi questo significa: l'unica influenza che un pacchetto presente in <literal>testing</literal> ha su una nuova versione dello stesso pacchetto è che la nuova versione potrebbe entrarci più facilmente.

source: Details
it: Dettagli

source: If you are interested in details, this is how britney works:
it: Se si è interessati a maggiori dettagli, cosi è come funziona britney:

source: The packages are looked at to determine whether they are valid candidates. This gives the update excuses. The most common reasons why a package is not considered are too young, RC-bugginess, and out of date on some arches. For this part of britney, the release managers have hammers of various sizes, called hints (see below), to force britney to consider a package.
it: I pacchetti sono osservati per determinare se essi sono validi candidati. Da questo derivano le motivazioni per gli aggiornamenti. Le ragioni più comuni per cui un pacchetto non viene considerato essere troppo giovane, mancanza di bug RC, e obsoleto su alcune architetture. Per questa parte di britney, i gestori dei rilasci posseggono martelli di varie dimensioni, chiamati suggerimenti (si consulti sotto), per forzare britney a considerare un pacchetto.

source: Now, the more complex part happens: Britney tries to update <literal>testing</literal> with the valid candidates. For that, britney tries to add each valid candidate to the testing distribution. If the number of uninstallable packages in <literal>testing</literal> doesn't increase, the package is accepted. From that point on, the accepted package is considered to be part of <literal>testing</literal>, such that all subsequent installability tests include this package. Hints from the release team are processed before or after this main run, depending on the exact type.
it: Ora arriva la parte più complessa: britney tenta di aggiornare <literal>testing</literal> con i candidati validi. Per questo, britney cerca di aggiungere ogni candidato valido per la distribuzione testing. Se il numero di pacchetti non installabili in <literal>testing</literal> non aumenta, il pacchetto viene accettato. Da quel momento in poi, il pacchetto viene considerato parte di <literal>testing</literal>, in modo che tutti i test di installabilità successivi includeranno questo pacchetto. Suggerimenti da parte del team di rilascio vengono elaborati prima o dopo questo ciclo principale, a seconda del tipo esatto.

source: If you want to see more details, you can look it up on <ulink url="https://&ftp-master-host;/testing/update_output/"></ulink>.
it: Se si vuole avere maggiori dettagli, è possibile cercare su <ulink url="http://&ftp-master-host;/testing/update_output/"></ulink>.

source: The hints are available via <ulink url="https://&ftp-master-host;/testing/hints/"></ulink>, where you can find the <ulink url="https://&ftp-master-host;/testing/hints/README">description</ulink> as well. With the hints, the Debian Release team can block or unblock packages, ease or force packages into <literal>testing</literal>, remove packages from <literal>testing</literal>, approve uploads to <link linkend="t-p-u">testing-proposed-updates</link> or override the urgency.
it: I suggerimenti sono disponibili tramite <ulink url="http://&ftp-master-host;/testing/hints/"></ulink>, dove è possibile trovare anche la <ulink url="http://&ftp-master-host;/testing/hints/README">descrizione</ulink>. Con i suggerimenti, il team di rilascio di Debian può bloccare o sbloccare i pacchetti, spingere o forzare pacchetti in <literal>testing</literal>, rimuovere pacchetti da <literal>testing</literal>, approvare caricamenti al <link linkend="t-p-u">testing-proposed-updates</link> o sovrascrivere l'urgenza.

source: Direct updates to testing
it: Aggiornamenti diretti di testing

source: The <literal>testing</literal> distribution is fed with packages from <literal>unstable</literal> according to the rules explained above. However, in some cases, it is necessary to upload packages built only for <literal>testing</literal>. For that, you may want to upload to <literal>testing-proposed-updates</literal>.
it: La distribuzione <literal>testing</literal> è alimentata con i pacchetti da <literal>unstable</literal> in base alle regole sopra esposte. Tuttavia, in alcuni casi, è necessario caricare i pacchetti compilati solo per <literal>testing</literal>. Per questo, è meglio fare il caricamento in <literal>testing-proposed-updates</literal>.

source: Keep in mind that packages uploaded there are not automatically processed, they have to go through the hands of the release manager. So you'd better have a good reason to upload there. In order to know what a good reason is in the release managers' eyes, you should read the instructions that they regularly give on &email-debian-devel-announce;.
it: Si tenga a mente che i pacchetti che sono inviati lì non vengono elaborati automaticamente, devono passare attraverso le mani del gestore del rilascio. Quindi è meglio avere un buon motivo per caricarli lì. Per sapere qual è un buon motivo agli occhi del gestore del rilascio, si consiglia di leggere le indicazioni che sono fornite regolarmente su &email-debian-devel-announce;.

source: You should not upload to <literal>testing-proposed-updates</literal> when you can update your packages through <literal>unstable</literal>. If you can't (for example because you have a newer development version in <literal>unstable</literal>), you may use this facility, but it is recommended that you ask for authorization from the release manager first. Even if a package is frozen, updates through <literal>unstable</literal> are possible, if the upload via <literal>unstable</literal> does not pull in any new dependencies.
it: Si consiglia di non fare il caricamento su <literal>testing-proposed-updates</literal> quando è possibile aggiornare i pacchetti attraverso <literal>unstable</literal>. Se non è possibile (ad esempio perché si dispone di una versione di sviluppo più recente in <literal>unstable</literal>), è possibile utilizzare questo strumento, ma si consiglia di chiedere prima l'autorizzazione al gestore del rilascio. Anche se un pacchetto è congelato, sono possibili aggiornamenti tramite <literal>unstable</literal>, se il caricamento tramite <literal>unstable</literal> non aggiunge nuove dipendenze.

source: Version numbers are usually selected by appending <literal>+deb</literal><replaceable>X</replaceable><literal>uY</literal>, where <replaceable>X</replaceable> is the major release number of Debian and <replaceable>Y</replaceable> is a counter starting at <literal>1</literal>. e.g. <literal>1:2.4.3-4+deb&version-stable;u1</literal>.
it: I numeri della versione sono solitamente individuati concatenando <literal>+deb</literal><replaceable>X</replaceable><literal>uY</literal>, dove <replaceable>X</replaceable> è il numero maggiore della release Debian e <replaceable>Y</replaceable> è un contatore che inizia da <literal>1</literal>. e.s.<literal>1:2.4.3-4+deb&version-stable;u1</literal>.

source: Please make sure you didn't miss any of these items in your upload:
it: Assicurarsi di non essersi dimenticata nessuna di queste cose nel proprio caricamento:

source: Make sure that your package really needs to go through <literal>testing-proposed-updates</literal>, and can't go through <literal>unstable</literal>;
it: Assicurarsi che il proprio pacchetto abbia davvero bisogno di passare attraverso <literal>testing-proposed-updates</literal>, e non possa passare attraverso <literal>unstable</literal>;

source: Make sure that you included only the minimal amount of changes;
it: Assicurarsi di includere solo la quantità minima di modifiche;

source: Make sure that you included an appropriate explanation in the changelog;
it: Assicurarsi di aver incluso una spiegazione adeguata nel changelog;

source: Make sure that you've written the testing <link linkend="codenames">code name</link> (e.g. <literal>&codename-testing;</literal>) into your target distribution;
it: Assicurarsi di aver scritto <literal>testing</literal> o <literal>testing-proposed-updates</literal> come distribuzione di destinazione;

source: Make sure that you've built and tested your package in <literal>testing</literal>, not in <literal>unstable</literal>;
it: Assicurarsi di aver compilato e testato il proprio pacchetto in <literal>testing</literal>, non in <literal>unstable</literal>;

source: Make sure that your version number is higher than the version in <literal>testing</literal> and <literal>testing-proposed-updates</literal>, and lower than in <literal>unstable</literal>;
it: Assicurarsi che il numero di versione sia più alto rispetto alla versione in <literal>testing</literal> e in <literal>testing-proposed-updates</literal>, e inferiore a quello in <literal>unstable</literal>;

source: After uploading and successful build on all platforms, contact the release team at &email-debian-release; and ask them to approve your upload.
it: Dopo aver effettuato il caricamento e dopo che la compilazione è riuscita su tutte le piattaforme, si contatti il team di rilascio su &email-debian-release; chiedendogli di approvare il caricamento.

source: Frequently asked questions
it: Domande frequenti

source: What are release-critical bugs, and how do they get counted?
it: Quali sono i bug critici per il rilascio e come vengono contati?

source: All bugs of some higher severities are by default considered release-critical; currently, these are <literal>critical</literal>, <literal>grave</literal> and <literal>serious</literal> bugs.
it: Tutti i bug di alcuni livelli più elevati di gravità sono di base considerati release-critical; attualmente, questi sono i bug <literal>critical</literal>, <literal>grave</literal> e <literal>serious</literal>.
