Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: Maintainer scripts include the files <filename>debian/postinst</filename>, <filename>debian/preinst</filename>, <filename>debian/prerm</filename> and <filename>debian/postrm</filename>. These scripts take care of any package installation or deinstallation setup which isn't handled merely by the creation or removal of files and directories. The following instructions supplement the <ulink url="&url-debian-policy;">Debian Policy</ulink>.
it: Gli script del maintainer includono i file <filename>debian/postinst</filename>, <filename>debian/preinst</filename>, <filename>debian/prerm</filename> e <filename>debian/postrm</filename>. Questi script si prendono cura di ogni configurazione di installazione o disinstallazione del pacchetto che non è gestito esclusivamente dalla creazione o dalla rimozione di file e cartelle. Le seguenti istruzioni completano la <ulink url="&url-debian-policy;">Debian Policy</ulink>.

source: Maintainer scripts must be idempotent. That means that you need to make sure nothing bad will happen if the script is called twice where it would usually be called once.
it: Gli script del maintainer devono essere idempotenti. Ciò significa che è necessario assicurarsi che nulla di male accadrà se lo script dovesse essere invocato due volte dove di solito viene lanciato una volta sola.

source: Standard input and output may be redirected (e.g. into pipes) for logging purposes, so don't rely on them being a tty.
it: Gli standard input e output possono essere reindirizzati (ad esempio nelle pipe) per finalità di logging, quindi non utilizzateli come una tty.

source: All prompting or interactive configuration should be kept to a minimum. When it is necessary, you should use the <systemitem role="package">debconf</systemitem> package for the interface. Remember that prompting in any case can only be in the <literal>configure</literal> stage of the <filename>postinst</filename> script.
it: Tutte le configurazioni suggerite o interattive devono essere ridotte al minimo. Quando è necessario, si dovrebbe utilizzare il pacchetto <systemitem role="package">debconf</systemitem> per l'interfaccia. Ricordare che il suggerimento in ogni caso può esserci solo nella fase <literal>configure</literal> dello script <filename>postinst</filename>.

source: Keep the maintainer scripts as simple as possible. We suggest you use pure POSIX shell scripts. Remember, if you do need any bash features, the maintainer script must have a bash shebang line. POSIX shell or Bash are preferred to Perl, since they enable <systemitem role="package">debhelper</systemitem> to easily add bits to the scripts.
it: Mantenere gli script del maintainer più semplici possibile. Si consiglia di utilizzare puri script POSIX. Ricordate, se si ha bisogno di tutte le funzioni di bash, lo script del maintainer deve avere una linea shebang per bash. La shell POSIX o Bash sono preferite a quella Perl, poiché permettono a <systemitem role="package">debhelper</systemitem> di aggiungere facilmente bit agli script.

source: If you change your maintainer scripts, be sure to test package removal, double installation, and purging. Be sure that a purged package is completely gone, that is, it must remove any files created, directly or indirectly, in any maintainer script.
it: Se si modificano gli script del maintainer, assicurarsi di testare la rimozione del pacchetto, la doppia installazione e l'epurazione. Assicurarsi che un pacchetto epurato sia completamente sparito, ovvero, deve rimuovere tutti i file creati, direttamente o indirettamente, in tutti gli script del maintainer.

source: If you need to check for the existence of a command, you should use something like
it: Se è necessario verificare l'esistenza di un comando, si dovrebbe usare qualcosa simile a

source: If you don't wish to hard-code the path of a command in your maintainer script, the following POSIX-compliant shell function may help:
it: Se non si desidera codificare il percorso di un comando nello script del maintainer, la seguente funzione shell che soddisfa POSIX potrebbe essere d'aiuto:

source: You can use this function to search <varname>$PATH</varname> for a command name, passed as an argument. It returns true (zero) if the command was found, and false if not. This is really the most portable way, since <literal>command -v</literal>, <command>type</command>, and <command>which</command> are not POSIX.
it: Si può utilizzare questa funzione per cercare il <varname>$PATH</varname> di un nome di un comando, passato come argomento. Restituisce true (zero) se il comando è stato trovato e false in caso contrario. Questo è davvero il modo più portatile, dal momento che <literal>command -v</literal>, <command>type</command> e <command>which</command> non sono POSIX.

source: While <command>which</command> is an acceptable alternative, since it is from the required <systemitem role="package">debianutils</systemitem> package, it's not on the root partition. That is, it's in <filename>/usr/bin</filename> rather than <filename>/bin</filename>, so one can't use it in scripts which are run before the <filename>/usr</filename> partition is mounted. Most scripts won't have this problem, though.
it: Mentre <command>which</command> è una alternativa accettabile, dal momento che fa parte del richiesto pacchetto <systemitem role="package">debianutils</systemitem>, non è nella partizione di root. Ovvero, è in <filename>/usr/bin</filename>, piuttosto che <filename>/bin</filename>, quindi non può essere utilizzato in script che vengono eseguiti prima che la partizione <filename>/usr</filename> sia montata. La maggior parte degli script non avranno questo problema, però.

source: Configuration management with <systemitem role="package">debconf</systemitem>
it: Gestione della configurazione con <systemitem role="package">debconf</systemitem>

source: <systemitem role="package">Debconf</systemitem> is a configuration management system which can be used by all the various packaging scripts (<filename>postinst</filename> mainly) to request feedback from the user concerning how to configure the package. Direct user interactions must now be avoided in favor of <systemitem role="package">debconf</systemitem> interaction. This will enable non-interactive installations in the future.
it: <systemitem role="package">Debconf</systemitem> è un sistema di gestione della configurazione che può essere utilizzato da tutti i vari script per la pacchettizzazione (principalmente <filename>postinst</filename>) per richiedere indicazioni all'utente riguardo a come configurare il pacchetto. Interazioni dirette degli utenti ora devono essere evitate a favore dell'interazione con <systemitem role="package">debconf</systemitem>. Ciò consentirà installazioni non interattive in futuro.

source: Debconf is a great tool but it is often poorly used. Many common mistakes are listed in the <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> man page. It is something that you must read if you decide to use debconf. Also, we document some best practices here.
it: Debconf è un grande strumento, ma è spesso mal utilizzato. Molti errori comuni sono elencati nella pagina man di <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry>. È qualcosa che si deve leggere se si decide di usare debconf. Inoltre, indichiamo qui alcune buone pratiche.

source: These guidelines include some writing style and typography recommendations, general considerations about debconf usage as well as more specific recommendations for some parts of the distribution (the installation system for instance).
it: Queste linee guida comprendono un certo stile di scrittura e di raccomandazioni tipografiche, considerazioni generali sull'uso di debconf e raccomandazioni più specifiche per alcune parti della distribuzione (il sistema di installazione, per esempio).

source: Do not abuse debconf
it: Non abusare di debconf

source: Since debconf appeared in Debian, it has been widely abused and several criticisms received by the Debian distribution come from debconf abuse with the need of answering a wide bunch of questions before getting any little thing installed.
it: Da quando debconf è apparso in Debian, è stato ampiamente abusato e diverse critiche ricevute dalla distribuzione Debian provengono dall'abuso di debconf con la necessità di rispondere ad una vasta serie di domande prima di installare ogni piccola cosa.

source: Keep usage notes to what they belong: the <filename>NEWS.Debian</filename>, or <filename>README.Debian</filename> file. Only use notes for important notes which may directly affect the package usability. Remember that notes will always block the install until confirmed or bother the user by email.
it: Riservare le note d'uso a ciò cui appartengono: al file <filename>NEWS.Debian</filename>, o <filename>README.Debian</filename>. Le si utilizzi solamente per le note importanti che possono influenzare direttamente l'usabilità del pacchetto. Ricordare che le note bloccheranno sempre l'installazione fino a quando saranno confermate o abbiano disturbato l'utente tramite email.

source: Carefully choose the questions priorities in maintainer scripts. See <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> for details about priorities. Most questions should use medium and low priorities.
it: Scegliere con cura le priorità delle domande negli script del maintainer. Si consulti <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> per i dettagli sulla priorità. La maggior parte delle domande dovrebbero usare le priorità media e bassa.

source: General recommendations for authors and translators
it: Raccomandazioni generali per autori e traduttori

source: Write correct English
it: Scrivere inglese corretto

source: Most Debian package maintainers are not native English speakers. So, writing properly phrased templates may not be easy for them.
it: La maggior parte dei maintainer dei pacchetti Debian non sono di madrelingua inglese. Quindi, la scrittura di modelli correttamente formulati, può non essere facile per loro.

source: Please use (and abuse) &email-debian-l10n-english; mailing list. Have your templates proofread.
it: utilizzare (e abusare) della mailing list &email-debian-l10n-english;. Avrete le vostre bozze di modelli corrette.

source: Badly written templates give a poor image of your package, of your work... or even of Debian itself.
it: I modelli scritti male danno una cattiva immagine del pacchetto, del proprio lavoro... o anche di Debian stesso.

source: Avoid technical jargon as much as possible. If some terms sound common to you, they may be impossible to understand for others. If you cannot avoid them, try to explain them (use the extended description). When doing so, try to balance between verbosity and simplicity.
it: Evitare il gergo tecnico il più possibile. Se alcuni termini suonano comuni a voi, possono essere impossibili da comprendere per gli altri. Se non si possono evitare, cercare di spiegarli (utilizzare la descrizione estesa). Nel fare ciò, cercare di bilanciarsi tra verbosità e semplicità.

source: Be kind to translators
it: Sii gentile con i traduttori

source: Debconf templates may be translated. Debconf, along with its sister package <command>po-debconf</command> offers a simple framework for getting templates translated by translation teams or even individuals.
it: I modelli debconf possono essere tradotti. Debconf, insieme al suo pacchetto fratello <command>po-debconf</command> offre un framework semplice per ottenere i modelli tradotti dai team di traduzione o anche dai singoli individui.

source: Please use gettext-based templates. Install <systemitem role="package">po-debconf</systemitem> on your development system and read its documentation (<command>man po-debconf</command> is a good start).
it: Utilizzare i modelli basati su gettext. Installare <systemitem role="package">po-debconf</systemitem> sul proprio sistema di sviluppo e leggete la sua documentazione (<command>man po-debconf</command> è un buon inizio).

source: Avoid changing templates too often. Changing templates text induces more work to translators which will get their translation fuzzied. A fuzzy translation is a string for which the original changed since it was translated, therefore requiring some update by a translator to be usable. When changes are small enough, the original translation is kept in PO files but marked as <literal>fuzzy</literal>.
it: Evitare di modificare i modelli troppo spesso. Cambiare i modelli di testo produce più lavoro per i traduttori che avranno la loro traduzione confusa. Una traduzione confusa è una frase per la quale l'originale sia stata cambiata da quando è stata tradotta, quindi per essere utilizzabile richiede alcuni aggiornamenti da parte di un traduttore. Quando i cambiamenti sono abbastanza piccoli, la traduzione originale è conservata nel file PO, ma contrassegnata come <literal>fuzzy</literal>.

source: If you plan to do changes to your original templates, please use the notification system provided with the <systemitem role="package">po-debconf</systemitem> package, namely the <command>podebconf-report-po</command>, to contact translators. Most active translators are very responsive and getting their work included along with your modified templates will save you additional uploads. If you use gettext-based templates, the translator's name and e-mail addresses are mentioned in the PO files headers and will be used by <command>podebconf-report-po</command>.
it: Se si ha intenzione di modificare i modelli originali, utilizzare il sistema di notifica fornito con il pacchetto <systemitem role="package">po-debconf</systemitem>, vale a dire il <command>podebconf-report-po</command>, per contattare i traduttori. I Traduttori più attivi sono molto reattivi e ottenere il loro lavoro incluso insieme con i vostri modelli modificati vi risparmierà caricamenti aggiuntivi. Se si utilizzano modelli basati su gettext, il nome del traduttore e gli indirizzi di posta elettronica sono menzionati negli header dei file PO e saranno utilizzati da <command>podebconf-report-po</command>.

source: A recommended use of that utility is:
it: Un uso consigliato di ciò che questa utility è:

source: This command will first synchronize the PO and POT files in <filename>debian/po</filename> with the templates files listed in <filename>debian/po/POTFILES.in</filename>. Then, it will send a call for new translations, in the &email-debian-i18n; mailing list. Finally, it will also send a call for translation updates to the language team (mentioned in the <literal>Language-Team</literal> field of each PO file) as well as the last translator (mentioned in <literal>Last-translator</literal>).
it: Questo comando innanzitutto sincronizzerà i files PO e POT in <filename>debian/po</filename> con i file dei modelli elencati in <filename>debian/po/POTFILES.in</filename>. Poi, invierà una richiesta di nuove traduzioni, nella mailing list &email-debian-i18n;. Infine, invierà una richiesta per aggiornare la traduzione sia al team per il supporto della lingua (menzionato nel campo <literal>Language-Team</literal> di ogni file PO), sia all'ultimo traduttore (menzionato nel campo <literal>Last-translator</literal>).

source: Giving a deadline to translators is always appreciated, so that they can organize their work. Please remember that some translation teams have a formalized translate/review process and a delay lower than 10 days is considered as unreasonable. A shorter delay puts too much pressure on translation teams and should be kept for very minor changes.
it: Dare una scadenza ai traduttori è sempre apprezzato, in modo tale che possano organizzare il loro lavoro. Ricordare che alcuni gruppi di traduzione hanno un processo formalizzato di traduzione/revisione e un ritardo inferiore a 10 giorni è considerato irragionevole. Un ritardo più breve mette troppa pressione sul team di traduzione e dovrebbe essere utilizzato per modifiche di minore entità.

source: If in doubt, you may also contact the translation team for a given language (debian-l10n-xxxxx@&lists-host;), or the &email-debian-i18n; mailing list.
it: In caso di dubbio, si può anche contattare il team di traduzione per una determinata lingua (debian-l10n-xxxxx@&lists-host;), o la mailing list &email-debian-i18n;.

source: Unfuzzy complete translations when correcting typos and spelling
it: Ordinare intere traduzioni quando si correggono errori di battitura e di ortografia

source: When the text of a debconf template is corrected and you are <emphasis role="strong">sure</emphasis> that the change does <emphasis role="strong">not</emphasis> affect translations, please be kind to translators and <emphasis>unfuzzy</emphasis> their translations.
it: Quando il testo di un modello debconf è corretto e si è <emphasis role="strong">sicuri</emphasis> che la modifica <emphasis role="strong">non</emphasis> influenzi le traduzioni, si sia gentili con i traduttori e <emphasis>sistemare</emphasis> le loro traduzioni.

source: If you don't do so, the whole template will not be translated as long as a translator will send you an update.
it: Se non si fa così, l'intero modello non verrà tradotto fino a quando un traduttore invierà un aggiornamento.

source: To <emphasis>unfuzzy</emphasis> translations, you can use <command>msguntypot</command> (part of the <systemitem role="package">po4a</systemitem> package).
it: Per <emphasis>sistemare</emphasis> le traduzioni, è possibile utilizzare <command>msguntypot</command> (parte del pacchetto <systemitem role="package">po4a</systemitem>).

source: Regenerate the POT and PO files.
it: Rigenerare i file POT e PO.

source: Make a copy of the POT file.
it: Creare una copia del file POT.

source: Make a copy of all the PO files.
it: Fare una copia di tutti i files PO.

source: Change the debconf template files to fix the typos.
it: Modificare i file dei modelli di debconf per correggere errori di battitura.

source: Regenerate the POT and PO files (again).
it: Rigenerare i file POT e PO (di nuovo).

source: At this point, the typo fix fuzzied all the translations, and this unfortunate change is the only one between the PO files of your main directory and the one from the fridge. Here is how to solve this.
it: A questo punto, la correzione dell'errore di battitura ha confuso tutte le traduzioni e questo spiacevole cambiamento è l'unico tra i file PO della vostra cartella principale e quella in frigo. Ecco come risolvere questa situazione.

source: Discard fuzzy translation, restore the ones from the fridge.
it: Scartare la traduzione disordinata, ripristinare quella proveniente dal frigo.

source: Manually merge the PO files with the new POT file, but taking the useless fuzzy into account.
it: Unire manualmente i files PO con il nuovo file POT, ma prendendo nell'account l'inutile disordine.

source: Clean up.
it: Pulizia.

source: Do not make assumptions about interfaces
it: Non fare ipotesi sulle interfacce

source: Templates text should not make reference to widgets belonging to some debconf interfaces. Sentences like <emphasis>If you answer Yes...</emphasis> have no meaning for users of graphical interfaces which use checkboxes for boolean questions.
it: I modelli di testo non dovrebbero fare riferimento ai widget appartenenti ad alcune interfacce di debconf. Frasi come <emphasis>Se rispondi SI...</emphasis> non hanno alcun significato per gli utenti di interfacce grafiche che utilizzano checkbox per le domande booleane.

source: String templates should also avoid mentioning the default values in their description. First, because this is redundant with the values seen by the users. Also, because these default values may be different from the maintainer choices (for instance, when the debconf database was preseeded).
it: I modelli di frasi dovrebbero anche evitare di menzionare i valori predefiniti nella loro descrizione. Primo, perché questo è ridondante con i valori visualizzati dagli utenti. Inoltre, perché questi valori predefiniti possono essere diversi dalle scelte del maintainer (per esempio, quando il database debconf è stato preconfigurato).

source: More generally speaking, try to avoid referring to user actions. Just give facts.
it: Più in generale, cercare di evitare di riferirsi alle azioni dell'utente. Basta indicare i fatti.

source: Do not use first person
it: Non utilizzare la prima persona

source: You should avoid the use of first person (<emphasis>I will do this...</emphasis> or <emphasis>We recommend...</emphasis>). The computer is not a person and the Debconf templates do not speak for the Debian developers. You should use neutral construction. Those of you who already wrote scientific publications, just write your templates like you would write a scientific paper. However, try using active voice if still possible, like <emphasis>Enable this if ...</emphasis> instead of <emphasis>This can be enabled if...</emphasis>.
it: Si dovrebbe evitare l'uso della prima persona (<emphasis>Farò questo...</emphasis> o <emphasis>Consigliamo...</emphasis>). Il computer non è una persona ed i modelli debconf non parlano a nome degli sviluppatori Debian. Si dovrebbe usare la costruzione impersonale. Per coloro di voi che già hanno scritto pubblicazioni scientifiche, basta scrivere i vostri modelli come quando si scrive un articolo scientifico. Tuttavia, provare a utilizzare la voce attiva, se ancora possibile, come <emphasis>Abilitate questo se...</emphasis>, invece di <emphasis>Questo può essere attivata se... </emphasis>.

source: Be gender neutral
it: Usare il genere neutro

source: The world is made of men and women. Please use gender-neutral constructions in your writing.
it: Il mondo è fatto di uomini e donne. Utilizzare le costruzioni di genere neutro nelle vostre scritture.

source: Templates fields definition
it: Definizione dei campi dei modelli

source: This part gives some information which is mostly taken from the <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> manual page.
it: Questa parte fornisce alcune informazioni che sono per lo più prese dal manuale <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry>.

source: Type
it: Tipo

source: string
it: stringa

source: Results in a free-form input field that the user can type any string into.
it: Risultati in un campo di input nel quale l'utente può digitare qualsiasi frase.

source: Prompts the user for a password. Use this with caution; be aware that the password the user enters will be written to debconf's database. You should probably clean that value out of the database as soon as is possible.
it: Richiede all'utente una password. La si usi con cautela; si sia consapevoli del fatto che la password che l'utente inserisce sarà scritta nel database di debconf. Si dovrebbe cancellare quel valore fuori dal database appena è possibile.

source: boolean
it: booleano

source: A true/false choice. Remember: true/false, <emphasis role="strong">not yes/no</emphasis>...
it: Una scelta vero/falso. Ricordare: vero/falso, <emphasis role="strong">non si/no</emphasis>...

source: select
it: seleziona

source: A choice between one of a number of values. The choices must be specified in a field named 'Choices'. Separate the possible values with commas and spaces, like this: <literal>Choices: yes, no, maybe</literal>.
it: Una scelta tra una serie di valori. Le scelte devono essere specificate in un campo denominato «Choices». Separare i possibili valori con le virgole e gli spazi, in questo modo: <literal>Scelte: sì, no, forse</literal>.
