Repository: pierangelo/traduzioni
Catalog: Debian/DeveloperGuide/*.po
Languages: it

source: You may wish to use BTS usertags when submitting bugs across a number of packages. Usertags are similar to normal tags such as 'patch' and 'wishlist' but differ in that they are user-defined and occupy a namespace that is unique to a particular user. This allows multiple sets of developers to 'usertag' the same bug in different ways without conflicting.
it: Si potrebbe voler utilizzare le usertag BTS al momento di presentare i bug per un certo numero di pacchetti. Le usertag sono simili alle normali tag come «patch» e «wishlist», ma differiscono nel senso che sono definite dall'utente e occupano uno spazio dei nomi univoco per un particolare utente. Questo consente a più insiemi di sviluppatori di «usertaggare» lo stesso bug in diversi modi senza conflitto.

source: To add usertags when filing bugs, specify the <literal>User</literal> and <literal>Usertags</literal> pseudo-headers:
it: Per aggiungere usertag al momento della presentazione di bug, specificare gli pseudo-header <literal>User</literal> e <literal>Usertags</literal>:

source: Note that tags are seperated by spaces and cannot contain underscores. If you are filing bugs for a particular group or team it is recommended that you set the <literal>User</literal> to an appropriate mailing list after describing your intention there.
it: Si noti che i tag sono separati da spazi e non possono contenere caratteri di sottolineatura. Se si sta caricando bug per un particolare gruppo o team è consigliato che si imposti il <literal>User</literal> ad una mailing list appropriata dopo aver descritto li i propri intenti.

source: To view bugs tagged with a specific usertag, visit <literal>https://&bugs-host;/cgi-bin/pkgreport.cgi?users=<replaceable>email-addr</replaceable>&amp;tag=<replaceable>tag-name</replaceable></literal>.
it: Per visualizzare bug etichettati con uno specifico usertag, visitare la pagina <literal>http://&bugs-host;/cgi-bin/pkgreport.cgi?users=<replaceable>email-addr</replaceable>&amp;tag=<replaceable>tag-name</replaceable></literal>.

source: Quality Assurance effort
it: Costo della Quality Assurance

source: Daily work
it: Lavoro giornaliero

source: Even though there is a dedicated group of people for Quality Assurance, QA duties are not reserved solely for them. You can participate in this effort by keeping your packages as bug-free as possible, and as lintian-clean (see <xref linkend="lintian"/>) as possible. If you do not find that possible, then you should consider orphaning some of your packages (see <xref linkend="orphaning"/>). Alternatively, you may ask the help of other people in order to catch up with the backlog of bugs that you have (you can ask for help on &email-debian-qa; or &email-debian-devel;). At the same time, you can look for co-maintainers (see <xref linkend="collaborative-maint"/>).
it: Anche se c'è un gruppo dedicato di persone per la Quality Assurance, le mansioni QA non sono riservate esclusivamente a loro. È possibile partecipare a questo sforzo, mantenendo i vostri pacchetti il più possibile privi di bug e il più possibile lintian-clean (si consulti <xref linkend="lintian"/>). Se non si riesce a farlo, allora si dovrebbe prendere in considerazione di rendere orfani alcuni dei vostri pacchetti (si consulti <xref linkend="orphaning"/>). In alternativa, si può chiedere l'aiuto di altre persone al fine di recuperare il ritardo con i bug arretrati che si hanno (si può chiedere aiuto su &email-debian-qa; o &email-debian-devel;). Allo stesso tempo, si può cercare un co-maintainer (si consulti <xref linkend="collaborative-maint"/>).

source: From time to time the QA group organizes bug squashing parties to get rid of as many problems as possible. They are announced on &email-debian-devel-announce; and the announcement explains which area will be the focus of the party: usually they focus on release critical bugs but it may happen that they decide to help finish a major upgrade (like a new <command>perl</command> version which requires recompilation of all the binary modules).
it: Di volta in volta il gruppo QA organizza feste di bug squashing in modo da sbarazzarsi di quanti più problemi possibili. Sono annunciati su &email-debian-devel-announce; e l'annuncio spiega quale area sarà al centro della festa: di solito si concentrano sui bug critici per il rilascio, ma può accadere che decidano di aiutare a terminare un importante aggiornamento (come una nuova versione <command>perl</command> che richiede la ricompilazione di tutti i moduli binari).

source: The rules for non-maintainer uploads differ during the parties because the announcement of the party is considered prior notice for NMU. If you have packages that may be affected by the party (because they have release critical bugs for example), you should send an update to each of the corresponding bug to explain their current status and what you expect from the party. If you don't want an NMU, or if you're only interested in a patch, or if you will deal yourself with the bug, please explain that in the BTS.
it: Le regole per il caricamento di non-maintainer cambiano durante le feste perché l'annuncio della festa è considerata prioritaria per NMU. Se si dispone di pacchetti che possono essere influenzati dalla festa (perché hanno rilasciato bug critici per esempio), è necessario inviare un aggiornamento per ciascun bug corrispondente per spiegare il loro stato attuale e cosa ci si apetti dalla festa. Se non si vuole un NMU, o se si è solo interessati ad una patch, o se si vuole fare da soli con il bug, spiegarlo nel BTS.

source: People participating in the party have special rules for NMU, they can NMU without prior notice if they upload their NMU to DELAYED/3-day at least. All other NMU rules apply as usually; they should send the patch of the NMU to the BTS (to one of the open bugs fixed by the NMU, or to a new bug, tagged fixed). They should also respect any particular wishes of the maintainer.
it: Le persone che partecipano alla festa hanno regole speciali per un NMU, possono fare un NMU senza preavviso se caricano i loro NMU su DELAYED/3-giorni almeno. Tutte le altre regole NMU si applicano come di solito; dovrebbero inviare la patch del NMU al BTS (a uno dei bug aperti fissati dal NMU, o di un nuovo bug, etichettato fisso). Dovrebbero anche rispettare particolari desideri del maintainer.

source: If you don't feel confident about doing an NMU, just send a patch to the BTS. It's far better than a broken NMU.
it: Se non ci si sente sicuri di fare un NMU, basta inviare una patch al BTS. È molto meglio di un NMU non funzionante.

source: Contacting other maintainers
it: Come contattare gli altri maintainer

source: During your lifetime within Debian, you will have to contact other maintainers for various reasons. You may want to discuss a new way of cooperating between a set of related packages, or you may simply remind someone that a new upstream version is available and that you need it.
it: Durante il corso della vita all'interno di Debian, si dovranno contattare altri maintainer per vari motivi. Si vorrà discutere di un nuovo modo di cooperare tra un insieme di pacchetti correlati, o semplicemente si vorrà ricordare a qualcuno che una nuova versione è disponibile e che se ne ha bisogno.

source: Looking up the email address of the maintainer for the package can be distracting. Fortunately, there is a simple email alias, <literal><replaceable>package</replaceable>@&packages-host;</literal>, which provides a way to email the maintainer, whatever their individual email address (or addresses) may be. Replace <replaceable>package</replaceable> with the name of a source or a binary package.
it: Cercare l'indirizzo email del maintainer del pacchetto può essere fonte di distrazione. Fortunatamente, c'è un semplice alias di posta elettronica, <literal><replaceable>package</replaceable>@&packages-host;</literal>, che fornisce un modo per inviare email al maintainer, qualunque possa essere il loro indirizzo di posta elettronica individuale (o gli indirizzi). Sostituite <replaceable>package</replaceable> con il nome di un sorgente o un pacchetto binario.

source: You may also be interested in contacting the persons who are subscribed to a given source package via <xref linkend="pkg-tracker"/>. You can do so by using the <literal><replaceable>package</replaceable>@&pts-host;</literal> email address.
it: Si potrebbe anche essere interessati a contattare le persone che sono iscritte ad un determinato pacchetto sorgente tramite <xref linkend="pkg-tracker"/>. È possibile farlo utilizzando l'indirizzo email <literal><replaceable>package</replaceable>@&pts-host;</literal>.

source: Dealing with inactive and/or unreachable maintainers
it: Rapportarsi con maintainer non attivi e/o non raggiungibili

source: If you notice that a package is lacking maintenance, you should make sure that the maintainer is active and will continue to work on their packages. It is possible that they are not active any more, but haven't registered out of the system, so to speak. On the other hand, it is also possible that they just need a reminder.
it: Se si nota che un pacchetto è carente di manutenzione, è necessario assicurarsi che i maintainer siano attivi e che continueranno a lavorare sui loro pacchetti. È possibile che essi non siano più attivi, ma non si sono deregistrati dal sistema, per così dire. D'altra parte, è anche possibile che abbiano solo bisogno di un promemoria.

source: There is a simple system (the MIA database) in which information about maintainers who are deemed Missing In Action is recorded. When a member of the QA group contacts an inactive maintainer or finds more information about one, this is recorded in the MIA database. This system is available in <filename>/org/qa.debian.org/mia</filename> on the host <literal>qa.debian.org</literal>, and can be queried with the <command>mia-query</command> tool. Use <command>mia-query --help</command> to see how to query the database. If you find that no information has been recorded about an inactive maintainer yet, or that you can add more information, you should generally proceed as follows.
it: C'è un sistema semplice (il database MIA) in cui vengono registrate informazioni inerenti i maintainer etichettati come Missing In Action. Quando un membro del gruppo QA contatta un maintainer inattivo o trova ulteriori informazioni su qualcuno, questo viene registrato nel database di MIA. Questo sistema è disponibile in <filename>/org/qa.debian.org/MIA</filename> sull'host <literal>qa.debian.org</literal> e può essere interrogato con lo strumento <command>mia-query</command>. Utilizzare <command>mia-query - help</command> per vedere come interrogare il database. Se si scopre che ancora alcuna informazione è stata registrata su un maintainer inattivo, o che è possibile aggiungere ulteriori informazioni, si

source: The first step is to politely contact the maintainer, and wait a reasonable time for a response. It is quite hard to define reasonable time, but it is important to take into account that real life is sometimes very hectic. One way to handle this would be to send a reminder after two weeks.
it: Il primo passo è quello di contattare educatamente il maintainer, ed attendere un ragionevole lasso di tempo per la risposta. È abbastanza difficile definire tempo ragionevole, ma è importante tenere in considerazione che la vita reale a volte è molto frenetica. Un modo per gestire questa situazione sarebbe quello di inviare un sollecito dopo due settimane.

source: If the maintainer doesn't reply within four weeks (a month), one can assume that a response will probably not happen. If that happens, you should investigate further, and try to gather as much useful information about the maintainer in question as possible. This includes:
it: Se il maintainer non risponde entro quattro settimane (un mese), si può supporre che la risposta probabilmente non arriverà. Se ciò accade, si dovrebbe indagare ulteriormente e cercare di raccogliere quante più informazioni utili possibili sul maintainer in questione. Ciò include:

source: The <literal>echelon</literal> information available through the <ulink url="&url-debian-db;">developers' LDAP database</ulink>, which indicates when the developer last posted to a Debian mailing list. (This includes mails about uploads distributed via the &email-debian-devel-changes; list.) Also, remember to check whether the maintainer is marked as on vacation in the database.
it: Le informazioni <literal>echelon</literal> disponibili attraverso il <ulink url="&url-debian-db;">database LDAP degli sviluppatori</ulink>, che indica quando lo sviluppatore ha pubblicato l'ultimo post in una mailing list Debian. (Questo include email su aggiornamenti distribuiti tramite la lista &email-debian-devel-changes;). Inoltre, ricordare di controllare nel database se il maintainer è contrassegnato come in vacanza.

source: The number of packages this maintainer is responsible for, and the condition of those packages. In particular, are there any RC bugs that have been open for ages? Furthermore, how many bugs are there in general? Another important piece of information is whether the packages have been NMUed, and if so, by whom.
it: Il numero di pacchetti dei quali questo maintainer è responsabile e lo stato di quei pacchetti. In particolare, ci sono dei bug RC che sono stati aperti da tempo? Inoltre, quanti bug ci sono in generale? Un altro pezzo importante di informazioni è se i pacchetti sono stati NMUed e se sì, da chi.

source: Is there any activity of the maintainer outside of Debian? For example, they might have posted something recently to non-Debian mailing lists or news groups.
it: C'è qualche attività del maintainer al di fuori di Debian? Ad esempio, potrebbero aver inviato qualcosa di recente a mailing list non-Debian o newsgroup.

source: A bit of a problem are packages which were sponsored — the maintainer is not an official Debian developer. The <literal>echelon</literal> information is not available for sponsored people, for example, so you need to find and contact the Debian developer who has actually uploaded the package. Given that they signed the package, they're responsible for the upload anyhow, and are likely to know what happened to the person they sponsored.
it: Un po' problematici sono i pacchetti che sono stati sponsorizzatiì: il maintainer non è uno sviluppatore Debian ufficiale. Le informazioni <literal>echelon</literal> non sono disponibili per le persone sponsorizzate, per esempio, quindi è necessario trovare e contattare lo sviluppatore Debian che ha effettivamente caricato il pacchetto. Dato che hanno firmato il pacchetto, che sono responsabili per il caricamento in ogni caso, e sono probabilmente intenzionati di sapere cosa è successo alla persona che hanno sponsorizzato.

source: It is also allowed to post a query to &email-debian-devel;, asking if anyone is aware of the whereabouts of the missing maintainer. Please Cc: the person in question.
it: È anche consentito inviare una query a &email-debian-devel; chiedendo se qualcuno è a conoscenza del luogo in cui si trova il maintainer mancante. Si metta in Cc: la persona in questione.

source: Once you have gathered all of this, you can contact &email-mia;. People on this alias will use the information you provide in order to decide how to proceed. For example, they might orphan one or all of the packages of the maintainer. If a package has been NMUed, they might prefer to contact the NMUer before orphaning the package — perhaps the person who has done the NMU is interested in the package.
it: Dopo aver raccolto tutto questo, è possibile contattare &email-mia;. Persone su questo alias utilizzeranno le informazioni fornite al fine di decidere come procedere. Per esempio, potrebbero rendere orfano uno o tutti i pacchetti del maintainer. Se un pacchetto è stato NMUed, potrebbero preferire di contattare la NMUer prima di rendere orfano il pacchetto; forse la persona che ha fatto la NMU è interessato al pacchetto.

source: One last word: please remember to be polite. We are all volunteers and cannot dedicate all of our time to Debian. Also, you are not aware of the circumstances of the person who is involved. Perhaps they might be seriously ill or might even have died — you do not know who may be on the receiving side. Imagine how a relative will feel if they read the e-mail of the deceased and find a very impolite, angry and accusing message!
it: Un'ultima parola: ricordare di essere educati. Si è tutti volontari e non si può dedicare tutto il proprio tempo a Debian. Inoltre, non si è a conoscenza delle circostanze della persona che è coinvolta. Forse potrebbe essere gravemente malata o potrebbe anche essere morta: non potete sapere chi potrebbe essere dall'altra parte. Si immagini come un parente si sentirà se leggesse l'email del defunto e trovasse un messaggio molto scortese, arrabbiato e accusatorio!

source: On the other hand, although we are volunteers, we do have a responsibility. So you can stress the importance of the greater good — if a maintainer does not have the time or interest anymore, they should let go and give the package to someone with more time.
it: D'altra parte, anche se si è volontari, si ha una responsabilità. Così si può sottolineare l'importanza di un bene più grande: se un maintainer non ha più il tempo o interesse, dovrebbe lasciar andare e dare il pacchetto a qualcuno con più tempo.

source: If you are interested in working in the MIA team, please have a look at the <filename>README</filename> file in <filename>/org/qa.debian.org/mia</filename> on <literal>qa.debian.org</literal> where the technical details and the MIA procedures are documented and contact &email-mia;.
it: Se si è interessati a lavorare nel team MIA, si dia un'occhiata al file <filename>README</filename> in <filename>/org/qa.debian.org/mia</filename> su <literal>qa.debian.org</literal> dove i dettagli tecnici e le procedure di MIA sono documentate e contatti &email-mia;.

source: Interacting with prospective Debian developers
it: Interagire con potenziali sviluppatori Debian

source: Debian's success depends on its ability to attract and retain new and talented volunteers. If you are an experienced developer, we recommend that you get involved with the process of bringing in new developers. This section describes how to help new prospective developers.
it: Il successo di Debian dipende dalla sua capacità di attrarre e trattenere nuovi e talentuosi volontari. Se si è uno sviluppatore esperto, si consiglia di partecipare al processo per coinvolgere nuovi sviluppatori. Questa sezione descrive come aiutare i nuovi potenziali sviluppatori.

source: Sponsoring packages
it: Sponsorizzare pacchetti

source: Sponsoring a package means uploading a package for a maintainer who is not able to do it on their own. It's not a trivial matter, the sponsor must verify the packaging and ensure that it is of the high level of quality that Debian strives to have.
it: Sponsorizzare un pacchetto significa caricare un pacchetto per un maintainer, che non è in grado di farlo da solo. Non è una cosa da poco, lo sponsor deve verificare il package ed assicurarsi che esso soddisfi l'elevato livello di qualità che Debian si sforza di avere.

source: Debian Developers can sponsor packages. Debian Maintainers can't.
it: Gli sviluppatori Debian possono sponsorizzare i pacchetti. I maintainer Debian non possono.

source: The maintainer prepares a source package (<filename>.dsc</filename>) and puts it online somewhere (like on <ulink url="http://mentors.debian.net/cgi-bin/welcome">mentors.debian.net</ulink>) or even better, provides a link to a public VCS repository (see <xref linkend="servers-vcs"/>) where the package is maintained.
it: Il maintainer prepara un pacchetto sorgente (<filename>.dsc</filename>) e lo mette in linea da qualche parte (come su <ulink url="http://mentors.debian.net/cgi-bin/welcome">mentors.debian.net</ulink>) o, meglio ancora, fornisce un collegamento a un repository pubblico di VCS (si consulti <xref linkend="servers-vcs"/>) in cui il pacchetto viene mantenuto.

source: The sponsor downloads (or checkouts) the source package.
it: Lo sponsor scarica (o fa il checkout) del sorgente del pacchetto.

source: The sponsor reviews the source package. If they find issues, they inform the maintainer and ask them to provide a fixed version (the process starts over at step 1).
it: Lo sponsor esamina il pacchetto sorgente. Se trova dei problemi, informa il maintainer chiedendogli di fornire una versione corretta (il processo inizia dal punto 1).

source: The sponsor could not find any remaining problem. They build the package, sign it, and upload it to Debian.
it: Lo sponsor non può trovare tutti i problemi che ci sono. Compila il pacchetto, lo firma e lo carica su Debian.

source: The process of sponsoring a package is: <placeholder type="orderedlist" id="0"/>
it: Il processo di sponsorizzazione di un pacchetto è: <placeholder type="orderedlist" id="0"/>

source: Before delving in the details of how to sponsor a package, you should ask yourself whether adding the proposed package is beneficial to Debian.
it: Prima di addentrarci nei dettagli su come sponsorizzare un pacchetto, ci si dovrebbe chiedere se l'aggiunta del pacchetto proposto è vantaggiosa per Debian.

source: There's no simple rule to answer this question, it can depend on many factors: is the upstream codebase mature and not full of security holes? Are there pre-existing packages that can do the same task and how do they compare to this new package? Has the new package been requested by users and how large is the user base? How active are the upstream developers?
it: Non è semplice rispondere a questa domanda, può dipendere da molti fattori: il codice originale è maturo e privo di falle di sicurezza? Ci sono pacchetti pre-esistenti che possono fare lo stesso compito e come si comparano con questo nuovo pacchetto? Il nuovo pacchetto è stato richiesto dagli utenti e da quanti? Quanto sono attivi gli sviluppatori originali?

source: You should also ensure that the prospective maintainer is going to be a good maintainer. Do they already have some experience with other packages? If yes, are they doing a good job with them (check out some bugs)? Are they familiar with the package and its programming language? Do they have the skills needed for this package? If not, are they able to learn them?
it: Ci si dovrebbe anche assicurare che il potenziale maintainer sarà un buon maintainer. Hanno già una certa esperienza con altri pacchetti? Se sì, stanno facendo un buon lavoro con loro (corretti alcuni bug)? Hanno familiarità con il pacchetto e con il suo linguaggio di programmazione? Hanno le competenze necessarie per questo pacchetto? In caso contrario, sono in grado di impararle?

source: It's also a good idea to know where they stand with respect to Debian: do they agree with Debian's philosophy and do they intend to join Debian? Given how easy it is to become a Debian Maintainer, you might want to only sponsor people who plan to join. That way you know from the start that you won't have to act as a sponsor indefinitely.
it: È anche una buona idea conoscere la loro posizione rispetto a Debian: sono d'accordo con la filosofia di Debian e hanno intenzione di aderire a Debian? Considerato quanto sia facile diventare un Maintainer Debian, si potrebbe voler sponsorizzare solo le persone che hanno intenzione di aderire. In questo modo fin dall'inizio si è consapevoli che non si dovrà agire in qualità di sponsor a tempo indeterminato.

source: Sponsoring a new package
it: Sponsorizzare un nuovo pacchetto
